title: Simple keyword detection rule for DNSTracer
id: 63aaa4a7-4c96-46ba-806c-40a5dd73c763
status: experimental
description: Detects interesting keywords based on DNSTracer tool
references:
- https://github.com/pcoder/DNSTracer
author: '@mthcht'
date: 2023/07/30
modified: 2023/12/06
tags:
- attack.T1016
- attack.T1046
- attack.T1556
- attack.TA0001
- attack.TA0007
logsource:
  category:
  - endpoint
detection:
  selection:
  - Image:
    - '*dnstracer*'
  - OriginalFileName:
    - '*dnstracer*'
  - CurrentDirectory:
    - '*dnstracer*'
  - ParentImage:
    - '*dnstracer*'
  - ParentCommandLine:
    - '*dnstracer*'
  - TargetFilename:
    - '*dnstracer*'
  - Signature:
    - '*dnstracer*'
  - signature:
    - '*dnstracer*'
  - ImageLoaded:
    - '*dnstracer*'
  - Company:
    - '*dnstracer*'
  - Description:
    - '*dnstracer*'
  - description:
    - '*dnstracer*'
  - CommandLine:
    - '*dnstracer*'
  - SourceImage:
    - '*dnstracer*'
  - TargetImage:
    - '*dnstracer*'
  - CallTrace:
    - '*dnstracer*'
  - TargetObject:
    - '*dnstracer*'
  - Details:
    - '*dnstracer*'
  - PipeName:
    - '*dnstracer*'
  - Consumer:
    - '*dnstracer*'
  - Destination:
    - '*dnstracer*'
  - Name:
    - '*dnstracer*'
  - Query:
    - '*dnstracer*'
  - NewName:
    - '*dnstracer*'
  - StartAddress:
    - '*dnstracer*'
  - StartModule:
    - '*dnstracer*'
  - StartFunction:
    - '*dnstracer*'
  - SourceHostname:
    - '*dnstracer*'
  - Device:
    - '*dnstracer*'
  - file_name:
    - '*dnstracer*'
  - file_path:
    - '*dnstracer*'
  - process:
    - '*dnstracer*'
  - original_file_name:
    - '*dnstracer*'
  - parent_process:
    - '*dnstracer*'
  - process_path:
    - '*dnstracer*'
  - service_path:
    - '*dnstracer*'
  - registry_path:
    - '*dnstracer*'
  - registry_value_data:
    - '*dnstracer*'
  - registry_value_name:
    - '*dnstracer*'
  - ContextInfo:
    - '*dnstracer*'
  - Payload:
    - '*dnstracer*'
  - ScriptBlockText:
    - '*dnstracer*'
  - ServerName:
    - '*dnstracer*'
  - TransportName:
    - '*dnstracer*'
  - NewProcessName:
    - '*dnstracer*'
  - ParentProcessName:
    - '*dnstracer*'
  - Application:
    - '*dnstracer*'
  - Product Name:
    - '*dnstracer*'
  - Threat Name:
    - '*dnstracer*'
  - Process Name:
    - '*dnstracer*'
  - Path:
    - '*dnstracer*'
  - ImagePath:
    - '*dnstracer*'
  - ServiceName:
    - '*dnstracer*'
  - ProcessPath:
    - '*dnstracer*'
  - AppName:
    - '*dnstracer*'
  - AppPath:
    - '*dnstracer*'
  - ModulePath:
    - '*dnstracer*'
  - registry.data.strings:
    - '*dnstracer*'
  - registry.path:
    - '*dnstracer*'
  - registry.value:
    - '*dnstracer*'
  - process.args:
    - '*dnstracer*'
  - process.command_line:
    - '*dnstracer*'
  - process.env_vars:
    - '*dnstracer*'
  - process.io.text:
    - '*dnstracer*'
  - process.executable:
    - '*dnstracer*'
  - process.name:
    - '*dnstracer*'
  - process.title:
    - '*dnstracer*'
  - pe.company:
    - '*dnstracer*'
  - pe.description:
    - '*dnstracer*'
  - pe.original_file_name:
    - '*dnstracer*'
  - pe.product:
    - '*dnstracer*'
  - os.full:
    - '*dnstracer*'
  - host.hostname:
    - '*dnstracer*'
  - file.fork_name:
    - '*dnstracer*'
  - file.name:
    - '*dnstracer*'
  - file.path:
    - '*dnstracer*'
  - file.target_path:
    - '*dnstracer*'
  - email.attachments.file.name:
    - '*dnstracer*'
  - email.subject:
    - '*dnstracer*'
  - dll.path:
    - '*dnstracer*'
  - device.model.name:
    - '*dnstracer*'
  - container.image.name:
    - '*dnstracer*'
  - container.name:
    - '*dnstracer*'
  - object:
    - '*dnstracer*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
falsepositives:
- unknown
level: medium
