[
    {
        "keyword": "*Add-ObjectAcl -TargetADSprefix 'CN=AdminSDHolder*CN=System' -PrincipalSamAccountName * -Rights All*",
        "description": "modifying existing permissions on an Active Directory object ('AdminSDHolder'). which can be used to maintain unauthorized access or escalate privileges in the targeted environment. The 'AdminSDHolder' container plays a crucial role in managing the security of protected groups in Active Directory. and modifying its permissions may lead to unintended security consequences.",
        "tool_name": "powerview",
        "reference": "https://github.com/zloeber/PSAD/blob/master/src/inprogress/Add-ObjectACL.ps1",
        "severity": "N/A",
        "popularity": "1",
        "keyword_type": "offensive_tool_keyword",
        "comment": "N/A",
        "tactics": "TA0003",
        "techniques": "T1222",
        "endpoint_detection": true,
        "network_detection": false
    },
    {
        "keyword": "*PowerView.ps1*",
        "description": "PowerView is a PowerShell tool to gain network situational awareness on Windows domains. It contains a set of pure-PowerShell replacements for various windows net commands. which utilize PowerShell AD hooks and underlying Win32 API functions to perform useful Windows domain functionality It also implements various useful metafunctions. including some custom-written user-hunting functions which will identify where on the network specific users are logged into. It can also check which machines on the domain the current user has local administrator access on. Several functions for the enumeration and abuse of domain trusts also exist",
        "tool_name": "powerview",
        "reference": "https://github.com/PowerShellMafia/PowerSploit/tree/master/Recon",
        "severity": "N/A",
        "popularity": "10",
        "keyword_type": "offensive_tool_keyword",
        "comment": "N/A",
        "tactics": "TA0002 - TA0003 - TA0008",
        "techniques": "T1087 - T1069 - T1064 - T1002 - T1552",
        "endpoint_detection": true,
        "network_detection": false
    }
]