title: Simple keyword detection rule for shred
id: 0bb42205-be11-48f4-9aca-d0f7f36dbfc1
status: experimental
description:
- '''Malware or other files dropped or created on a system by an adversary may leave
  traces behind as to what was done within a network and how. Adversaries may remove
  these files over the course of an intrusion to keep their footprint low or remove
  them at the end as part of the post-intrusion cleanup process.'''
references:
- https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_file_deletion_via_shred.toml
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/13
tags:
- attack.T1027
- attack.T1070.004
- attack.T1564.001
- attack.TA0005
- attack.TA0011
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    CommandLine:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    Details:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    registry.value:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    process.args:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    process.command_line:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    process.env_vars:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    process.io.text:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    process.title:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    pe.company:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    pe.description:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    pe.product:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    os.full:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    host.hostname:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    event.original:
    - '*shred --remove*'
    - '*shred --zero*'
    email.subject:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    device.model.name:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    container.image.name:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    container.name:
    - '*shred --remove*'
    - '*shred -u*'
    - '*shred -z*'
    - '*shred --zero*'
    Image:
    - '*shred -u*'
    - '*shred -z*'
    OriginalFileName:
    - '*shred -u*'
    - '*shred -z*'
    CurrentDirectory:
    - '*shred -u*'
    - '*shred -z*'
    ParentImage:
    - '*shred -u*'
    - '*shred -z*'
    TargetFilename:
    - '*shred -u*'
    - '*shred -z*'
    Signature:
    - '*shred -u*'
    - '*shred -z*'
    signature:
    - '*shred -u*'
    - '*shred -z*'
    ImageLoaded:
    - '*shred -u*'
    - '*shred -z*'
    Company:
    - '*shred -u*'
    - '*shred -z*'
    Description:
    - '*shred -u*'
    - '*shred -z*'
    description:
    - '*shred -u*'
    - '*shred -z*'
    SourceImage:
    - '*shred -u*'
    - '*shred -z*'
    TargetImage:
    - '*shred -u*'
    - '*shred -z*'
    CallTrace:
    - '*shred -u*'
    - '*shred -z*'
    TargetObject:
    - '*shred -u*'
    - '*shred -z*'
    PipeName:
    - '*shred -u*'
    - '*shred -z*'
    Consumer:
    - '*shred -u*'
    - '*shred -z*'
    Destination:
    - '*shred -u*'
    - '*shred -z*'
    Name:
    - '*shred -u*'
    - '*shred -z*'
    Query:
    - '*shred -u*'
    - '*shred -z*'
    NewName:
    - '*shred -u*'
    - '*shred -z*'
    StartAddress:
    - '*shred -u*'
    - '*shred -z*'
    StartModule:
    - '*shred -u*'
    - '*shred -z*'
    StartFunction:
    - '*shred -u*'
    - '*shred -z*'
    SourceHostname:
    - '*shred -u*'
    - '*shred -z*'
    Device:
    - '*shred -u*'
    - '*shred -z*'
    file_name:
    - '*shred -u*'
    - '*shred -z*'
    file_path:
    - '*shred -u*'
    - '*shred -z*'
    process:
    - '*shred -u*'
    - '*shred -z*'
    original_file_name:
    - '*shred -u*'
    - '*shred -z*'
    parent_process:
    - '*shred -u*'
    - '*shred -z*'
    process_path:
    - '*shred -u*'
    - '*shred -z*'
    service_path:
    - '*shred -u*'
    - '*shred -z*'
    registry_path:
    - '*shred -u*'
    - '*shred -z*'
    registry_value_data:
    - '*shred -u*'
    - '*shred -z*'
    registry_value_name:
    - '*shred -u*'
    - '*shred -z*'
    ContextInfo:
    - '*shred -u*'
    - '*shred -z*'
    Payload:
    - '*shred -u*'
    - '*shred -z*'
    ScriptBlockText:
    - '*shred -u*'
    - '*shred -z*'
    ServerName:
    - '*shred -u*'
    - '*shred -z*'
    TransportName:
    - '*shred -u*'
    - '*shred -z*'
    NewProcessName:
    - '*shred -u*'
    - '*shred -z*'
    ParentProcessName:
    - '*shred -u*'
    - '*shred -z*'
    Application:
    - '*shred -u*'
    - '*shred -z*'
    Product Name:
    - '*shred -u*'
    - '*shred -z*'
    Threat Name:
    - '*shred -u*'
    - '*shred -z*'
    Process Name:
    - '*shred -u*'
    - '*shred -z*'
    Path:
    - '*shred -u*'
    - '*shred -z*'
    ImagePath:
    - '*shred -u*'
    - '*shred -z*'
    ServiceName:
    - '*shred -u*'
    - '*shred -z*'
    ProcessPath:
    - '*shred -u*'
    - '*shred -z*'
    AppName:
    - '*shred -u*'
    - '*shred -z*'
    AppPath:
    - '*shred -u*'
    - '*shred -z*'
    ModulePath:
    - '*shred -u*'
    - '*shred -z*'
    registry.data.strings:
    - '*shred -u*'
    - '*shred -z*'
    registry.path:
    - '*shred -u*'
    - '*shred -z*'
    process.executable:
    - '*shred -u*'
    - '*shred -z*'
    process.name:
    - '*shred -u*'
    - '*shred -z*'
    pe.original_file_name:
    - '*shred -u*'
    - '*shred -z*'
    file.fork_name:
    - '*shred -u*'
    - '*shred -z*'
    file.name:
    - '*shred -u*'
    - '*shred -z*'
    file.path:
    - '*shred -u*'
    - '*shred -z*'
    file.target_path:
    - '*shred -u*'
    - '*shred -z*'
    email.attachments.file.name:
    - '*shred -u*'
    - '*shred -z*'
    dll.path:
    - '*shred -u*'
    - '*shred -z*'
    object:
    - '*shred -u*'
    - '*shred -z*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
