title: Simple keyword detection rule for Harvester_OF_SORROW
id: 8ffa85df-50fe-41f1-8166-9658cf3e4d6a
status: experimental
description:
- '''The payload opens firefox about:logins and tabs and arrows its way through options.
  It then takes a screen shot with the first set of log in credentials made visible.
  Finally it sends the screenshot  to an email of your choosing.'''
references:
- https://github.com/hak5/omg-payloads/blob/master/payloads/library/credentials/Harvester_OF_SORROW/payload.txt
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/11
tags:
- attack.T1056.001
- attack.T1059.006
- attack.T1113
- attack.T1512
- attack.T1566.001
- attack.TA0004
- attack.TA0009
- attack.TA0010
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- high
detection:
  selection:
    ParentCommandLine:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    CommandLine:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    Details:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    registry.value:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    process.args:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    process.command_line:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    process.env_vars:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    process.io.text:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    process.title:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    pe.company:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    pe.description:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    pe.product:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    os.full:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    host.hostname:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    event.original:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    email.subject:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    device.model.name:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    container.image.name:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    container.name:
    - '*STRING firefox about:logins*'
    - '*REM Title: Harvester_OF_SORROW*'
    - '* Pictures\Screenshots\loot.zip*'
    Image:
    - '* Pictures\Screenshots\loot.zip*'
    OriginalFileName:
    - '* Pictures\Screenshots\loot.zip*'
    CurrentDirectory:
    - '* Pictures\Screenshots\loot.zip*'
    ParentImage:
    - '* Pictures\Screenshots\loot.zip*'
    TargetFilename:
    - '* Pictures\Screenshots\loot.zip*'
    Signature:
    - '* Pictures\Screenshots\loot.zip*'
    signature:
    - '* Pictures\Screenshots\loot.zip*'
    ImageLoaded:
    - '* Pictures\Screenshots\loot.zip*'
    Company:
    - '* Pictures\Screenshots\loot.zip*'
    Description:
    - '* Pictures\Screenshots\loot.zip*'
    description:
    - '* Pictures\Screenshots\loot.zip*'
    SourceImage:
    - '* Pictures\Screenshots\loot.zip*'
    TargetImage:
    - '* Pictures\Screenshots\loot.zip*'
    CallTrace:
    - '* Pictures\Screenshots\loot.zip*'
    TargetObject:
    - '* Pictures\Screenshots\loot.zip*'
    PipeName:
    - '* Pictures\Screenshots\loot.zip*'
    Consumer:
    - '* Pictures\Screenshots\loot.zip*'
    Destination:
    - '* Pictures\Screenshots\loot.zip*'
    Name:
    - '* Pictures\Screenshots\loot.zip*'
    Query:
    - '* Pictures\Screenshots\loot.zip*'
    NewName:
    - '* Pictures\Screenshots\loot.zip*'
    StartAddress:
    - '* Pictures\Screenshots\loot.zip*'
    StartModule:
    - '* Pictures\Screenshots\loot.zip*'
    StartFunction:
    - '* Pictures\Screenshots\loot.zip*'
    SourceHostname:
    - '* Pictures\Screenshots\loot.zip*'
    Device:
    - '* Pictures\Screenshots\loot.zip*'
    file_name:
    - '* Pictures\Screenshots\loot.zip*'
    file_path:
    - '* Pictures\Screenshots\loot.zip*'
    process:
    - '* Pictures\Screenshots\loot.zip*'
    original_file_name:
    - '* Pictures\Screenshots\loot.zip*'
    parent_process:
    - '* Pictures\Screenshots\loot.zip*'
    process_path:
    - '* Pictures\Screenshots\loot.zip*'
    service_path:
    - '* Pictures\Screenshots\loot.zip*'
    registry_path:
    - '* Pictures\Screenshots\loot.zip*'
    registry_value_data:
    - '* Pictures\Screenshots\loot.zip*'
    registry_value_name:
    - '* Pictures\Screenshots\loot.zip*'
    ContextInfo:
    - '* Pictures\Screenshots\loot.zip*'
    Payload:
    - '* Pictures\Screenshots\loot.zip*'
    ScriptBlockText:
    - '* Pictures\Screenshots\loot.zip*'
    ServerName:
    - '* Pictures\Screenshots\loot.zip*'
    TransportName:
    - '* Pictures\Screenshots\loot.zip*'
    NewProcessName:
    - '* Pictures\Screenshots\loot.zip*'
    ParentProcessName:
    - '* Pictures\Screenshots\loot.zip*'
    Application:
    - '* Pictures\Screenshots\loot.zip*'
    Product Name:
    - '* Pictures\Screenshots\loot.zip*'
    Threat Name:
    - '* Pictures\Screenshots\loot.zip*'
    Process Name:
    - '* Pictures\Screenshots\loot.zip*'
    Path:
    - '* Pictures\Screenshots\loot.zip*'
    ImagePath:
    - '* Pictures\Screenshots\loot.zip*'
    ServiceName:
    - '* Pictures\Screenshots\loot.zip*'
    ProcessPath:
    - '* Pictures\Screenshots\loot.zip*'
    AppName:
    - '* Pictures\Screenshots\loot.zip*'
    AppPath:
    - '* Pictures\Screenshots\loot.zip*'
    ModulePath:
    - '* Pictures\Screenshots\loot.zip*'
    registry.data.strings:
    - '* Pictures\Screenshots\loot.zip*'
    registry.path:
    - '* Pictures\Screenshots\loot.zip*'
    process.executable:
    - '* Pictures\Screenshots\loot.zip*'
    process.name:
    - '* Pictures\Screenshots\loot.zip*'
    pe.original_file_name:
    - '* Pictures\Screenshots\loot.zip*'
    file.fork_name:
    - '* Pictures\Screenshots\loot.zip*'
    file.name:
    - '* Pictures\Screenshots\loot.zip*'
    file.path:
    - '* Pictures\Screenshots\loot.zip*'
    file.target_path:
    - '* Pictures\Screenshots\loot.zip*'
    email.attachments.file.name:
    - '* Pictures\Screenshots\loot.zip*'
    dll.path:
    - '* Pictures\Screenshots\loot.zip*'
    object:
    - '* Pictures\Screenshots\loot.zip*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
