title: Simple keyword detection rule for netstat
id: 88b6dd83-26d4-4f13-a864-a37dea464854
status: experimental
description:
- '''Adversaries may attempt to execute recon commands'''
- '''View all active TCP connections and the TCP and UDP ports the host is listening
  on.'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/28
tags:
- attack.T1046
- attack.T1069
- attack.TA0002
- attack.TA0003
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    OriginalFileName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    CurrentDirectory:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ParentImage:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ParentCommandLine:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    TargetFilename:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Signature:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    signature:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ImageLoaded:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Company:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Description:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    description:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    CommandLine:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    SourceImage:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    TargetImage:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    CallTrace:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    TargetObject:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Details:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    PipeName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Consumer:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Destination:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Query:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    NewName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    StartAddress:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    StartModule:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    StartFunction:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    SourceHostname:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Device:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    file_name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    file_path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    original_file_name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    parent_process:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process_path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    service_path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    registry_path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    registry_value_data:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    registry_value_name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ContextInfo:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Payload:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ScriptBlockText:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ServerName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    TransportName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    NewProcessName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ParentProcessName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Application:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Product Name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Threat Name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Process Name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    Path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ImagePath:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ServiceName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ProcessPath:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    AppName:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    AppPath:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    ModulePath:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    registry.data.strings:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    registry.path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    registry.value:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process.args:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process.command_line:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process.env_vars:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process.io.text:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process.executable:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process.name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    process.title:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    pe.company:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    pe.description:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    pe.original_file_name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    pe.product:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    os.full:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    host.hostname:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    file.fork_name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    file.name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    file.path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    file.target_path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    email.attachments.file.name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    email.subject:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    dll.path:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    device.model.name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    container.image.name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    container.name:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
    object:
    - '*NETSTAT.EXE* -ano*'
    - '*netstat -ano*'
    - '*netstat -ant*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
