title: Simple keyword detection rule for gateway-finder-imp
id: e33445aa-40e6-4fa0-bfd4-1e043b8c9cc6
status: experimental
description:
- '''This is an improved version of original Gateway-finder. New version rebuilt with
  python3 and support for files with MACs/IPs The homepage of original project is:
  http://pentestmonkey.net/tools/gateway-finder Gateway-finder is a scapy script that
  will help you determine which of the systems on the local LAN has IP forwarding
  enabled and which can reach the Internet.'''
references:
- https://github.com/whitel1st/gateway-finder-imp
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/09
tags:
- attack.T1016
- attack.T1021
- attack.T1049
- attack.T1213
- attack.TA0001
- attack.TA0002
- attack.TA0003
- attack.TA0007
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*gateway-finder*'
    OriginalFileName:
    - '*gateway-finder*'
    CurrentDirectory:
    - '*gateway-finder*'
    ParentImage:
    - '*gateway-finder*'
    ParentCommandLine:
    - '*gateway-finder*'
    TargetFilename:
    - '*gateway-finder*'
    Signature:
    - '*gateway-finder*'
    signature:
    - '*gateway-finder*'
    ImageLoaded:
    - '*gateway-finder*'
    Company:
    - '*gateway-finder*'
    Description:
    - '*gateway-finder*'
    description:
    - '*gateway-finder*'
    CommandLine:
    - '*gateway-finder*'
    SourceImage:
    - '*gateway-finder*'
    TargetImage:
    - '*gateway-finder*'
    CallTrace:
    - '*gateway-finder*'
    TargetObject:
    - '*gateway-finder*'
    Details:
    - '*gateway-finder*'
    PipeName:
    - '*gateway-finder*'
    Consumer:
    - '*gateway-finder*'
    Destination:
    - '*gateway-finder*'
    Name:
    - '*gateway-finder*'
    Query:
    - '*gateway-finder*'
    NewName:
    - '*gateway-finder*'
    StartAddress:
    - '*gateway-finder*'
    StartModule:
    - '*gateway-finder*'
    StartFunction:
    - '*gateway-finder*'
    SourceHostname:
    - '*gateway-finder*'
    Device:
    - '*gateway-finder*'
    file_name:
    - '*gateway-finder*'
    file_path:
    - '*gateway-finder*'
    process:
    - '*gateway-finder*'
    original_file_name:
    - '*gateway-finder*'
    parent_process:
    - '*gateway-finder*'
    process_path:
    - '*gateway-finder*'
    service_path:
    - '*gateway-finder*'
    registry_path:
    - '*gateway-finder*'
    registry_value_data:
    - '*gateway-finder*'
    registry_value_name:
    - '*gateway-finder*'
    ContextInfo:
    - '*gateway-finder*'
    Payload:
    - '*gateway-finder*'
    ScriptBlockText:
    - '*gateway-finder*'
    ServerName:
    - '*gateway-finder*'
    TransportName:
    - '*gateway-finder*'
    NewProcessName:
    - '*gateway-finder*'
    ParentProcessName:
    - '*gateway-finder*'
    Application:
    - '*gateway-finder*'
    Product Name:
    - '*gateway-finder*'
    Threat Name:
    - '*gateway-finder*'
    Process Name:
    - '*gateway-finder*'
    Path:
    - '*gateway-finder*'
    ImagePath:
    - '*gateway-finder*'
    ServiceName:
    - '*gateway-finder*'
    ProcessPath:
    - '*gateway-finder*'
    AppName:
    - '*gateway-finder*'
    AppPath:
    - '*gateway-finder*'
    ModulePath:
    - '*gateway-finder*'
    registry.data.strings:
    - '*gateway-finder*'
    registry.path:
    - '*gateway-finder*'
    registry.value:
    - '*gateway-finder*'
    process.args:
    - '*gateway-finder*'
    process.command_line:
    - '*gateway-finder*'
    process.env_vars:
    - '*gateway-finder*'
    process.io.text:
    - '*gateway-finder*'
    process.executable:
    - '*gateway-finder*'
    process.name:
    - '*gateway-finder*'
    process.title:
    - '*gateway-finder*'
    pe.company:
    - '*gateway-finder*'
    pe.description:
    - '*gateway-finder*'
    pe.original_file_name:
    - '*gateway-finder*'
    pe.product:
    - '*gateway-finder*'
    os.full:
    - '*gateway-finder*'
    host.hostname:
    - '*gateway-finder*'
    file.fork_name:
    - '*gateway-finder*'
    file.name:
    - '*gateway-finder*'
    file.path:
    - '*gateway-finder*'
    file.target_path:
    - '*gateway-finder*'
    email.attachments.file.name:
    - '*gateway-finder*'
    email.subject:
    - '*gateway-finder*'
    dll.path:
    - '*gateway-finder*'
    device.model.name:
    - '*gateway-finder*'
    container.image.name:
    - '*gateway-finder*'
    container.name:
    - '*gateway-finder*'
    object:
    - '*gateway-finder*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
