title: Simple keyword detection rule for RemAdm
id: 628b6c33-150c-410d-8061-5e2beb0b076c
status: experimental
description:
- '''Antiviurs signature_keyword for remote administration tools '''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/28
tags:
- attack.T1021
- attack.T1027
- attack.T1046
- attack.T1057
- attack.T1068
- attack.T1072
- attack.T1078
- attack.T1135
- attack.T1485
- attack.T1489
- attack.T1497
- attack.T1547
- attack.TA0001
- attack.TA0002
- attack.TA0003
- attack.TA0004
- attack.TA0005
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0011
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*RemAdm*'
    OriginalFileName:
    - '*RemAdm*'
    CurrentDirectory:
    - '*RemAdm*'
    ParentImage:
    - '*RemAdm*'
    ParentCommandLine:
    - '*RemAdm*'
    TargetFilename:
    - '*RemAdm*'
    Signature:
    - '*RemAdm*'
    signature:
    - '*RemAdm*'
    ImageLoaded:
    - '*RemAdm*'
    Company:
    - '*RemAdm*'
    Description:
    - '*RemAdm*'
    description:
    - '*RemAdm*'
    CommandLine:
    - '*RemAdm*'
    SourceImage:
    - '*RemAdm*'
    TargetImage:
    - '*RemAdm*'
    CallTrace:
    - '*RemAdm*'
    TargetObject:
    - '*RemAdm*'
    Details:
    - '*RemAdm*'
    PipeName:
    - '*RemAdm*'
    Consumer:
    - '*RemAdm*'
    Destination:
    - '*RemAdm*'
    Name:
    - '*RemAdm*'
    Query:
    - '*RemAdm*'
    NewName:
    - '*RemAdm*'
    StartAddress:
    - '*RemAdm*'
    StartModule:
    - '*RemAdm*'
    StartFunction:
    - '*RemAdm*'
    SourceHostname:
    - '*RemAdm*'
    Device:
    - '*RemAdm*'
    file_name:
    - '*RemAdm*'
    file_path:
    - '*RemAdm*'
    process:
    - '*RemAdm*'
    original_file_name:
    - '*RemAdm*'
    parent_process:
    - '*RemAdm*'
    process_path:
    - '*RemAdm*'
    service_path:
    - '*RemAdm*'
    registry_path:
    - '*RemAdm*'
    registry_value_data:
    - '*RemAdm*'
    registry_value_name:
    - '*RemAdm*'
    ContextInfo:
    - '*RemAdm*'
    Payload:
    - '*RemAdm*'
    ScriptBlockText:
    - '*RemAdm*'
    ServerName:
    - '*RemAdm*'
    TransportName:
    - '*RemAdm*'
    NewProcessName:
    - '*RemAdm*'
    ParentProcessName:
    - '*RemAdm*'
    Application:
    - '*RemAdm*'
    Product Name:
    - '*RemAdm*'
    Threat Name:
    - '*RemAdm*'
    Process Name:
    - '*RemAdm*'
    Path:
    - '*RemAdm*'
    ImagePath:
    - '*RemAdm*'
    ServiceName:
    - '*RemAdm*'
    ProcessPath:
    - '*RemAdm*'
    AppName:
    - '*RemAdm*'
    AppPath:
    - '*RemAdm*'
    ModulePath:
    - '*RemAdm*'
    registry.data.strings:
    - '*RemAdm*'
    registry.path:
    - '*RemAdm*'
    registry.value:
    - '*RemAdm*'
    process.args:
    - '*RemAdm*'
    process.command_line:
    - '*RemAdm*'
    process.env_vars:
    - '*RemAdm*'
    process.io.text:
    - '*RemAdm*'
    process.executable:
    - '*RemAdm*'
    process.name:
    - '*RemAdm*'
    process.title:
    - '*RemAdm*'
    pe.company:
    - '*RemAdm*'
    pe.description:
    - '*RemAdm*'
    pe.original_file_name:
    - '*RemAdm*'
    pe.product:
    - '*RemAdm*'
    os.full:
    - '*RemAdm*'
    host.hostname:
    - '*RemAdm*'
    file.fork_name:
    - '*RemAdm*'
    file.name:
    - '*RemAdm*'
    file.path:
    - '*RemAdm*'
    file.target_path:
    - '*RemAdm*'
    email.attachments.file.name:
    - '*RemAdm*'
    email.subject:
    - '*RemAdm*'
    dll.path:
    - '*RemAdm*'
    device.model.name:
    - '*RemAdm*'
    container.image.name:
    - '*RemAdm*'
    container.name:
    - '*RemAdm*'
    object:
    - '*RemAdm*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
