title: Simple keyword detection rule for SMBGhost
id: 9b64d540-27fa-49c5-94f0-4fc6061b9e45
status: experimental
description:
- '''Simple scanner for CVE-2020-0796 - SMBv3 RCE.'''
references:
- https://github.com/ollypwn/SMBGhost
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/09
tags:
- attack.T1027
- attack.T1210
- attack.T1216
- attack.T1553
- attack.T1573
- attack.TA0006
- attack.TA0008
- attack.TA0011
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    OriginalFileName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    CurrentDirectory:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ParentImage:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ParentCommandLine:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    TargetFilename:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Signature:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    signature:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ImageLoaded:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Company:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Description:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    description:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    CommandLine:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    SourceImage:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    TargetImage:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    CallTrace:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    TargetObject:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Details:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    PipeName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Consumer:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Destination:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Query:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    NewName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    StartAddress:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    StartModule:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    StartFunction:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    SourceHostname:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Device:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    file_name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    file_path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    original_file_name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    parent_process:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process_path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    service_path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    registry_path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    registry_value_data:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    registry_value_name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ContextInfo:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Payload:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ScriptBlockText:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ServerName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    TransportName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    NewProcessName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ParentProcessName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Application:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Product Name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Threat Name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Process Name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    Path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ImagePath:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ServiceName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ProcessPath:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    AppName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    AppPath:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    ModulePath:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    registry.data.strings:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    registry.path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    registry.value:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process.args:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process.command_line:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process.env_vars:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process.io.text:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process.executable:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process.name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    process.title:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    pe.company:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    pe.description:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    pe.original_file_name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    pe.product:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    os.full:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    host.hostname:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    file.fork_name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    file.name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    file.path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    file.target_path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    email.attachments.file.name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    email.subject:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    dll.path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    device.model.name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    container.image.name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    container.name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    object:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    url:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    dest_url:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    uri:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    uri_query:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    query:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    url_domain:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    uri_path:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    domain:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    QueryName:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    QueryResults:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    DestinationHostname:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    DestinationIp:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    http_referrer:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    http_referrer_domain:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    http_user_agent:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    dest_nt_host:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    sender:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    recipient:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    orig_recipient:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    subject:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    url.domain:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    url.full:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    url.original:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    url.query:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    user_agent.original:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    network.application:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    http.request.body.content:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    http.request.referrer:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    email.from.address:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    dns.question.name:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
    destination.domain:
    - '*/SMBGhost/scanner.py*'
    - '*SMBGhost.pcap*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
