title: Simple keyword detection rule for 7zip
id: 8635300d-ccc1-45b2-905c-bf6de7f72366
status: experimental
description: Detects interesting keywords based on 7zip tool
references:
- http://www.joeware.net/freetools/tools/adfind/index.htm
author: '@mthcht'
date: 2023/07/30
modified: 2023/12/25
tags:
- attack.T1074.001
- attack.T1083
- attack.T1105
- attack.T1560.001
- attack.TA0003
- attack.TA0007
- attack.TA0009
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - CommandLine:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - Details:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - registry.value:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - process.args:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - process.command_line:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - process.env_vars:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - process.io.text:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - process.title:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - pe.company:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - pe.description:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - pe.product:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - os.full:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - host.hostname:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - event.original:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - email.subject:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - device.model.name:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - container.image.name:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  - container.name:
    - '*7.exe a -mx3 ad.7z ad_*.txt*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
