title: Simple keyword detection rule for translate.goog
id: 004b014c-16b7-4118-bd4a-8c727a6b633d
status: experimental
description: Detects interesting keywords based on translate.goog tool
references:
- https://*-com.translate.goog/*
author: '@mthcht'
date: 2023/07/30
modified: 2024/11/02
tags:
- attack.T1090.003
- attack.TA0005
logsource:
  category:
  - network
detection:
  selection:
  - url:
    - '*https://github-com.translate.goog/*'
  - dest_url:
    - '*https://github-com.translate.goog/*'
  - uri:
    - '*https://github-com.translate.goog/*'
  - uri_query:
    - '*https://github-com.translate.goog/*'
  - query:
    - '*https://github-com.translate.goog/*'
  - url_domain:
    - '*https://github-com.translate.goog/*'
  - uri_path:
    - '*https://github-com.translate.goog/*'
  - domain:
    - '*https://github-com.translate.goog/*'
  - QueryName:
    - '*https://github-com.translate.goog/*'
  - QueryResults:
    - '*https://github-com.translate.goog/*'
  - DestinationHostname:
    - '*https://github-com.translate.goog/*'
  - DestinationIp:
    - '*https://github-com.translate.goog/*'
  - http_referrer:
    - '*https://github-com.translate.goog/*'
  - http_referrer_domain:
    - '*https://github-com.translate.goog/*'
  - http_user_agent:
    - '*https://github-com.translate.goog/*'
  - dest_nt_host:
    - '*https://github-com.translate.goog/*'
  - sender:
    - '*https://github-com.translate.goog/*'
  - recipient:
    - '*https://github-com.translate.goog/*'
  - orig_recipient:
    - '*https://github-com.translate.goog/*'
  - subject:
    - '*https://github-com.translate.goog/*'
  - url.domain:
    - '*https://github-com.translate.goog/*'
  - url.full:
    - '*https://github-com.translate.goog/*'
  - url.original:
    - '*https://github-com.translate.goog/*'
  - url.query:
    - '*https://github-com.translate.goog/*'
  - user_agent.original:
    - '*https://github-com.translate.goog/*'
  - network.application:
    - '*https://github-com.translate.goog/*'
  - http.request.body.content:
    - '*https://github-com.translate.goog/*'
  - http.request.referrer:
    - '*https://github-com.translate.goog/*'
  - email.from.address:
    - '*https://github-com.translate.goog/*'
  - dns.question.name:
    - '*https://github-com.translate.goog/*'
  - destination.domain:
    - '*https://github-com.translate.goog/*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
