title: Simple keyword detection rule for b374k
id: 0246fafb-bcc2-4df7-bf82-bab870eec8f2
status: experimental
description:
- '''This PHP Shell is a useful tool for system or web administrator to do remote
  management without using cpanel. connecting using ssh. ftp etc. All actions take
  place within a web browser'''
references:
- https://github.com/b374k/b374k
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/19
tags:
- attack.T1021
- attack.T1028
- attack.T1071
- attack.T1105
- attack.T1135
- attack.TA0002
- attack.TA0003
- attack.TA0005
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    CommandLine:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    Details:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    registry.value:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    process.args:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    process.command_line:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    process.env_vars:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    process.io.text:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    process.title:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    pe.company:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    pe.description:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    pe.product:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    os.full:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    host.hostname:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    event.original:
    - '*php -f *.php -- -o myShell.php*'
    email.subject:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    device.model.name:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    container.image.name:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    container.name:
    - '*php -f *.php -- -o myShell.php*'
    - '*/B374K*'
    - '*B374K*index.php*'
    Image:
    - '*/B374K*'
    - '*B374K*index.php*'
    OriginalFileName:
    - '*/B374K*'
    - '*B374K*index.php*'
    CurrentDirectory:
    - '*/B374K*'
    - '*B374K*index.php*'
    ParentImage:
    - '*/B374K*'
    - '*B374K*index.php*'
    TargetFilename:
    - '*/B374K*'
    - '*B374K*index.php*'
    Signature:
    - '*/B374K*'
    - '*B374K*index.php*'
    signature:
    - '*/B374K*'
    - '*B374K*index.php*'
    ImageLoaded:
    - '*/B374K*'
    - '*B374K*index.php*'
    Company:
    - '*/B374K*'
    - '*B374K*index.php*'
    Description:
    - '*/B374K*'
    - '*B374K*index.php*'
    description:
    - '*/B374K*'
    - '*B374K*index.php*'
    SourceImage:
    - '*/B374K*'
    - '*B374K*index.php*'
    TargetImage:
    - '*/B374K*'
    - '*B374K*index.php*'
    CallTrace:
    - '*/B374K*'
    - '*B374K*index.php*'
    TargetObject:
    - '*/B374K*'
    - '*B374K*index.php*'
    PipeName:
    - '*/B374K*'
    - '*B374K*index.php*'
    Consumer:
    - '*/B374K*'
    - '*B374K*index.php*'
    Destination:
    - '*/B374K*'
    - '*B374K*index.php*'
    Name:
    - '*/B374K*'
    - '*B374K*index.php*'
    Query:
    - '*/B374K*'
    - '*B374K*index.php*'
    NewName:
    - '*/B374K*'
    - '*B374K*index.php*'
    StartAddress:
    - '*/B374K*'
    - '*B374K*index.php*'
    StartModule:
    - '*/B374K*'
    - '*B374K*index.php*'
    StartFunction:
    - '*/B374K*'
    - '*B374K*index.php*'
    SourceHostname:
    - '*/B374K*'
    - '*B374K*index.php*'
    Device:
    - '*/B374K*'
    - '*B374K*index.php*'
    file_name:
    - '*/B374K*'
    - '*B374K*index.php*'
    file_path:
    - '*/B374K*'
    - '*B374K*index.php*'
    process:
    - '*/B374K*'
    - '*B374K*index.php*'
    original_file_name:
    - '*/B374K*'
    - '*B374K*index.php*'
    parent_process:
    - '*/B374K*'
    - '*B374K*index.php*'
    process_path:
    - '*/B374K*'
    - '*B374K*index.php*'
    service_path:
    - '*/B374K*'
    - '*B374K*index.php*'
    registry_path:
    - '*/B374K*'
    - '*B374K*index.php*'
    registry_value_data:
    - '*/B374K*'
    - '*B374K*index.php*'
    registry_value_name:
    - '*/B374K*'
    - '*B374K*index.php*'
    ContextInfo:
    - '*/B374K*'
    - '*B374K*index.php*'
    Payload:
    - '*/B374K*'
    - '*B374K*index.php*'
    ScriptBlockText:
    - '*/B374K*'
    - '*B374K*index.php*'
    ServerName:
    - '*/B374K*'
    - '*B374K*index.php*'
    TransportName:
    - '*/B374K*'
    - '*B374K*index.php*'
    NewProcessName:
    - '*/B374K*'
    - '*B374K*index.php*'
    ParentProcessName:
    - '*/B374K*'
    - '*B374K*index.php*'
    Application:
    - '*/B374K*'
    - '*B374K*index.php*'
    Product Name:
    - '*/B374K*'
    - '*B374K*index.php*'
    Threat Name:
    - '*/B374K*'
    - '*B374K*index.php*'
    Process Name:
    - '*/B374K*'
    - '*B374K*index.php*'
    Path:
    - '*/B374K*'
    - '*B374K*index.php*'
    ImagePath:
    - '*/B374K*'
    - '*B374K*index.php*'
    ServiceName:
    - '*/B374K*'
    - '*B374K*index.php*'
    ProcessPath:
    - '*/B374K*'
    - '*B374K*index.php*'
    AppName:
    - '*/B374K*'
    - '*B374K*index.php*'
    AppPath:
    - '*/B374K*'
    - '*B374K*index.php*'
    ModulePath:
    - '*/B374K*'
    - '*B374K*index.php*'
    registry.data.strings:
    - '*/B374K*'
    - '*B374K*index.php*'
    registry.path:
    - '*/B374K*'
    - '*B374K*index.php*'
    process.executable:
    - '*/B374K*'
    - '*B374K*index.php*'
    process.name:
    - '*/B374K*'
    - '*B374K*index.php*'
    pe.original_file_name:
    - '*/B374K*'
    - '*B374K*index.php*'
    file.fork_name:
    - '*/B374K*'
    - '*B374K*index.php*'
    file.name:
    - '*/B374K*'
    - '*B374K*index.php*'
    file.path:
    - '*/B374K*'
    - '*B374K*index.php*'
    file.target_path:
    - '*/B374K*'
    - '*B374K*index.php*'
    email.attachments.file.name:
    - '*/B374K*'
    - '*B374K*index.php*'
    dll.path:
    - '*/B374K*'
    - '*B374K*index.php*'
    object:
    - '*/B374K*'
    - '*B374K*index.php*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
