title: Simple keyword detection rule for curl
id: b007d777-c466-4724-96eb-99b237b76616
status: experimental
description: Detects interesting keywords based on curl tool
references:
- https://thedfirreport.com/2024/04/29/from-icedid-to-dagon-locker-ransomware-in-29-days/
- https://x.com/CraigHRowland/status/1782938242108837896
author: '@mthcht'
date: 2023/07/30
modified: 2024/11/02
tags:
- attack.T1059.003
- attack.T1105
- attack.T1566
- attack.TA0002
- attack.TA0005
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - CommandLine:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - Details:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - registry.value:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - process.args:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - process.command_line:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - process.env_vars:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - process.io.text:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - process.title:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - pe.company:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - pe.description:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - pe.product:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - os.full:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - host.hostname:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - event.original:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - email.subject:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - device.model.name:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - container.image.name:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  - container.name:
    - '*curl http://*.png -k|dd skip=2446 bs=1|sh*'
    - '*curl https://*.png -k|dd skip=2446 bs=1|sh*'
    - '*cmd.exe* /c echo curl https://* --output "%temp%* --ssl no-revoke --insecure
      --location > "%temp%*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
