title: Simple keyword detection rule for psexec
id: bf4d81e9-bca1-49ef-9219-dc6fcfd3833f
status: experimental
description:
- '''Adversaries may place the PsExec executable in the temp directory and execute
  it from there as part of their offensive activities. By doing so. they can leverage
  PsExec to execute commands or launch processes on remote systems. enabling lateral
  movement. privilege escalation. or the execution of malicious payloads.'''
- '''PsExec is a legitimate Microsoft tool for remote administration. However. attackers
  can misuse it to execute malicious commands or software on other network machines.
  install persistent threats. and evade some security systems. '''
references:
- https://learn.microsoft.com/fr-fr/sysinternals/downloads/psexec
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/03
tags:
- attack.T1047
- attack.T1105
- attack.T1204
- attack.TA0003
- attack.TA0008
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    OriginalFileName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    CurrentDirectory:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ParentImage:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ParentCommandLine:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    TargetFilename:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Signature:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    signature:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ImageLoaded:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Company:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Description:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    description:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    CommandLine:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    SourceImage:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    TargetImage:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    CallTrace:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    TargetObject:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Details:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    PipeName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Consumer:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Destination:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Query:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    NewName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    StartAddress:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    StartModule:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    StartFunction:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    SourceHostname:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Device:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    file_name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    file_path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    process:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    original_file_name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    parent_process:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    process_path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    service_path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    registry_path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    registry_value_data:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    registry_value_name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ContextInfo:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Payload:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ScriptBlockText:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ServerName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    TransportName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    NewProcessName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ParentProcessName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Application:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Product Name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Threat Name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Process Name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    Path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ImagePath:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ServiceName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ProcessPath:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    AppName:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    AppPath:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    ModulePath:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    registry.data.strings:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    registry.path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    registry.value:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    process.args:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    process.command_line:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    process.env_vars:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    process.io.text:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    process.executable:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    process.name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    process.title:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    pe.company:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    pe.description:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    pe.original_file_name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    pe.product:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    os.full:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    host.hostname:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    file.fork_name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    file.name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    file.path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    file.target_path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    email.attachments.file.name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    email.subject:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    dll.path:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    device.model.name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    container.image.name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    container.name:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    - '* -accepteula -nobanner -d cmd.exe /c *'
    object:
    - '*PsExec64*'
    - '*PSEXECSVC*'
    event.original:
    - '* -accepteula -nobanner -d cmd.exe /c *'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- event.original
