title: Simple keyword detection rule for pdbedit
id: 305e68bc-ba24-4a0a-92f9-f54e2b4bbc83
status: experimental
description: Detects interesting keywords based on pdbedit tool
references:
- https://github.com/RoseSecurity/Red-Teaming-TTPs/blob/main/Linux.md
author: '@mthcht'
date: 2023/07/30
modified: 2024/01/21
tags:
- attack.T1003.003
- attack.T1087.001
- attack.TA0006
- attack.TA0007
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - CommandLine:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - Details:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - registry.value:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - process.args:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - process.command_line:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - process.env_vars:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - process.io.text:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - process.title:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - pe.company:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - pe.description:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - pe.product:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - os.full:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - host.hostname:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - event.original:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - email.subject:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - device.model.name:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - container.image.name:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  - container.name:
    - '*pdbedit -L -v*'
    - '*pdbedit -L -w*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
