title: Simple keyword detection rule for InvisibilityCloak
id: f7a8d645-6b80-4054-886b-a2b25fd04dc6
status: experimental
description:
- '''Proof-of-concept obfuscation toolkit for C# post-exploitation tools'''
references:
- https://github.com/h4wkst3r/InvisibilityCloak
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/30
tags:
- attack.T1027
- attack.T1059.003
- attack.T1107
- attack.T1140
- attack.TA0004
- attack.TA0005
- attack.TA0009
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*InvisibilityCloak.py*'
    OriginalFileName:
    - '*InvisibilityCloak.py*'
    CurrentDirectory:
    - '*InvisibilityCloak.py*'
    ParentImage:
    - '*InvisibilityCloak.py*'
    ParentCommandLine:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    TargetFilename:
    - '*InvisibilityCloak.py*'
    Signature:
    - '*InvisibilityCloak.py*'
    signature:
    - '*InvisibilityCloak.py*'
    ImageLoaded:
    - '*InvisibilityCloak.py*'
    Company:
    - '*InvisibilityCloak.py*'
    Description:
    - '*InvisibilityCloak.py*'
    description:
    - '*InvisibilityCloak.py*'
    CommandLine:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    SourceImage:
    - '*InvisibilityCloak.py*'
    TargetImage:
    - '*InvisibilityCloak.py*'
    CallTrace:
    - '*InvisibilityCloak.py*'
    TargetObject:
    - '*InvisibilityCloak.py*'
    Details:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    PipeName:
    - '*InvisibilityCloak.py*'
    Consumer:
    - '*InvisibilityCloak.py*'
    Destination:
    - '*InvisibilityCloak.py*'
    Name:
    - '*InvisibilityCloak.py*'
    Query:
    - '*InvisibilityCloak.py*'
    NewName:
    - '*InvisibilityCloak.py*'
    StartAddress:
    - '*InvisibilityCloak.py*'
    StartModule:
    - '*InvisibilityCloak.py*'
    StartFunction:
    - '*InvisibilityCloak.py*'
    SourceHostname:
    - '*InvisibilityCloak.py*'
    Device:
    - '*InvisibilityCloak.py*'
    file_name:
    - '*InvisibilityCloak.py*'
    file_path:
    - '*InvisibilityCloak.py*'
    process:
    - '*InvisibilityCloak.py*'
    original_file_name:
    - '*InvisibilityCloak.py*'
    parent_process:
    - '*InvisibilityCloak.py*'
    process_path:
    - '*InvisibilityCloak.py*'
    service_path:
    - '*InvisibilityCloak.py*'
    registry_path:
    - '*InvisibilityCloak.py*'
    registry_value_data:
    - '*InvisibilityCloak.py*'
    registry_value_name:
    - '*InvisibilityCloak.py*'
    ContextInfo:
    - '*InvisibilityCloak.py*'
    Payload:
    - '*InvisibilityCloak.py*'
    ScriptBlockText:
    - '*InvisibilityCloak.py*'
    ServerName:
    - '*InvisibilityCloak.py*'
    TransportName:
    - '*InvisibilityCloak.py*'
    NewProcessName:
    - '*InvisibilityCloak.py*'
    ParentProcessName:
    - '*InvisibilityCloak.py*'
    Application:
    - '*InvisibilityCloak.py*'
    Product Name:
    - '*InvisibilityCloak.py*'
    Threat Name:
    - '*InvisibilityCloak.py*'
    Process Name:
    - '*InvisibilityCloak.py*'
    Path:
    - '*InvisibilityCloak.py*'
    ImagePath:
    - '*InvisibilityCloak.py*'
    ServiceName:
    - '*InvisibilityCloak.py*'
    ProcessPath:
    - '*InvisibilityCloak.py*'
    AppName:
    - '*InvisibilityCloak.py*'
    AppPath:
    - '*InvisibilityCloak.py*'
    ModulePath:
    - '*InvisibilityCloak.py*'
    registry.data.strings:
    - '*InvisibilityCloak.py*'
    registry.path:
    - '*InvisibilityCloak.py*'
    registry.value:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    process.args:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    process.command_line:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    process.env_vars:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    process.io.text:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    process.executable:
    - '*InvisibilityCloak.py*'
    process.name:
    - '*InvisibilityCloak.py*'
    process.title:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    pe.company:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    pe.description:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    pe.original_file_name:
    - '*InvisibilityCloak.py*'
    pe.product:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    os.full:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    host.hostname:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    file.fork_name:
    - '*InvisibilityCloak.py*'
    file.name:
    - '*InvisibilityCloak.py*'
    file.path:
    - '*InvisibilityCloak.py*'
    file.target_path:
    - '*InvisibilityCloak.py*'
    email.attachments.file.name:
    - '*InvisibilityCloak.py*'
    email.subject:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    dll.path:
    - '*InvisibilityCloak.py*'
    device.model.name:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    container.image.name:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    container.name:
    - '*InvisibilityCloak.py*'
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
    object:
    - '*InvisibilityCloak.py*'
    url:
    - '*InvisibilityCloak.py*'
    dest_url:
    - '*InvisibilityCloak.py*'
    uri:
    - '*InvisibilityCloak.py*'
    uri_query:
    - '*InvisibilityCloak.py*'
    query:
    - '*InvisibilityCloak.py*'
    url_domain:
    - '*InvisibilityCloak.py*'
    uri_path:
    - '*InvisibilityCloak.py*'
    domain:
    - '*InvisibilityCloak.py*'
    QueryName:
    - '*InvisibilityCloak.py*'
    QueryResults:
    - '*InvisibilityCloak.py*'
    DestinationHostname:
    - '*InvisibilityCloak.py*'
    DestinationIp:
    - '*InvisibilityCloak.py*'
    http_referrer:
    - '*InvisibilityCloak.py*'
    http_referrer_domain:
    - '*InvisibilityCloak.py*'
    http_user_agent:
    - '*InvisibilityCloak.py*'
    dest_nt_host:
    - '*InvisibilityCloak.py*'
    sender:
    - '*InvisibilityCloak.py*'
    recipient:
    - '*InvisibilityCloak.py*'
    orig_recipient:
    - '*InvisibilityCloak.py*'
    subject:
    - '*InvisibilityCloak.py*'
    url.domain:
    - '*InvisibilityCloak.py*'
    url.full:
    - '*InvisibilityCloak.py*'
    url.original:
    - '*InvisibilityCloak.py*'
    url.query:
    - '*InvisibilityCloak.py*'
    user_agent.original:
    - '*InvisibilityCloak.py*'
    network.application:
    - '*InvisibilityCloak.py*'
    http.request.body.content:
    - '*InvisibilityCloak.py*'
    http.request.referrer:
    - '*InvisibilityCloak.py*'
    email.from.address:
    - '*InvisibilityCloak.py*'
    dns.question.name:
    - '*InvisibilityCloak.py*'
    destination.domain:
    - '*InvisibilityCloak.py*'
    event.original:
    - '* -n *TotallyLegitTool*'
    - '* -d * -n * -m reverse*='
    - '* -d * -n * -m rot13*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
- event.original
