title: Simple keyword detection rule for attrib
id: bbfc3d8d-969a-43cf-957f-49891b34b39a
status: experimental
description:
- '''command aiming to hide a file.  It can be performed with attrib.exe on a WINDOWS
  machine with command option +h '''
- '''NTLM Leak via Desktop.ini'''
references:
- https://github.com/RoseSecurity/Red-Teaming-TTPs/blob/main/Anti-Forensics.md
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/19
tags:
- attack.T1081.001
- attack.T1555.003
- attack.T1562.001
- attack.TA0002
- attack.TA0006
- attack.TA0007
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    CommandLine:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    Details:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    registry.value:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    process.args:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    process.command_line:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    process.env_vars:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    process.io.text:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    process.title:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    pe.company:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    pe.description:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    pe.product:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    os.full:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    host.hostname:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    event.original:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    email.subject:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    device.model.name:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    container.image.name:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    container.name:
    - '*echo IconResource=\\*\* >> desktop.ini*'
    - '*attrib +s +h desktop.ini*'
    - '*echo [.ShellClassInfo] > desktop.ini*'
    - '*\attrib.exe* +h*'
    Image:
    - '*\attrib.exe* +h*'
    OriginalFileName:
    - '*\attrib.exe* +h*'
    CurrentDirectory:
    - '*\attrib.exe* +h*'
    ParentImage:
    - '*\attrib.exe* +h*'
    TargetFilename:
    - '*\attrib.exe* +h*'
    Signature:
    - '*\attrib.exe* +h*'
    signature:
    - '*\attrib.exe* +h*'
    ImageLoaded:
    - '*\attrib.exe* +h*'
    Company:
    - '*\attrib.exe* +h*'
    Description:
    - '*\attrib.exe* +h*'
    description:
    - '*\attrib.exe* +h*'
    SourceImage:
    - '*\attrib.exe* +h*'
    TargetImage:
    - '*\attrib.exe* +h*'
    CallTrace:
    - '*\attrib.exe* +h*'
    TargetObject:
    - '*\attrib.exe* +h*'
    PipeName:
    - '*\attrib.exe* +h*'
    Consumer:
    - '*\attrib.exe* +h*'
    Destination:
    - '*\attrib.exe* +h*'
    Name:
    - '*\attrib.exe* +h*'
    Query:
    - '*\attrib.exe* +h*'
    NewName:
    - '*\attrib.exe* +h*'
    StartAddress:
    - '*\attrib.exe* +h*'
    StartModule:
    - '*\attrib.exe* +h*'
    StartFunction:
    - '*\attrib.exe* +h*'
    SourceHostname:
    - '*\attrib.exe* +h*'
    Device:
    - '*\attrib.exe* +h*'
    file_name:
    - '*\attrib.exe* +h*'
    file_path:
    - '*\attrib.exe* +h*'
    process:
    - '*\attrib.exe* +h*'
    original_file_name:
    - '*\attrib.exe* +h*'
    parent_process:
    - '*\attrib.exe* +h*'
    process_path:
    - '*\attrib.exe* +h*'
    service_path:
    - '*\attrib.exe* +h*'
    registry_path:
    - '*\attrib.exe* +h*'
    registry_value_data:
    - '*\attrib.exe* +h*'
    registry_value_name:
    - '*\attrib.exe* +h*'
    ContextInfo:
    - '*\attrib.exe* +h*'
    Payload:
    - '*\attrib.exe* +h*'
    ScriptBlockText:
    - '*\attrib.exe* +h*'
    ServerName:
    - '*\attrib.exe* +h*'
    TransportName:
    - '*\attrib.exe* +h*'
    NewProcessName:
    - '*\attrib.exe* +h*'
    ParentProcessName:
    - '*\attrib.exe* +h*'
    Application:
    - '*\attrib.exe* +h*'
    Product Name:
    - '*\attrib.exe* +h*'
    Threat Name:
    - '*\attrib.exe* +h*'
    Process Name:
    - '*\attrib.exe* +h*'
    Path:
    - '*\attrib.exe* +h*'
    ImagePath:
    - '*\attrib.exe* +h*'
    ServiceName:
    - '*\attrib.exe* +h*'
    ProcessPath:
    - '*\attrib.exe* +h*'
    AppName:
    - '*\attrib.exe* +h*'
    AppPath:
    - '*\attrib.exe* +h*'
    ModulePath:
    - '*\attrib.exe* +h*'
    registry.data.strings:
    - '*\attrib.exe* +h*'
    registry.path:
    - '*\attrib.exe* +h*'
    process.executable:
    - '*\attrib.exe* +h*'
    process.name:
    - '*\attrib.exe* +h*'
    pe.original_file_name:
    - '*\attrib.exe* +h*'
    file.fork_name:
    - '*\attrib.exe* +h*'
    file.name:
    - '*\attrib.exe* +h*'
    file.path:
    - '*\attrib.exe* +h*'
    file.target_path:
    - '*\attrib.exe* +h*'
    email.attachments.file.name:
    - '*\attrib.exe* +h*'
    dll.path:
    - '*\attrib.exe* +h*'
    object:
    - '*\attrib.exe* +h*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
