title: Simple keyword detection rule for snmpcheck
id: 1596c3ba-43cc-4afe-b7a4-f743db91d271
status: experimental
description:
- '''automate the process of gathering information of any devices with SNMP protocol
  support. like snmpwalk - snmpcheck allows you to enumerate the SNMP devices and
  places the output in a very human readable friendly format. It could be useful for
  penetration testing or systems monitoring'''
references:
- http://www.nothink.org/codes/snmpcheck/index.php
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/28
tags:
- attack.T1018
- attack.T1046
- attack.TA0005
- attack.TA0007
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*install snmpcheck*'
    OriginalFileName:
    - '*install snmpcheck*'
    CurrentDirectory:
    - '*install snmpcheck*'
    ParentImage:
    - '*install snmpcheck*'
    ParentCommandLine:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    TargetFilename:
    - '*install snmpcheck*'
    Signature:
    - '*install snmpcheck*'
    signature:
    - '*install snmpcheck*'
    ImageLoaded:
    - '*install snmpcheck*'
    Company:
    - '*install snmpcheck*'
    Description:
    - '*install snmpcheck*'
    description:
    - '*install snmpcheck*'
    CommandLine:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    SourceImage:
    - '*install snmpcheck*'
    TargetImage:
    - '*install snmpcheck*'
    CallTrace:
    - '*install snmpcheck*'
    TargetObject:
    - '*install snmpcheck*'
    Details:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    PipeName:
    - '*install snmpcheck*'
    Consumer:
    - '*install snmpcheck*'
    Destination:
    - '*install snmpcheck*'
    Name:
    - '*install snmpcheck*'
    Query:
    - '*install snmpcheck*'
    NewName:
    - '*install snmpcheck*'
    StartAddress:
    - '*install snmpcheck*'
    StartModule:
    - '*install snmpcheck*'
    StartFunction:
    - '*install snmpcheck*'
    SourceHostname:
    - '*install snmpcheck*'
    Device:
    - '*install snmpcheck*'
    file_name:
    - '*install snmpcheck*'
    file_path:
    - '*install snmpcheck*'
    process:
    - '*install snmpcheck*'
    original_file_name:
    - '*install snmpcheck*'
    parent_process:
    - '*install snmpcheck*'
    process_path:
    - '*install snmpcheck*'
    service_path:
    - '*install snmpcheck*'
    registry_path:
    - '*install snmpcheck*'
    registry_value_data:
    - '*install snmpcheck*'
    registry_value_name:
    - '*install snmpcheck*'
    ContextInfo:
    - '*install snmpcheck*'
    Payload:
    - '*install snmpcheck*'
    ScriptBlockText:
    - '*install snmpcheck*'
    ServerName:
    - '*install snmpcheck*'
    TransportName:
    - '*install snmpcheck*'
    NewProcessName:
    - '*install snmpcheck*'
    ParentProcessName:
    - '*install snmpcheck*'
    Application:
    - '*install snmpcheck*'
    Product Name:
    - '*install snmpcheck*'
    Threat Name:
    - '*install snmpcheck*'
    Process Name:
    - '*install snmpcheck*'
    Path:
    - '*install snmpcheck*'
    ImagePath:
    - '*install snmpcheck*'
    ServiceName:
    - '*install snmpcheck*'
    ProcessPath:
    - '*install snmpcheck*'
    AppName:
    - '*install snmpcheck*'
    AppPath:
    - '*install snmpcheck*'
    ModulePath:
    - '*install snmpcheck*'
    registry.data.strings:
    - '*install snmpcheck*'
    registry.path:
    - '*install snmpcheck*'
    registry.value:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    process.args:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    process.command_line:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    process.env_vars:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    process.io.text:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    process.executable:
    - '*install snmpcheck*'
    process.name:
    - '*install snmpcheck*'
    process.title:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    pe.company:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    pe.description:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    pe.original_file_name:
    - '*install snmpcheck*'
    pe.product:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    os.full:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    host.hostname:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    file.fork_name:
    - '*install snmpcheck*'
    file.name:
    - '*install snmpcheck*'
    file.path:
    - '*install snmpcheck*'
    file.target_path:
    - '*install snmpcheck*'
    email.attachments.file.name:
    - '*install snmpcheck*'
    email.subject:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    dll.path:
    - '*install snmpcheck*'
    device.model.name:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    container.image.name:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    container.name:
    - '*install snmpcheck*'
    - '*snmp-check * -c public*'
    object:
    - '*install snmpcheck*'
    event.original:
    - '*snmp-check * -c public*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- event.original
