title: Simple keyword detection rule for rmmod
id: c2fd6e25-bf2b-4aad-b2a3-2c0a56ca4158
status: experimental
description:
- '''Kernel modules are pieces of code that can be loaded and unloaded into the kernel
  upon demand. They extend the functionality of the kernel without the need to reboot
  the system. This rule identifies attempts to remove a kernel module.'''
references:
- https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_kernel_module_removal.toml
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/14
tags:
- attack.T1070.006
- attack.T1547.006
- attack.TA0003
- attack.TA0005
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    CommandLine:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    Details:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    registry.value:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    process.args:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    process.command_line:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    process.env_vars:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    process.io.text:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    process.title:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    pe.company:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    pe.description:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    pe.product:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    os.full:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    host.hostname:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    event.original:
    - '*rmmod --remove*'
    - '*sudo rmmod -r*'
    email.subject:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    device.model.name:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    container.image.name:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    container.name:
    - '*rmmod --remove*'
    - '*rmmod -r*'
    - '*sudo rmmod -r*'
    Image:
    - '*rmmod -r*'
    OriginalFileName:
    - '*rmmod -r*'
    CurrentDirectory:
    - '*rmmod -r*'
    ParentImage:
    - '*rmmod -r*'
    TargetFilename:
    - '*rmmod -r*'
    Signature:
    - '*rmmod -r*'
    signature:
    - '*rmmod -r*'
    ImageLoaded:
    - '*rmmod -r*'
    Company:
    - '*rmmod -r*'
    Description:
    - '*rmmod -r*'
    description:
    - '*rmmod -r*'
    SourceImage:
    - '*rmmod -r*'
    TargetImage:
    - '*rmmod -r*'
    CallTrace:
    - '*rmmod -r*'
    TargetObject:
    - '*rmmod -r*'
    PipeName:
    - '*rmmod -r*'
    Consumer:
    - '*rmmod -r*'
    Destination:
    - '*rmmod -r*'
    Name:
    - '*rmmod -r*'
    Query:
    - '*rmmod -r*'
    NewName:
    - '*rmmod -r*'
    StartAddress:
    - '*rmmod -r*'
    StartModule:
    - '*rmmod -r*'
    StartFunction:
    - '*rmmod -r*'
    SourceHostname:
    - '*rmmod -r*'
    Device:
    - '*rmmod -r*'
    file_name:
    - '*rmmod -r*'
    file_path:
    - '*rmmod -r*'
    process:
    - '*rmmod -r*'
    original_file_name:
    - '*rmmod -r*'
    parent_process:
    - '*rmmod -r*'
    process_path:
    - '*rmmod -r*'
    service_path:
    - '*rmmod -r*'
    registry_path:
    - '*rmmod -r*'
    registry_value_data:
    - '*rmmod -r*'
    registry_value_name:
    - '*rmmod -r*'
    ContextInfo:
    - '*rmmod -r*'
    Payload:
    - '*rmmod -r*'
    ScriptBlockText:
    - '*rmmod -r*'
    ServerName:
    - '*rmmod -r*'
    TransportName:
    - '*rmmod -r*'
    NewProcessName:
    - '*rmmod -r*'
    ParentProcessName:
    - '*rmmod -r*'
    Application:
    - '*rmmod -r*'
    Product Name:
    - '*rmmod -r*'
    Threat Name:
    - '*rmmod -r*'
    Process Name:
    - '*rmmod -r*'
    Path:
    - '*rmmod -r*'
    ImagePath:
    - '*rmmod -r*'
    ServiceName:
    - '*rmmod -r*'
    ProcessPath:
    - '*rmmod -r*'
    AppName:
    - '*rmmod -r*'
    AppPath:
    - '*rmmod -r*'
    ModulePath:
    - '*rmmod -r*'
    registry.data.strings:
    - '*rmmod -r*'
    registry.path:
    - '*rmmod -r*'
    process.executable:
    - '*rmmod -r*'
    process.name:
    - '*rmmod -r*'
    pe.original_file_name:
    - '*rmmod -r*'
    file.fork_name:
    - '*rmmod -r*'
    file.name:
    - '*rmmod -r*'
    file.path:
    - '*rmmod -r*'
    file.target_path:
    - '*rmmod -r*'
    email.attachments.file.name:
    - '*rmmod -r*'
    dll.path:
    - '*rmmod -r*'
    object:
    - '*rmmod -r*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
