title: Simple keyword detection rule for tasklist
id: e626b31b-b41b-4788-9ad2-339f5cf1d589
status: experimental
description: Detects interesting keywords based on tasklist tool
references:
- https://github.com/ice-wzl/wmiexec2
author: '@mthcht'
date: 2023/07/30
modified: 2025/01/29
tags:
- attack.T1018
- attack.T1027
- attack.T1047
- attack.T1057
- attack.T1059
- attack.T1555
- attack.TA0002
- attack.TA0005
- attack.TA0006
- attack.TA0007
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - CommandLine:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - Details:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - registry.value:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - process.args:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - process.command_line:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - process.env_vars:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - process.io.text:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - process.title:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - pe.company:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - pe.description:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - pe.product:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - os.full:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - host.hostname:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - event.original:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - email.subject:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - device.model.name:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - container.image.name:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  - container.name:
    - '*tasklist | findstr lsass*'
    - '*tasklist /svc | findstr /i "vmtoolsd.exe"*'
    - '*tasklist /fi *Imagename eq lsass.exe*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
