title: Simple keyword detection rule for chattr
id: 0bd9c122-c2e8-40d1-9f93-33717a097128
status: experimental
description: Detects interesting keywords based on chattr tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2024/05/16
tags:
- attack.T1070.006
- attack.T1222.001
- attack.T1222.002
- attack.TA0005
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - CommandLine:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - Details:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - registry.value:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - process.args:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - process.command_line:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - process.env_vars:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - process.io.text:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - process.title:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - pe.company:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - pe.description:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - pe.product:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - os.full:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - host.hostname:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - event.original:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - email.subject:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - device.model.name:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - container.image.name:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  - container.name:
    - '*chattr +i $HISTFILE*'
    - '*chattr -ia */etc/shadow*'
    - '*chattr -ia */etc/sudoers*'
    - '*chattr +i *.bash_history*'
    - '*chattr -ia */etc/passwd*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
