title: Simple keyword detection rule for netsh
id: 2b2bdd52-8a23-40a3-8dc8-88458eac9f41
status: experimental
description:
- '''Disable Windows Firewall'''
- '''The actor has used the following commands to enable port forwarding [T1090] on
  the host'''
references:
- https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/10
tags:
- attack.T1055.001
- attack.T1090.003
- attack.T1123
- attack.T1562.004
- attack.TA0002
- attack.TA0005
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    CommandLine:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    Details:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    registry.value:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    process.args:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    process.command_line:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    process.env_vars:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    process.io.text:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    process.title:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    pe.company:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    pe.description:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    pe.product:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    os.full:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    host.hostname:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    event.original:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    email.subject:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    device.model.name:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    container.image.name:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
    container.name:
    - '*netsh interface portproxy add v4tov4*listenaddress=* listenport=*connectaddress=*connectport*'
    - '*NetSh Advfirewall set allprofiles state off*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
