title: Simple keyword detection rule for MpCmdRun
id: 0f643374-534d-4f14-ac22-7a01fc09b3d2
status: experimental
description:
- '''Removing all the signature from windows defender - used by a metasploit module'''
- '''Wipe currently stored definitions'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/11
tags:
- attack.T1070.004
- attack.T1562.001
- attack.T1562.004
- attack.TA0005
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- critical
detection:
  selection:
    ParentCommandLine:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    CommandLine:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    Details:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    registry.value:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    process.args:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    process.command_line:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    process.env_vars:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    process.io.text:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    process.title:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    pe.company:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    pe.description:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    pe.product:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    os.full:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    host.hostname:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    event.original:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    email.subject:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    device.model.name:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    container.image.name:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
    container.name:
    - '*MpCmdRun.exe* -RemoveDefinitions -All*'
    - '*MpCmdRun.exe -RemoveDefinitions -All*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
