title: Simple keyword detection rule for Invoke-Phant0m
id: deeb51c5-4eee-4c66-9841-bfeda395d11b
status: experimental
description:
- '''This script walks thread stacks of Event Log Service process (spesific svchost.exe)
  and identify Event Log Threads to kill Event Log Service Threads. So the system
  will not be able to collect logs and at the same time the Event Log Service will
  appear to be running. I have made this script for two reasons. First. This script
  will help to Red Teams and Penetration Testers. Second. I want to learn Powershell
  and Low-Level things on Powershell for cyber security field'''
references:
- https://github.com/hlldz/Invoke-Phant0m
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/29
tags:
- attack.T1059
- attack.T1086
- attack.T1216
- attack.TA0007
- attack.TA0008
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*Invoke-Phant0m*'
    OriginalFileName:
    - '*Invoke-Phant0m*'
    CurrentDirectory:
    - '*Invoke-Phant0m*'
    ParentImage:
    - '*Invoke-Phant0m*'
    ParentCommandLine:
    - '*Invoke-Phant0m*'
    TargetFilename:
    - '*Invoke-Phant0m*'
    Signature:
    - '*Invoke-Phant0m*'
    signature:
    - '*Invoke-Phant0m*'
    ImageLoaded:
    - '*Invoke-Phant0m*'
    Company:
    - '*Invoke-Phant0m*'
    Description:
    - '*Invoke-Phant0m*'
    description:
    - '*Invoke-Phant0m*'
    CommandLine:
    - '*Invoke-Phant0m*'
    SourceImage:
    - '*Invoke-Phant0m*'
    TargetImage:
    - '*Invoke-Phant0m*'
    CallTrace:
    - '*Invoke-Phant0m*'
    TargetObject:
    - '*Invoke-Phant0m*'
    Details:
    - '*Invoke-Phant0m*'
    PipeName:
    - '*Invoke-Phant0m*'
    Consumer:
    - '*Invoke-Phant0m*'
    Destination:
    - '*Invoke-Phant0m*'
    Name:
    - '*Invoke-Phant0m*'
    Query:
    - '*Invoke-Phant0m*'
    NewName:
    - '*Invoke-Phant0m*'
    StartAddress:
    - '*Invoke-Phant0m*'
    StartModule:
    - '*Invoke-Phant0m*'
    StartFunction:
    - '*Invoke-Phant0m*'
    SourceHostname:
    - '*Invoke-Phant0m*'
    Device:
    - '*Invoke-Phant0m*'
    file_name:
    - '*Invoke-Phant0m*'
    file_path:
    - '*Invoke-Phant0m*'
    process:
    - '*Invoke-Phant0m*'
    original_file_name:
    - '*Invoke-Phant0m*'
    parent_process:
    - '*Invoke-Phant0m*'
    process_path:
    - '*Invoke-Phant0m*'
    service_path:
    - '*Invoke-Phant0m*'
    registry_path:
    - '*Invoke-Phant0m*'
    registry_value_data:
    - '*Invoke-Phant0m*'
    registry_value_name:
    - '*Invoke-Phant0m*'
    ContextInfo:
    - '*Invoke-Phant0m*'
    Payload:
    - '*Invoke-Phant0m*'
    ScriptBlockText:
    - '*Invoke-Phant0m*'
    ServerName:
    - '*Invoke-Phant0m*'
    TransportName:
    - '*Invoke-Phant0m*'
    NewProcessName:
    - '*Invoke-Phant0m*'
    ParentProcessName:
    - '*Invoke-Phant0m*'
    Application:
    - '*Invoke-Phant0m*'
    Product Name:
    - '*Invoke-Phant0m*'
    Threat Name:
    - '*Invoke-Phant0m*'
    Process Name:
    - '*Invoke-Phant0m*'
    Path:
    - '*Invoke-Phant0m*'
    ImagePath:
    - '*Invoke-Phant0m*'
    ServiceName:
    - '*Invoke-Phant0m*'
    ProcessPath:
    - '*Invoke-Phant0m*'
    AppName:
    - '*Invoke-Phant0m*'
    AppPath:
    - '*Invoke-Phant0m*'
    ModulePath:
    - '*Invoke-Phant0m*'
    registry.data.strings:
    - '*Invoke-Phant0m*'
    registry.path:
    - '*Invoke-Phant0m*'
    registry.value:
    - '*Invoke-Phant0m*'
    process.args:
    - '*Invoke-Phant0m*'
    process.command_line:
    - '*Invoke-Phant0m*'
    process.env_vars:
    - '*Invoke-Phant0m*'
    process.io.text:
    - '*Invoke-Phant0m*'
    process.executable:
    - '*Invoke-Phant0m*'
    process.name:
    - '*Invoke-Phant0m*'
    process.title:
    - '*Invoke-Phant0m*'
    pe.company:
    - '*Invoke-Phant0m*'
    pe.description:
    - '*Invoke-Phant0m*'
    pe.original_file_name:
    - '*Invoke-Phant0m*'
    pe.product:
    - '*Invoke-Phant0m*'
    os.full:
    - '*Invoke-Phant0m*'
    host.hostname:
    - '*Invoke-Phant0m*'
    file.fork_name:
    - '*Invoke-Phant0m*'
    file.name:
    - '*Invoke-Phant0m*'
    file.path:
    - '*Invoke-Phant0m*'
    file.target_path:
    - '*Invoke-Phant0m*'
    email.attachments.file.name:
    - '*Invoke-Phant0m*'
    email.subject:
    - '*Invoke-Phant0m*'
    dll.path:
    - '*Invoke-Phant0m*'
    device.model.name:
    - '*Invoke-Phant0m*'
    container.image.name:
    - '*Invoke-Phant0m*'
    container.name:
    - '*Invoke-Phant0m*'
    object:
    - '*Invoke-Phant0m*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
