title: Simple keyword detection rule for jackit
id: 231512b5-1020-4e02-8a38-2daf3ec18ac8
status: experimental
description:
- '''This is a partial implementation of Bastilles MouseJack exploit. See mousejack.com
  for more details. Full credit goes to Bastilles team for discovering this issue
  and writing the libraries to work with the CrazyRadio PA dongle. Also. thanks to
  Samy Kamkar for KeySweeper. to Thorsten Schroeder and Max Moser for their work on
  KeyKeriki and to Travis Goodspeed. We stand on the shoulders of giants.'''
- '''Wireless Mouse and Keyboard Vulnerability This is a partial implementation of
  Bastilles MouseJack exploit. See mousejack.com for more details. Full credit goes
  to Bastilles team for discovering this issue and writing the libraries to work with
  the CrazyRadio PA dongle. Also. thanks to Samy Kamkar for KeySweeper. to Thorsten
  Schroeder and Max Moser for their work on KeyKeriki and to Travis Goodspeed. We
  stand on the shoulders of giants'''
references:
- https://github.com/insecurityofthings/jackit
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/30
tags:
- attack.T1210
- attack.T1212
- attack.T1560
- attack.T1562
- attack.TA0002
- attack.TA0009
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    OriginalFileName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    CurrentDirectory:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ParentImage:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ParentCommandLine:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    TargetFilename:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Signature:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    signature:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ImageLoaded:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Company:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Description:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    description:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    CommandLine:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    SourceImage:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    TargetImage:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    CallTrace:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    TargetObject:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Details:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    PipeName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Consumer:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Destination:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Query:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    NewName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    StartAddress:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    StartModule:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    StartFunction:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    SourceHostname:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Device:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    file_name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    file_path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    original_file_name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    parent_process:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process_path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    service_path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    registry_path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    registry_value_data:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    registry_value_name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ContextInfo:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Payload:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ScriptBlockText:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ServerName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    TransportName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    NewProcessName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ParentProcessName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Application:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Product Name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Threat Name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Process Name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    Path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ImagePath:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ServiceName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ProcessPath:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    AppName:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    AppPath:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    ModulePath:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    registry.data.strings:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    registry.path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    registry.value:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process.args:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process.command_line:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process.env_vars:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process.io.text:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process.executable:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process.name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    process.title:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    pe.company:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    pe.description:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    pe.original_file_name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    pe.product:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    os.full:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    host.hostname:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    file.fork_name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    file.name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    file.path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    file.target_path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    email.attachments.file.name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    email.subject:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    dll.path:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    device.model.name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    container.image.name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    container.name:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
    object:
    - '*/jackit*'
    - '*insecurityofthings*jackit*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
