title: Simple keyword detection rule for slack
id: 30d8cb5d-d470-4370-a8d4-31e480314320
status: experimental
description: Detects interesting keywords based on slack tool
references:
- https://github.com/mthcht/Purpleteam/blob/main/Detection/Threat%20Hunting/generic/C2_abusing_API_services.md
author: '@mthcht'
date: 2023/07/30
modified: 2024/06/29
tags:
- attack.T1059.003
- attack.T1071.004
- attack.T1562.001
- attack.TA0002
- attack.TA0010
- attack.TA0011
logsource:
  category:
  - network
detection:
  selection:
  - url:
    - '*https://slack.com/api/channels.create*'
  - dest_url:
    - '*https://slack.com/api/channels.create*'
  - uri:
    - '*https://slack.com/api/channels.create*'
  - uri_query:
    - '*https://slack.com/api/channels.create*'
  - query:
    - '*https://slack.com/api/channels.create*'
  - url_domain:
    - '*https://slack.com/api/channels.create*'
  - uri_path:
    - '*https://slack.com/api/channels.create*'
  - domain:
    - '*https://slack.com/api/channels.create*'
  - QueryName:
    - '*https://slack.com/api/channels.create*'
  - QueryResults:
    - '*https://slack.com/api/channels.create*'
  - DestinationHostname:
    - '*https://slack.com/api/channels.create*'
  - DestinationIp:
    - '*https://slack.com/api/channels.create*'
  - http_referrer:
    - '*https://slack.com/api/channels.create*'
  - http_referrer_domain:
    - '*https://slack.com/api/channels.create*'
  - http_user_agent:
    - '*https://slack.com/api/channels.create*'
  - dest_nt_host:
    - '*https://slack.com/api/channels.create*'
  - sender:
    - '*https://slack.com/api/channels.create*'
  - recipient:
    - '*https://slack.com/api/channels.create*'
  - orig_recipient:
    - '*https://slack.com/api/channels.create*'
  - subject:
    - '*https://slack.com/api/channels.create*'
  - url.domain:
    - '*https://slack.com/api/channels.create*'
  - url.full:
    - '*https://slack.com/api/channels.create*'
  - url.original:
    - '*https://slack.com/api/channels.create*'
  - url.query:
    - '*https://slack.com/api/channels.create*'
  - user_agent.original:
    - '*https://slack.com/api/channels.create*'
  - network.application:
    - '*https://slack.com/api/channels.create*'
  - http.request.body.content:
    - '*https://slack.com/api/channels.create*'
  - http.request.referrer:
    - '*https://slack.com/api/channels.create*'
  - email.from.address:
    - '*https://slack.com/api/channels.create*'
  - dns.question.name:
    - '*https://slack.com/api/channels.create*'
  - destination.domain:
    - '*https://slack.com/api/channels.create*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
