title: Simple keyword detection rule for ncat
id: b4a58d07-3d52-4744-a8ee-ac1c63af4b29
status: experimental
description: Detects interesting keywords based on ncat tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2023/11/16
tags:
- attack.T1012
- attack.T1027
- attack.T1035
- attack.T1036
- attack.T1041
- attack.T1053.005
- attack.T1057
- attack.T1059.003
- attack.T1059.004
- attack.T1059.005
- attack.T1070.001
- attack.T1083
- attack.T1105
- attack.T1112
- attack.T1136
- attack.T1562.001
- attack.T1564.001
- attack.T1564.002
- attack.T1564.003
- attack.T1564.005
- attack.TA0002
- 'attack.TA0002 '
- attack.TA0003
- attack.TA0005
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0010
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - CommandLine:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - Details:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - registry.value:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - process.args:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - process.command_line:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - process.env_vars:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - process.io.text:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - process.title:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - pe.company:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - pe.description:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - pe.product:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - os.full:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - host.hostname:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - event.original:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - email.subject:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - device.model.name:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - container.image.name:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  - container.name:
    - '*ncat * -p 4444*'
    - '* ncat * -e /bin/bash*|crontab*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
