title: Simple keyword detection rule for sudoSnatch
id: f04a4b96-f95a-4ec4-bb11-e0cf15fa02f0
status: experimental
description:
- '''sudoSnatch payload grabs sudo password in plain text and imediately after target
  uses sudo command and sends it back to attacker remotely/locally.'''
references:
- https://github.com/hak5/omg-payloads/tree/master/payloads/library/credentials/SudoSnatch
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/03
tags:
- attack.T1056.001
- attack.T1071.001
- attack.T1552.001
- attack.TA0004
- attack.TA0006
- attack.TA0010
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- high
detection:
  selection:
    Image:
    - '*/credentials/SudoSnatch*'
    OriginalFileName:
    - '*/credentials/SudoSnatch*'
    CurrentDirectory:
    - '*/credentials/SudoSnatch*'
    ParentImage:
    - '*/credentials/SudoSnatch*'
    ParentCommandLine:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    TargetFilename:
    - '*/credentials/SudoSnatch*'
    Signature:
    - '*/credentials/SudoSnatch*'
    signature:
    - '*/credentials/SudoSnatch*'
    ImageLoaded:
    - '*/credentials/SudoSnatch*'
    Company:
    - '*/credentials/SudoSnatch*'
    Description:
    - '*/credentials/SudoSnatch*'
    description:
    - '*/credentials/SudoSnatch*'
    CommandLine:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    SourceImage:
    - '*/credentials/SudoSnatch*'
    TargetImage:
    - '*/credentials/SudoSnatch*'
    CallTrace:
    - '*/credentials/SudoSnatch*'
    TargetObject:
    - '*/credentials/SudoSnatch*'
    Details:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    PipeName:
    - '*/credentials/SudoSnatch*'
    Consumer:
    - '*/credentials/SudoSnatch*'
    Destination:
    - '*/credentials/SudoSnatch*'
    Name:
    - '*/credentials/SudoSnatch*'
    Query:
    - '*/credentials/SudoSnatch*'
    NewName:
    - '*/credentials/SudoSnatch*'
    StartAddress:
    - '*/credentials/SudoSnatch*'
    StartModule:
    - '*/credentials/SudoSnatch*'
    StartFunction:
    - '*/credentials/SudoSnatch*'
    SourceHostname:
    - '*/credentials/SudoSnatch*'
    Device:
    - '*/credentials/SudoSnatch*'
    file_name:
    - '*/credentials/SudoSnatch*'
    file_path:
    - '*/credentials/SudoSnatch*'
    process:
    - '*/credentials/SudoSnatch*'
    original_file_name:
    - '*/credentials/SudoSnatch*'
    parent_process:
    - '*/credentials/SudoSnatch*'
    process_path:
    - '*/credentials/SudoSnatch*'
    service_path:
    - '*/credentials/SudoSnatch*'
    registry_path:
    - '*/credentials/SudoSnatch*'
    registry_value_data:
    - '*/credentials/SudoSnatch*'
    registry_value_name:
    - '*/credentials/SudoSnatch*'
    ContextInfo:
    - '*/credentials/SudoSnatch*'
    Payload:
    - '*/credentials/SudoSnatch*'
    ScriptBlockText:
    - '*/credentials/SudoSnatch*'
    ServerName:
    - '*/credentials/SudoSnatch*'
    TransportName:
    - '*/credentials/SudoSnatch*'
    NewProcessName:
    - '*/credentials/SudoSnatch*'
    ParentProcessName:
    - '*/credentials/SudoSnatch*'
    Application:
    - '*/credentials/SudoSnatch*'
    Product Name:
    - '*/credentials/SudoSnatch*'
    Threat Name:
    - '*/credentials/SudoSnatch*'
    Process Name:
    - '*/credentials/SudoSnatch*'
    Path:
    - '*/credentials/SudoSnatch*'
    ImagePath:
    - '*/credentials/SudoSnatch*'
    ServiceName:
    - '*/credentials/SudoSnatch*'
    ProcessPath:
    - '*/credentials/SudoSnatch*'
    AppName:
    - '*/credentials/SudoSnatch*'
    AppPath:
    - '*/credentials/SudoSnatch*'
    ModulePath:
    - '*/credentials/SudoSnatch*'
    registry.data.strings:
    - '*/credentials/SudoSnatch*'
    registry.path:
    - '*/credentials/SudoSnatch*'
    registry.value:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    process.args:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    process.command_line:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    process.env_vars:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    process.io.text:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    process.executable:
    - '*/credentials/SudoSnatch*'
    process.name:
    - '*/credentials/SudoSnatch*'
    process.title:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    pe.company:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    pe.description:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    pe.original_file_name:
    - '*/credentials/SudoSnatch*'
    pe.product:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    os.full:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    host.hostname:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    file.fork_name:
    - '*/credentials/SudoSnatch*'
    file.name:
    - '*/credentials/SudoSnatch*'
    file.path:
    - '*/credentials/SudoSnatch*'
    file.target_path:
    - '*/credentials/SudoSnatch*'
    email.attachments.file.name:
    - '*/credentials/SudoSnatch*'
    email.subject:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    dll.path:
    - '*/credentials/SudoSnatch*'
    device.model.name:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    container.image.name:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    container.name:
    - '*/credentials/SudoSnatch*'
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
    object:
    - '*/credentials/SudoSnatch*'
    url:
    - '*/credentials/SudoSnatch*'
    dest_url:
    - '*/credentials/SudoSnatch*'
    uri:
    - '*/credentials/SudoSnatch*'
    uri_query:
    - '*/credentials/SudoSnatch*'
    query:
    - '*/credentials/SudoSnatch*'
    url_domain:
    - '*/credentials/SudoSnatch*'
    uri_path:
    - '*/credentials/SudoSnatch*'
    domain:
    - '*/credentials/SudoSnatch*'
    QueryName:
    - '*/credentials/SudoSnatch*'
    QueryResults:
    - '*/credentials/SudoSnatch*'
    DestinationHostname:
    - '*/credentials/SudoSnatch*'
    DestinationIp:
    - '*/credentials/SudoSnatch*'
    http_referrer:
    - '*/credentials/SudoSnatch*'
    http_referrer_domain:
    - '*/credentials/SudoSnatch*'
    http_user_agent:
    - '*/credentials/SudoSnatch*'
    dest_nt_host:
    - '*/credentials/SudoSnatch*'
    sender:
    - '*/credentials/SudoSnatch*'
    recipient:
    - '*/credentials/SudoSnatch*'
    orig_recipient:
    - '*/credentials/SudoSnatch*'
    subject:
    - '*/credentials/SudoSnatch*'
    url.domain:
    - '*/credentials/SudoSnatch*'
    url.full:
    - '*/credentials/SudoSnatch*'
    url.original:
    - '*/credentials/SudoSnatch*'
    url.query:
    - '*/credentials/SudoSnatch*'
    user_agent.original:
    - '*/credentials/SudoSnatch*'
    network.application:
    - '*/credentials/SudoSnatch*'
    http.request.body.content:
    - '*/credentials/SudoSnatch*'
    http.request.referrer:
    - '*/credentials/SudoSnatch*'
    email.from.address:
    - '*/credentials/SudoSnatch*'
    dns.question.name:
    - '*/credentials/SudoSnatch*'
    destination.domain:
    - '*/credentials/SudoSnatch*'
    event.original:
    - '*nIFS=* read -s pass\necho -e *User=*$(whoami)*Password=*$pass*> /var/tmp*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
- event.original
