title: Simple keyword detection rule for cytool
id: e4cb570b-3f2e-4eca-a2d0-4c7ea818f0f6
status: experimental
description: Detects interesting keywords based on cytool tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2023/11/19
tags:
- attack.T1055.001
- attack.T1547.001
- attack.T1562.001
- attack.TA0005
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - CommandLine:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - Details:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - registry.value:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - process.args:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - process.command_line:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - process.env_vars:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - process.io.text:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - process.title:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - pe.company:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - pe.description:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - pe.product:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - os.full:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - host.hostname:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - event.original:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - email.subject:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - device.model.name:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - container.image.name:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  - container.name:
    - '*cytool.exe runtime disable*'
    - '*cytool.exe startup disable*'
    - '*cytool.exe protect disable*'
    - '*cytool.exe event_collection disable*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
