title: Simple keyword detection rule for APT
id: 62b7e026-8182-42f4-aae0-5b18785cf2d9
status: experimental
description:
- '''linux commands abused by attackers - backdoor apt execute a command when invoking
  apt'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/17
tags:
- attack.T1012
- attack.T1027
- attack.T1035
- attack.T1036
- attack.T1041
- attack.T1053.005
- attack.T1057
- attack.T1059.003
- attack.T1070.001
- attack.T1083
- attack.T1105
- attack.T1112
- attack.T1136
- attack.T1562.001
- attack.T1564.001
- attack.T1564.002
- attack.T1564.003
- attack.T1564.005
- attack.TA0002
- attack.TA0003
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0010
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*APT::Update::Pre-Invoke *}*'
    OriginalFileName:
    - '*APT::Update::Pre-Invoke *}*'
    CurrentDirectory:
    - '*APT::Update::Pre-Invoke *}*'
    ParentImage:
    - '*APT::Update::Pre-Invoke *}*'
    ParentCommandLine:
    - '*APT::Update::Pre-Invoke *}*'
    TargetFilename:
    - '*APT::Update::Pre-Invoke *}*'
    Signature:
    - '*APT::Update::Pre-Invoke *}*'
    signature:
    - '*APT::Update::Pre-Invoke *}*'
    ImageLoaded:
    - '*APT::Update::Pre-Invoke *}*'
    Company:
    - '*APT::Update::Pre-Invoke *}*'
    Description:
    - '*APT::Update::Pre-Invoke *}*'
    description:
    - '*APT::Update::Pre-Invoke *}*'
    CommandLine:
    - '*APT::Update::Pre-Invoke *}*'
    SourceImage:
    - '*APT::Update::Pre-Invoke *}*'
    TargetImage:
    - '*APT::Update::Pre-Invoke *}*'
    CallTrace:
    - '*APT::Update::Pre-Invoke *}*'
    TargetObject:
    - '*APT::Update::Pre-Invoke *}*'
    Details:
    - '*APT::Update::Pre-Invoke *}*'
    PipeName:
    - '*APT::Update::Pre-Invoke *}*'
    Consumer:
    - '*APT::Update::Pre-Invoke *}*'
    Destination:
    - '*APT::Update::Pre-Invoke *}*'
    Name:
    - '*APT::Update::Pre-Invoke *}*'
    Query:
    - '*APT::Update::Pre-Invoke *}*'
    NewName:
    - '*APT::Update::Pre-Invoke *}*'
    StartAddress:
    - '*APT::Update::Pre-Invoke *}*'
    StartModule:
    - '*APT::Update::Pre-Invoke *}*'
    StartFunction:
    - '*APT::Update::Pre-Invoke *}*'
    SourceHostname:
    - '*APT::Update::Pre-Invoke *}*'
    Device:
    - '*APT::Update::Pre-Invoke *}*'
    file_name:
    - '*APT::Update::Pre-Invoke *}*'
    file_path:
    - '*APT::Update::Pre-Invoke *}*'
    process:
    - '*APT::Update::Pre-Invoke *}*'
    original_file_name:
    - '*APT::Update::Pre-Invoke *}*'
    parent_process:
    - '*APT::Update::Pre-Invoke *}*'
    process_path:
    - '*APT::Update::Pre-Invoke *}*'
    service_path:
    - '*APT::Update::Pre-Invoke *}*'
    registry_path:
    - '*APT::Update::Pre-Invoke *}*'
    registry_value_data:
    - '*APT::Update::Pre-Invoke *}*'
    registry_value_name:
    - '*APT::Update::Pre-Invoke *}*'
    ContextInfo:
    - '*APT::Update::Pre-Invoke *}*'
    Payload:
    - '*APT::Update::Pre-Invoke *}*'
    ScriptBlockText:
    - '*APT::Update::Pre-Invoke *}*'
    ServerName:
    - '*APT::Update::Pre-Invoke *}*'
    TransportName:
    - '*APT::Update::Pre-Invoke *}*'
    NewProcessName:
    - '*APT::Update::Pre-Invoke *}*'
    ParentProcessName:
    - '*APT::Update::Pre-Invoke *}*'
    Application:
    - '*APT::Update::Pre-Invoke *}*'
    Product Name:
    - '*APT::Update::Pre-Invoke *}*'
    Threat Name:
    - '*APT::Update::Pre-Invoke *}*'
    Process Name:
    - '*APT::Update::Pre-Invoke *}*'
    Path:
    - '*APT::Update::Pre-Invoke *}*'
    ImagePath:
    - '*APT::Update::Pre-Invoke *}*'
    ServiceName:
    - '*APT::Update::Pre-Invoke *}*'
    ProcessPath:
    - '*APT::Update::Pre-Invoke *}*'
    AppName:
    - '*APT::Update::Pre-Invoke *}*'
    AppPath:
    - '*APT::Update::Pre-Invoke *}*'
    ModulePath:
    - '*APT::Update::Pre-Invoke *}*'
    registry.data.strings:
    - '*APT::Update::Pre-Invoke *}*'
    registry.path:
    - '*APT::Update::Pre-Invoke *}*'
    registry.value:
    - '*APT::Update::Pre-Invoke *}*'
    process.args:
    - '*APT::Update::Pre-Invoke *}*'
    process.command_line:
    - '*APT::Update::Pre-Invoke *}*'
    process.env_vars:
    - '*APT::Update::Pre-Invoke *}*'
    process.io.text:
    - '*APT::Update::Pre-Invoke *}*'
    process.executable:
    - '*APT::Update::Pre-Invoke *}*'
    process.name:
    - '*APT::Update::Pre-Invoke *}*'
    process.title:
    - '*APT::Update::Pre-Invoke *}*'
    pe.company:
    - '*APT::Update::Pre-Invoke *}*'
    pe.description:
    - '*APT::Update::Pre-Invoke *}*'
    pe.original_file_name:
    - '*APT::Update::Pre-Invoke *}*'
    pe.product:
    - '*APT::Update::Pre-Invoke *}*'
    os.full:
    - '*APT::Update::Pre-Invoke *}*'
    host.hostname:
    - '*APT::Update::Pre-Invoke *}*'
    file.fork_name:
    - '*APT::Update::Pre-Invoke *}*'
    file.name:
    - '*APT::Update::Pre-Invoke *}*'
    file.path:
    - '*APT::Update::Pre-Invoke *}*'
    file.target_path:
    - '*APT::Update::Pre-Invoke *}*'
    email.attachments.file.name:
    - '*APT::Update::Pre-Invoke *}*'
    email.subject:
    - '*APT::Update::Pre-Invoke *}*'
    dll.path:
    - '*APT::Update::Pre-Invoke *}*'
    device.model.name:
    - '*APT::Update::Pre-Invoke *}*'
    container.image.name:
    - '*APT::Update::Pre-Invoke *}*'
    container.name:
    - '*APT::Update::Pre-Invoke *}*'
    object:
    - '*APT::Update::Pre-Invoke *}*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
