title: Simple keyword detection rule for FluxionNetwork
id: 7271fad8-4b31-414e-abc3-826acac1c17e
status: experimental
description:
- '''Fluxion is a security auditing and social-engineering research tool. It is a
  remake of linset by vk496 with (hopefully) fewer bugs and more functionality. The
  script attempts to retrieve the WPA/WPA2 key from a target access point by means
  of a social engineering (phishing) attack. Its compatible with the latest release
  of Kali (rolling). Fluxions attacks'' setup is mostly manual. but experimental auto-mode
  handles some of the attacks'' setup parameters. Read the FAQ before requesting issues'''
references:
- https://github.com/FluxionNetwork/fluxion
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/02
tags:
- attack.T1056
- attack.T1059
- attack.T1189
- attack.T1559
- attack.T1566
- attack.TA0001
- attack.TA0002
- attack.TA0009
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*FluxionNetwork*'
    OriginalFileName:
    - '*FluxionNetwork*'
    CurrentDirectory:
    - '*FluxionNetwork*'
    ParentImage:
    - '*FluxionNetwork*'
    ParentCommandLine:
    - '*FluxionNetwork*'
    TargetFilename:
    - '*FluxionNetwork*'
    Signature:
    - '*FluxionNetwork*'
    signature:
    - '*FluxionNetwork*'
    ImageLoaded:
    - '*FluxionNetwork*'
    Company:
    - '*FluxionNetwork*'
    Description:
    - '*FluxionNetwork*'
    description:
    - '*FluxionNetwork*'
    CommandLine:
    - '*FluxionNetwork*'
    SourceImage:
    - '*FluxionNetwork*'
    TargetImage:
    - '*FluxionNetwork*'
    CallTrace:
    - '*FluxionNetwork*'
    TargetObject:
    - '*FluxionNetwork*'
    Details:
    - '*FluxionNetwork*'
    PipeName:
    - '*FluxionNetwork*'
    Consumer:
    - '*FluxionNetwork*'
    Destination:
    - '*FluxionNetwork*'
    Name:
    - '*FluxionNetwork*'
    Query:
    - '*FluxionNetwork*'
    NewName:
    - '*FluxionNetwork*'
    StartAddress:
    - '*FluxionNetwork*'
    StartModule:
    - '*FluxionNetwork*'
    StartFunction:
    - '*FluxionNetwork*'
    SourceHostname:
    - '*FluxionNetwork*'
    Device:
    - '*FluxionNetwork*'
    file_name:
    - '*FluxionNetwork*'
    file_path:
    - '*FluxionNetwork*'
    process:
    - '*FluxionNetwork*'
    original_file_name:
    - '*FluxionNetwork*'
    parent_process:
    - '*FluxionNetwork*'
    process_path:
    - '*FluxionNetwork*'
    service_path:
    - '*FluxionNetwork*'
    registry_path:
    - '*FluxionNetwork*'
    registry_value_data:
    - '*FluxionNetwork*'
    registry_value_name:
    - '*FluxionNetwork*'
    ContextInfo:
    - '*FluxionNetwork*'
    Payload:
    - '*FluxionNetwork*'
    ScriptBlockText:
    - '*FluxionNetwork*'
    ServerName:
    - '*FluxionNetwork*'
    TransportName:
    - '*FluxionNetwork*'
    NewProcessName:
    - '*FluxionNetwork*'
    ParentProcessName:
    - '*FluxionNetwork*'
    Application:
    - '*FluxionNetwork*'
    Product Name:
    - '*FluxionNetwork*'
    Threat Name:
    - '*FluxionNetwork*'
    Process Name:
    - '*FluxionNetwork*'
    Path:
    - '*FluxionNetwork*'
    ImagePath:
    - '*FluxionNetwork*'
    ServiceName:
    - '*FluxionNetwork*'
    ProcessPath:
    - '*FluxionNetwork*'
    AppName:
    - '*FluxionNetwork*'
    AppPath:
    - '*FluxionNetwork*'
    ModulePath:
    - '*FluxionNetwork*'
    registry.data.strings:
    - '*FluxionNetwork*'
    registry.path:
    - '*FluxionNetwork*'
    registry.value:
    - '*FluxionNetwork*'
    process.args:
    - '*FluxionNetwork*'
    process.command_line:
    - '*FluxionNetwork*'
    process.env_vars:
    - '*FluxionNetwork*'
    process.io.text:
    - '*FluxionNetwork*'
    process.executable:
    - '*FluxionNetwork*'
    process.name:
    - '*FluxionNetwork*'
    process.title:
    - '*FluxionNetwork*'
    pe.company:
    - '*FluxionNetwork*'
    pe.description:
    - '*FluxionNetwork*'
    pe.original_file_name:
    - '*FluxionNetwork*'
    pe.product:
    - '*FluxionNetwork*'
    os.full:
    - '*FluxionNetwork*'
    host.hostname:
    - '*FluxionNetwork*'
    file.fork_name:
    - '*FluxionNetwork*'
    file.name:
    - '*FluxionNetwork*'
    file.path:
    - '*FluxionNetwork*'
    file.target_path:
    - '*FluxionNetwork*'
    email.attachments.file.name:
    - '*FluxionNetwork*'
    email.subject:
    - '*FluxionNetwork*'
    dll.path:
    - '*FluxionNetwork*'
    device.model.name:
    - '*FluxionNetwork*'
    container.image.name:
    - '*FluxionNetwork*'
    container.name:
    - '*FluxionNetwork*'
    object:
    - '*FluxionNetwork*'
    url:
    - '*FluxionNetwork*'
    dest_url:
    - '*FluxionNetwork*'
    uri:
    - '*FluxionNetwork*'
    uri_query:
    - '*FluxionNetwork*'
    query:
    - '*FluxionNetwork*'
    url_domain:
    - '*FluxionNetwork*'
    uri_path:
    - '*FluxionNetwork*'
    domain:
    - '*FluxionNetwork*'
    QueryName:
    - '*FluxionNetwork*'
    QueryResults:
    - '*FluxionNetwork*'
    DestinationHostname:
    - '*FluxionNetwork*'
    DestinationIp:
    - '*FluxionNetwork*'
    http_referrer:
    - '*FluxionNetwork*'
    http_referrer_domain:
    - '*FluxionNetwork*'
    http_user_agent:
    - '*FluxionNetwork*'
    dest_nt_host:
    - '*FluxionNetwork*'
    sender:
    - '*FluxionNetwork*'
    recipient:
    - '*FluxionNetwork*'
    orig_recipient:
    - '*FluxionNetwork*'
    subject:
    - '*FluxionNetwork*'
    url.domain:
    - '*FluxionNetwork*'
    url.full:
    - '*FluxionNetwork*'
    url.original:
    - '*FluxionNetwork*'
    url.query:
    - '*FluxionNetwork*'
    user_agent.original:
    - '*FluxionNetwork*'
    network.application:
    - '*FluxionNetwork*'
    http.request.body.content:
    - '*FluxionNetwork*'
    http.request.referrer:
    - '*FluxionNetwork*'
    email.from.address:
    - '*FluxionNetwork*'
    dns.question.name:
    - '*FluxionNetwork*'
    destination.domain:
    - '*FluxionNetwork*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
