title: Simple keyword detection rule for hackforums.net
id: 477795f9-214b-41f8-b50c-5f6cc0bbcde8
status: experimental
description: Detects interesting keywords based on hackforums.net tool
references:
- hackforums.net
author: '@mthcht'
date: 2023/07/30
modified: 2024/08/03
tags:
- attack.T1588.003
- attack.TA0011
logsource:
  category:
  - endpoint
  - network
detection:
  selection:
  - Image:
    - '*hackforums.net/*'
  - OriginalFileName:
    - '*hackforums.net/*'
  - CurrentDirectory:
    - '*hackforums.net/*'
  - ParentImage:
    - '*hackforums.net/*'
  - ParentCommandLine:
    - '*hackforums.net/*'
  - TargetFilename:
    - '*hackforums.net/*'
  - Signature:
    - '*hackforums.net/*'
  - signature:
    - '*hackforums.net/*'
  - ImageLoaded:
    - '*hackforums.net/*'
  - Company:
    - '*hackforums.net/*'
  - Description:
    - '*hackforums.net/*'
  - description:
    - '*hackforums.net/*'
  - CommandLine:
    - '*hackforums.net/*'
  - SourceImage:
    - '*hackforums.net/*'
  - TargetImage:
    - '*hackforums.net/*'
  - CallTrace:
    - '*hackforums.net/*'
  - TargetObject:
    - '*hackforums.net/*'
  - Details:
    - '*hackforums.net/*'
  - PipeName:
    - '*hackforums.net/*'
  - Consumer:
    - '*hackforums.net/*'
  - Destination:
    - '*hackforums.net/*'
  - Name:
    - '*hackforums.net/*'
  - Query:
    - '*hackforums.net/*'
  - NewName:
    - '*hackforums.net/*'
  - StartAddress:
    - '*hackforums.net/*'
  - StartModule:
    - '*hackforums.net/*'
  - StartFunction:
    - '*hackforums.net/*'
  - SourceHostname:
    - '*hackforums.net/*'
  - Device:
    - '*hackforums.net/*'
  - file_name:
    - '*hackforums.net/*'
  - file_path:
    - '*hackforums.net/*'
  - process:
    - '*hackforums.net/*'
  - original_file_name:
    - '*hackforums.net/*'
  - parent_process:
    - '*hackforums.net/*'
  - process_path:
    - '*hackforums.net/*'
  - service_path:
    - '*hackforums.net/*'
  - registry_path:
    - '*hackforums.net/*'
  - registry_value_data:
    - '*hackforums.net/*'
  - registry_value_name:
    - '*hackforums.net/*'
  - ContextInfo:
    - '*hackforums.net/*'
  - Payload:
    - '*hackforums.net/*'
  - ScriptBlockText:
    - '*hackforums.net/*'
  - ServerName:
    - '*hackforums.net/*'
  - TransportName:
    - '*hackforums.net/*'
  - NewProcessName:
    - '*hackforums.net/*'
  - ParentProcessName:
    - '*hackforums.net/*'
  - Application:
    - '*hackforums.net/*'
  - Product Name:
    - '*hackforums.net/*'
  - Threat Name:
    - '*hackforums.net/*'
  - Process Name:
    - '*hackforums.net/*'
  - Path:
    - '*hackforums.net/*'
  - ImagePath:
    - '*hackforums.net/*'
  - ServiceName:
    - '*hackforums.net/*'
  - ProcessPath:
    - '*hackforums.net/*'
  - AppName:
    - '*hackforums.net/*'
  - AppPath:
    - '*hackforums.net/*'
  - ModulePath:
    - '*hackforums.net/*'
  - registry.data.strings:
    - '*hackforums.net/*'
  - registry.path:
    - '*hackforums.net/*'
  - registry.value:
    - '*hackforums.net/*'
  - process.args:
    - '*hackforums.net/*'
  - process.command_line:
    - '*hackforums.net/*'
  - process.env_vars:
    - '*hackforums.net/*'
  - process.io.text:
    - '*hackforums.net/*'
  - process.executable:
    - '*hackforums.net/*'
  - process.name:
    - '*hackforums.net/*'
  - process.title:
    - '*hackforums.net/*'
  - pe.company:
    - '*hackforums.net/*'
  - pe.description:
    - '*hackforums.net/*'
  - pe.original_file_name:
    - '*hackforums.net/*'
  - pe.product:
    - '*hackforums.net/*'
  - os.full:
    - '*hackforums.net/*'
  - host.hostname:
    - '*hackforums.net/*'
  - file.fork_name:
    - '*hackforums.net/*'
  - file.name:
    - '*hackforums.net/*'
  - file.path:
    - '*hackforums.net/*'
  - file.target_path:
    - '*hackforums.net/*'
  - email.attachments.file.name:
    - '*hackforums.net/*'
  - email.subject:
    - '*hackforums.net/*'
  - dll.path:
    - '*hackforums.net/*'
  - device.model.name:
    - '*hackforums.net/*'
  - container.image.name:
    - '*hackforums.net/*'
  - container.name:
    - '*hackforums.net/*'
  - object:
    - '*hackforums.net/*'
  - url:
    - '*hackforums.net/*'
  - dest_url:
    - '*hackforums.net/*'
  - uri:
    - '*hackforums.net/*'
  - uri_query:
    - '*hackforums.net/*'
  - query:
    - '*hackforums.net/*'
  - url_domain:
    - '*hackforums.net/*'
  - uri_path:
    - '*hackforums.net/*'
  - domain:
    - '*hackforums.net/*'
  - QueryName:
    - '*hackforums.net/*'
  - QueryResults:
    - '*hackforums.net/*'
  - DestinationHostname:
    - '*hackforums.net/*'
  - DestinationIp:
    - '*hackforums.net/*'
  - http_referrer:
    - '*hackforums.net/*'
  - http_referrer_domain:
    - '*hackforums.net/*'
  - http_user_agent:
    - '*hackforums.net/*'
  - dest_nt_host:
    - '*hackforums.net/*'
  - sender:
    - '*hackforums.net/*'
  - recipient:
    - '*hackforums.net/*'
  - orig_recipient:
    - '*hackforums.net/*'
  - subject:
    - '*hackforums.net/*'
  - url.domain:
    - '*hackforums.net/*'
  - url.full:
    - '*hackforums.net/*'
  - url.original:
    - '*hackforums.net/*'
  - url.query:
    - '*hackforums.net/*'
  - user_agent.original:
    - '*hackforums.net/*'
  - network.application:
    - '*hackforums.net/*'
  - http.request.body.content:
    - '*hackforums.net/*'
  - http.request.referrer:
    - '*hackforums.net/*'
  - email.from.address:
    - '*hackforums.net/*'
  - dns.question.name:
    - '*hackforums.net/*'
  - destination.domain:
    - '*hackforums.net/*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
