title: Simple keyword detection rule for dpapi.py
id: 06d6282d-da56-4c93-b07d-11941cba606a
status: experimental
description: Detects interesting keywords based on dpapi.py tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2024/04/06
tags:
- attack.T1552.006
- attack.TA0009
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*dpapi.py backupkeys -t */*@*'
  - CommandLine:
    - '*dpapi.py backupkeys -t */*@*'
  - Details:
    - '*dpapi.py backupkeys -t */*@*'
  - registry.value:
    - '*dpapi.py backupkeys -t */*@*'
  - process.args:
    - '*dpapi.py backupkeys -t */*@*'
  - process.command_line:
    - '*dpapi.py backupkeys -t */*@*'
  - process.env_vars:
    - '*dpapi.py backupkeys -t */*@*'
  - process.io.text:
    - '*dpapi.py backupkeys -t */*@*'
  - process.title:
    - '*dpapi.py backupkeys -t */*@*'
  - pe.company:
    - '*dpapi.py backupkeys -t */*@*'
  - pe.description:
    - '*dpapi.py backupkeys -t */*@*'
  - pe.product:
    - '*dpapi.py backupkeys -t */*@*'
  - os.full:
    - '*dpapi.py backupkeys -t */*@*'
  - host.hostname:
    - '*dpapi.py backupkeys -t */*@*'
  - event.original:
    - '*dpapi.py backupkeys -t */*@*'
  - email.subject:
    - '*dpapi.py backupkeys -t */*@*'
  - device.model.name:
    - '*dpapi.py backupkeys -t */*@*'
  - container.image.name:
    - '*dpapi.py backupkeys -t */*@*'
  - container.name:
    - '*dpapi.py backupkeys -t */*@*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
