title: Simple keyword detection rule for modproble
id: 0f95e8fd-54be-4048-80d5-310c5d5dcb3d
status: experimental
description:
- '''Kernel modules are pieces of code that can be loaded and unloaded into the kernel
  upon demand. They extend the functionality of the kernel without the need to reboot
  the system. This rule identifies attempts to remove a kernel module.'''
references:
- https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_kernel_module_removal.toml
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/09
tags:
- attack.T1070.006
- attack.T1547.006
- attack.TA0003
- attack.TA0005
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*modprobe -r*'
    OriginalFileName:
    - '*modprobe -r*'
    CurrentDirectory:
    - '*modprobe -r*'
    ParentImage:
    - '*modprobe -r*'
    ParentCommandLine:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    TargetFilename:
    - '*modprobe -r*'
    Signature:
    - '*modprobe -r*'
    signature:
    - '*modprobe -r*'
    ImageLoaded:
    - '*modprobe -r*'
    Company:
    - '*modprobe -r*'
    Description:
    - '*modprobe -r*'
    description:
    - '*modprobe -r*'
    CommandLine:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    SourceImage:
    - '*modprobe -r*'
    TargetImage:
    - '*modprobe -r*'
    CallTrace:
    - '*modprobe -r*'
    TargetObject:
    - '*modprobe -r*'
    Details:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    PipeName:
    - '*modprobe -r*'
    Consumer:
    - '*modprobe -r*'
    Destination:
    - '*modprobe -r*'
    Name:
    - '*modprobe -r*'
    Query:
    - '*modprobe -r*'
    NewName:
    - '*modprobe -r*'
    StartAddress:
    - '*modprobe -r*'
    StartModule:
    - '*modprobe -r*'
    StartFunction:
    - '*modprobe -r*'
    SourceHostname:
    - '*modprobe -r*'
    Device:
    - '*modprobe -r*'
    file_name:
    - '*modprobe -r*'
    file_path:
    - '*modprobe -r*'
    process:
    - '*modprobe -r*'
    original_file_name:
    - '*modprobe -r*'
    parent_process:
    - '*modprobe -r*'
    process_path:
    - '*modprobe -r*'
    service_path:
    - '*modprobe -r*'
    registry_path:
    - '*modprobe -r*'
    registry_value_data:
    - '*modprobe -r*'
    registry_value_name:
    - '*modprobe -r*'
    ContextInfo:
    - '*modprobe -r*'
    Payload:
    - '*modprobe -r*'
    ScriptBlockText:
    - '*modprobe -r*'
    ServerName:
    - '*modprobe -r*'
    TransportName:
    - '*modprobe -r*'
    NewProcessName:
    - '*modprobe -r*'
    ParentProcessName:
    - '*modprobe -r*'
    Application:
    - '*modprobe -r*'
    Product Name:
    - '*modprobe -r*'
    Threat Name:
    - '*modprobe -r*'
    Process Name:
    - '*modprobe -r*'
    Path:
    - '*modprobe -r*'
    ImagePath:
    - '*modprobe -r*'
    ServiceName:
    - '*modprobe -r*'
    ProcessPath:
    - '*modprobe -r*'
    AppName:
    - '*modprobe -r*'
    AppPath:
    - '*modprobe -r*'
    ModulePath:
    - '*modprobe -r*'
    registry.data.strings:
    - '*modprobe -r*'
    registry.path:
    - '*modprobe -r*'
    registry.value:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    process.args:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    process.command_line:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    process.env_vars:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    process.io.text:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    process.executable:
    - '*modprobe -r*'
    process.name:
    - '*modprobe -r*'
    process.title:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    pe.company:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    pe.description:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    pe.original_file_name:
    - '*modprobe -r*'
    pe.product:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    os.full:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    host.hostname:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    file.fork_name:
    - '*modprobe -r*'
    file.name:
    - '*modprobe -r*'
    file.path:
    - '*modprobe -r*'
    file.target_path:
    - '*modprobe -r*'
    email.attachments.file.name:
    - '*modprobe -r*'
    email.subject:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    dll.path:
    - '*modprobe -r*'
    device.model.name:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    container.image.name:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    container.name:
    - '*modprobe -r*'
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
    object:
    - '*modprobe -r*'
    event.original:
    - '*modprobe --remove*'
    - '*modprobe rmmod -r*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- event.original
