title: Simple keyword detection rule for adobe.com
id: f03a94d8-1a48-4a34-a779-badbb6ae261a
status: experimental
description: Detects interesting keywords based on adobe.com tool
references:
- https://www.joesandbox.com/analysis/515360/0/html
author: '@mthcht'
date: 2023/07/30
modified: 2025/03/02
tags:
- attack.T1036
- attack.T1204.002
- attack.T1566.002
- attack.TA0001
- attack.TA0005
logsource:
  category:
  - network
detection:
  selection:
  - url:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - dest_url:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - uri:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - uri_query:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - query:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - url_domain:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - uri_path:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - domain:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - QueryName:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - QueryResults:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - DestinationHostname:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - DestinationIp:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - http_referrer:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - http_referrer_domain:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - http_user_agent:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - dest_nt_host:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - sender:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - recipient:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - orig_recipient:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - subject:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - url.domain:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - url.full:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - url.original:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - url.query:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - user_agent.original:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - network.application:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - http.request.body.content:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - http.request.referrer:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - email.from.address:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - dns.question.name:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  - destination.domain:
    - '*https://new.express.adobe.com/publishedV2/urn:aaid:sc:*'
    - '*https://spark.adobe.com/page/*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
