title: Simple keyword detection rule for smc
id: 60006f30-69a0-4094-8c59-ac3db95e3479
status: experimental
description: Detects interesting keywords based on smc tool
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Antivirus/Symantec%20Endpoint%20Protection#threat-actor-ops-taops
author: '@mthcht'
date: 2023/07/30
modified: 2024/02/08
tags:
- attack.T1089
- attack.T1562
- attack.TA0005
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - CommandLine:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - Details:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - registry.value:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - process.args:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - process.command_line:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - process.env_vars:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - process.io.text:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - process.title:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - pe.company:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - pe.description:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - pe.product:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - os.full:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - host.hostname:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - event.original:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - email.subject:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - device.model.name:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - container.image.name:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  - container.name:
    - '*smc -enable -gem*'
    - '*smc.exe -disable -ntp*'
    - '*smc.exe -enable -gem*'
    - '*smc -disable -mem*'
    - '*smc -disable -ntp*'
    - '*smc.exe -disable -mem*'
    - '*smc -disable -wss*'
    - '*smc.exe -disable -wss*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
