title: Simple keyword detection rule for SharpDllProxy
id: 9cb79032-9fd2-45cc-b753-2f18f519eff3
status: experimental
description:
- '''Retrieves exported functions from a legitimate DLL and generates a proxy DLL
  source code/template for DLL proxy loading or sideloading'''
references:
- https://github.com/Flangvik/SharpDllProxy
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/11
tags:
- attack.T1036
- attack.T1036.005
- attack.T1070
- attack.T1070.004
- attack.T1071
- attack.T1574.002
- attack.TA0002
- attack.TA0003
- attack.TA0004
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    CommandLine:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    Details:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    registry.value:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    process.args:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    process.command_line:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    process.env_vars:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    process.io.text:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    process.title:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    pe.company:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    pe.description:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    pe.product:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    os.full:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    host.hostname:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    event.original:
    - '* --dll * --payload *'
    email.subject:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    device.model.name:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    container.image.name:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    container.name:
    - '* --dll * --payload *'
    - '*SharpDllProxy*'
    Image:
    - '*SharpDllProxy*'
    OriginalFileName:
    - '*SharpDllProxy*'
    CurrentDirectory:
    - '*SharpDllProxy*'
    ParentImage:
    - '*SharpDllProxy*'
    TargetFilename:
    - '*SharpDllProxy*'
    Signature:
    - '*SharpDllProxy*'
    signature:
    - '*SharpDllProxy*'
    ImageLoaded:
    - '*SharpDllProxy*'
    Company:
    - '*SharpDllProxy*'
    Description:
    - '*SharpDllProxy*'
    description:
    - '*SharpDllProxy*'
    SourceImage:
    - '*SharpDllProxy*'
    TargetImage:
    - '*SharpDllProxy*'
    CallTrace:
    - '*SharpDllProxy*'
    TargetObject:
    - '*SharpDllProxy*'
    PipeName:
    - '*SharpDllProxy*'
    Consumer:
    - '*SharpDllProxy*'
    Destination:
    - '*SharpDllProxy*'
    Name:
    - '*SharpDllProxy*'
    Query:
    - '*SharpDllProxy*'
    NewName:
    - '*SharpDllProxy*'
    StartAddress:
    - '*SharpDllProxy*'
    StartModule:
    - '*SharpDllProxy*'
    StartFunction:
    - '*SharpDllProxy*'
    SourceHostname:
    - '*SharpDllProxy*'
    Device:
    - '*SharpDllProxy*'
    file_name:
    - '*SharpDllProxy*'
    file_path:
    - '*SharpDllProxy*'
    process:
    - '*SharpDllProxy*'
    original_file_name:
    - '*SharpDllProxy*'
    parent_process:
    - '*SharpDllProxy*'
    process_path:
    - '*SharpDllProxy*'
    service_path:
    - '*SharpDllProxy*'
    registry_path:
    - '*SharpDllProxy*'
    registry_value_data:
    - '*SharpDllProxy*'
    registry_value_name:
    - '*SharpDllProxy*'
    ContextInfo:
    - '*SharpDllProxy*'
    Payload:
    - '*SharpDllProxy*'
    ScriptBlockText:
    - '*SharpDllProxy*'
    ServerName:
    - '*SharpDllProxy*'
    TransportName:
    - '*SharpDllProxy*'
    NewProcessName:
    - '*SharpDllProxy*'
    ParentProcessName:
    - '*SharpDllProxy*'
    Application:
    - '*SharpDllProxy*'
    Product Name:
    - '*SharpDllProxy*'
    Threat Name:
    - '*SharpDllProxy*'
    Process Name:
    - '*SharpDllProxy*'
    Path:
    - '*SharpDllProxy*'
    ImagePath:
    - '*SharpDllProxy*'
    ServiceName:
    - '*SharpDllProxy*'
    ProcessPath:
    - '*SharpDllProxy*'
    AppName:
    - '*SharpDllProxy*'
    AppPath:
    - '*SharpDllProxy*'
    ModulePath:
    - '*SharpDllProxy*'
    registry.data.strings:
    - '*SharpDllProxy*'
    registry.path:
    - '*SharpDllProxy*'
    process.executable:
    - '*SharpDllProxy*'
    process.name:
    - '*SharpDllProxy*'
    pe.original_file_name:
    - '*SharpDllProxy*'
    file.fork_name:
    - '*SharpDllProxy*'
    file.name:
    - '*SharpDllProxy*'
    file.path:
    - '*SharpDllProxy*'
    file.target_path:
    - '*SharpDllProxy*'
    email.attachments.file.name:
    - '*SharpDllProxy*'
    dll.path:
    - '*SharpDllProxy*'
    object:
    - '*SharpDllProxy*'
    url:
    - '*SharpDllProxy*'
    dest_url:
    - '*SharpDllProxy*'
    uri:
    - '*SharpDllProxy*'
    uri_query:
    - '*SharpDllProxy*'
    query:
    - '*SharpDllProxy*'
    url_domain:
    - '*SharpDllProxy*'
    uri_path:
    - '*SharpDllProxy*'
    domain:
    - '*SharpDllProxy*'
    QueryName:
    - '*SharpDllProxy*'
    QueryResults:
    - '*SharpDllProxy*'
    DestinationHostname:
    - '*SharpDllProxy*'
    DestinationIp:
    - '*SharpDllProxy*'
    http_referrer:
    - '*SharpDllProxy*'
    http_referrer_domain:
    - '*SharpDllProxy*'
    http_user_agent:
    - '*SharpDllProxy*'
    dest_nt_host:
    - '*SharpDllProxy*'
    sender:
    - '*SharpDllProxy*'
    recipient:
    - '*SharpDllProxy*'
    orig_recipient:
    - '*SharpDllProxy*'
    subject:
    - '*SharpDllProxy*'
    url.domain:
    - '*SharpDllProxy*'
    url.full:
    - '*SharpDllProxy*'
    url.original:
    - '*SharpDllProxy*'
    url.query:
    - '*SharpDllProxy*'
    user_agent.original:
    - '*SharpDllProxy*'
    network.application:
    - '*SharpDllProxy*'
    http.request.body.content:
    - '*SharpDllProxy*'
    http.request.referrer:
    - '*SharpDllProxy*'
    email.from.address:
    - '*SharpDllProxy*'
    dns.question.name:
    - '*SharpDllProxy*'
    destination.domain:
    - '*SharpDllProxy*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
