title: Simple keyword detection rule for wbadmin
id: 2ad1c3d1-68fa-4541-b302-80f02fe761b5
status: experimental
description:
- '''Wbadmin allows administrators to manage and automate backup and recovery operations
  in Windows systems. Adversaries may abuse wbadmin to manipulate backups and restore
  points as part of their evasion tactics. This can include deleting backup files.
  disabling backup tasks. or tampering with backup configurations to hinder recovery
  efforts and potentially erase traces of their malicious activities. By interfering
  with backups. adversaries can make it more challenging for defenders to restore
  systems and detect their presence.'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/03
tags:
- attack.T1490
- attack.T1562.001
- attack.TA0007
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    CommandLine:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    Details:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    registry.value:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    process.args:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    process.command_line:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    process.env_vars:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    process.io.text:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    process.title:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    pe.company:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    pe.description:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    pe.product:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    os.full:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    host.hostname:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    event.original:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    email.subject:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    device.model.name:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    container.image.name:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
    container.name:
    - '*wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest*'
    - '*wbadmin DELETE SYSTEMSTATEBACKUP*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
