title: Simple keyword detection rule for steam
id: 3ea24737-8ae0-4269-ae4f-73e089dc6e02
status: experimental
description: Detects interesting keywords based on steam tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2025/01/29
tags:
- attack.T1091
- attack.T1102
- attack.T1204
- attack.TA0001
- attack.TA0009
logsource:
  category:
  - network
detection:
  selection:
  - url:
    - '*https://steamcommunity.com/profiles/*'
  - dest_url:
    - '*https://steamcommunity.com/profiles/*'
  - uri:
    - '*https://steamcommunity.com/profiles/*'
  - uri_query:
    - '*https://steamcommunity.com/profiles/*'
  - query:
    - '*https://steamcommunity.com/profiles/*'
  - url_domain:
    - '*https://steamcommunity.com/profiles/*'
  - uri_path:
    - '*https://steamcommunity.com/profiles/*'
  - domain:
    - '*https://steamcommunity.com/profiles/*'
  - QueryName:
    - '*https://steamcommunity.com/profiles/*'
  - QueryResults:
    - '*https://steamcommunity.com/profiles/*'
  - DestinationHostname:
    - '*https://steamcommunity.com/profiles/*'
  - DestinationIp:
    - '*https://steamcommunity.com/profiles/*'
  - http_referrer:
    - '*https://steamcommunity.com/profiles/*'
  - http_referrer_domain:
    - '*https://steamcommunity.com/profiles/*'
  - http_user_agent:
    - '*https://steamcommunity.com/profiles/*'
  - dest_nt_host:
    - '*https://steamcommunity.com/profiles/*'
  - sender:
    - '*https://steamcommunity.com/profiles/*'
  - recipient:
    - '*https://steamcommunity.com/profiles/*'
  - orig_recipient:
    - '*https://steamcommunity.com/profiles/*'
  - subject:
    - '*https://steamcommunity.com/profiles/*'
  - url.domain:
    - '*https://steamcommunity.com/profiles/*'
  - url.full:
    - '*https://steamcommunity.com/profiles/*'
  - url.original:
    - '*https://steamcommunity.com/profiles/*'
  - url.query:
    - '*https://steamcommunity.com/profiles/*'
  - user_agent.original:
    - '*https://steamcommunity.com/profiles/*'
  - network.application:
    - '*https://steamcommunity.com/profiles/*'
  - http.request.body.content:
    - '*https://steamcommunity.com/profiles/*'
  - http.request.referrer:
    - '*https://steamcommunity.com/profiles/*'
  - email.from.address:
    - '*https://steamcommunity.com/profiles/*'
  - dns.question.name:
    - '*https://steamcommunity.com/profiles/*'
  - destination.domain:
    - '*https://steamcommunity.com/profiles/*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
