title: Simple keyword detection rule for MeteTool
id: f40ebf85-06d1-4ebe-967a-1daec92a7554
status: experimental
description:
- '''Metatool Minetest mod provides API for registering metadata manipulation tools
  and other tools primarily focused on special node data operations.'''
references:
- https://github.com/S-S-X/metatool
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/10
tags:
- attack.T1059.003
- attack.T1059.007
- attack.T1064
- attack.T1135
- attack.TA0002
- attack.TA0003
- attack.TA0004
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*MeteTool*'
    OriginalFileName:
    - '*MeteTool*'
    CurrentDirectory:
    - '*MeteTool*'
    ParentImage:
    - '*MeteTool*'
    ParentCommandLine:
    - '*MeteTool*'
    TargetFilename:
    - '*MeteTool*'
    Signature:
    - '*MeteTool*'
    signature:
    - '*MeteTool*'
    ImageLoaded:
    - '*MeteTool*'
    Company:
    - '*MeteTool*'
    Description:
    - '*MeteTool*'
    description:
    - '*MeteTool*'
    CommandLine:
    - '*MeteTool*'
    SourceImage:
    - '*MeteTool*'
    TargetImage:
    - '*MeteTool*'
    CallTrace:
    - '*MeteTool*'
    TargetObject:
    - '*MeteTool*'
    Details:
    - '*MeteTool*'
    PipeName:
    - '*MeteTool*'
    Consumer:
    - '*MeteTool*'
    Destination:
    - '*MeteTool*'
    Name:
    - '*MeteTool*'
    Query:
    - '*MeteTool*'
    NewName:
    - '*MeteTool*'
    StartAddress:
    - '*MeteTool*'
    StartModule:
    - '*MeteTool*'
    StartFunction:
    - '*MeteTool*'
    SourceHostname:
    - '*MeteTool*'
    Device:
    - '*MeteTool*'
    file_name:
    - '*MeteTool*'
    file_path:
    - '*MeteTool*'
    process:
    - '*MeteTool*'
    original_file_name:
    - '*MeteTool*'
    parent_process:
    - '*MeteTool*'
    process_path:
    - '*MeteTool*'
    service_path:
    - '*MeteTool*'
    registry_path:
    - '*MeteTool*'
    registry_value_data:
    - '*MeteTool*'
    registry_value_name:
    - '*MeteTool*'
    ContextInfo:
    - '*MeteTool*'
    Payload:
    - '*MeteTool*'
    ScriptBlockText:
    - '*MeteTool*'
    ServerName:
    - '*MeteTool*'
    TransportName:
    - '*MeteTool*'
    NewProcessName:
    - '*MeteTool*'
    ParentProcessName:
    - '*MeteTool*'
    Application:
    - '*MeteTool*'
    Product Name:
    - '*MeteTool*'
    Threat Name:
    - '*MeteTool*'
    Process Name:
    - '*MeteTool*'
    Path:
    - '*MeteTool*'
    ImagePath:
    - '*MeteTool*'
    ServiceName:
    - '*MeteTool*'
    ProcessPath:
    - '*MeteTool*'
    AppName:
    - '*MeteTool*'
    AppPath:
    - '*MeteTool*'
    ModulePath:
    - '*MeteTool*'
    registry.data.strings:
    - '*MeteTool*'
    registry.path:
    - '*MeteTool*'
    registry.value:
    - '*MeteTool*'
    process.args:
    - '*MeteTool*'
    process.command_line:
    - '*MeteTool*'
    process.env_vars:
    - '*MeteTool*'
    process.io.text:
    - '*MeteTool*'
    process.executable:
    - '*MeteTool*'
    process.name:
    - '*MeteTool*'
    process.title:
    - '*MeteTool*'
    pe.company:
    - '*MeteTool*'
    pe.description:
    - '*MeteTool*'
    pe.original_file_name:
    - '*MeteTool*'
    pe.product:
    - '*MeteTool*'
    os.full:
    - '*MeteTool*'
    host.hostname:
    - '*MeteTool*'
    file.fork_name:
    - '*MeteTool*'
    file.name:
    - '*MeteTool*'
    file.path:
    - '*MeteTool*'
    file.target_path:
    - '*MeteTool*'
    email.attachments.file.name:
    - '*MeteTool*'
    email.subject:
    - '*MeteTool*'
    dll.path:
    - '*MeteTool*'
    device.model.name:
    - '*MeteTool*'
    container.image.name:
    - '*MeteTool*'
    container.name:
    - '*MeteTool*'
    object:
    - '*MeteTool*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
