title: Simple keyword detection rule for Excel
id: 738b0150-eee8-482a-8566-6d8e60beae88
status: experimental
description:
- "'prevent any warnings or alerts when Python functions are about to be executed.\
  \ Threat actors could run malicious code through the new \n  Microsoft Excel feature\
  \ that allows Python to run within the spreadsheet'"
references:
- https://github.com/tsale/Sigma_rules/blob/main/MISC/pythonfunctionwarnings_disabled.yml
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/30
tags:
- attack.T1112
- attack.T1131
- attack.T1204.002
- attack.TA0003
- attack.TA0005
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- medium
detection:
  selection:
    ParentCommandLine:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    CommandLine:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Details:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    registry.value:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process.args:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process.command_line:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process.env_vars:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process.io.text:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process.title:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    pe.company:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    pe.description:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    pe.product:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    os.full:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    host.hostname:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    event.original:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    email.subject:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    device.model.name:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    container.image.name:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    container.name:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Image:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    OriginalFileName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    CurrentDirectory:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ParentImage:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    TargetFilename:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Signature:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    signature:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ImageLoaded:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Company:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Description:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    description:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    SourceImage:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    TargetImage:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    CallTrace:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    TargetObject:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    PipeName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Consumer:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Destination:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Query:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    NewName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    StartAddress:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    StartModule:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    StartFunction:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    SourceHostname:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Device:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    file_name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    file_path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    original_file_name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    parent_process:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process_path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    service_path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    registry_path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    registry_value_data:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    registry_value_name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ContextInfo:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Payload:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ScriptBlockText:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ServerName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    TransportName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    NewProcessName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ParentProcessName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Application:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Product Name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Threat Name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Process Name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    Path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ImagePath:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ServiceName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ProcessPath:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    AppName:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    AppPath:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    ModulePath:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    registry.data.strings:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    registry.path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process.executable:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    process.name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    pe.original_file_name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    file.fork_name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    file.name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    file.path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    file.target_path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    email.attachments.file.name:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    dll.path:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
    object:
    - '*Set-ItemProperty *\excel\security*pythonfunctionwarnings*0*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
