title: Simple keyword detection rule for Excel
id: 738b0150-eee8-482a-8566-6d8e60beae88
status: experimental
description:
- "'prevent any warnings or alerts when Python functions are about to be executed.\
  \ Threat actors could run malicious code through the new \n  Microsoft Excel feature\
  \ that allows Python to run within the spreadsheet'"
references:
- https://github.com/tsale/Sigma_rules/blob/main/MISC/pythonfunctionwarnings_disabled.yml
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/28
tags:
- attack.T1112
- attack.T1131
- attack.T1204.002
- attack.TA0003
- attack.TA0005
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- medium
detection:
  selection:
    ParentCommandLine:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    CommandLine:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    Details:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    registry.value:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    process.args:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    process.command_line:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    process.env_vars:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    process.io.text:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    process.title:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    pe.company:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    pe.description:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    pe.product:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    os.full:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    host.hostname:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    event.original:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    email.subject:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    device.model.name:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    container.image.name:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    container.name:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    url:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    dest_url:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    uri:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    uri_query:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    query:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    url_domain:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    uri_path:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    domain:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    QueryName:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    QueryResults:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    DestinationHostname:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    DestinationIp:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    http_referrer:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    http_referrer_domain:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    http_user_agent:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    dest_nt_host:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    sender:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    recipient:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    orig_recipient:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    subject:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    url.domain:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    url.full:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    url.original:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    url.query:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    user_agent.original:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    network.application:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    http.request.body.content:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    http.request.referrer:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    email.from.address:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    dns.question.name:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
    destination.domain:
    - '*reg add HKCU\software\policies\microsoft\office\16.0\excel\security /v PythonFunctionWarnings
      /t REG_DWORD /d 0 /f?*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
