title: Simple keyword detection rule for dirtycow
id: 710da2c7-b46f-477b-bf38-2fd89d72d366
status: experimental
description:
- '''Linux vulnerability name to go root CVE-2016-5195) Dirty COW est une vulnrabilit
  de scurit du noyau Linux qui affecte tous les systmes d''exploitation Linux. y compris
  Android. C''est un dfaut d''lvation de privilge qui exploite une condition de concurrence
  dans la mise en uvre de la copie sur criture dans le noyau de gestion de la mmoire'''
references:
- 'multiple pocs on github and others places '
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/24
tags:
- attack.T1055
- attack.T1068
- attack.T1574.002
- attack.TA0002
- attack.TA0004
- attack.TA0005
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*dirtycow*'
    OriginalFileName:
    - '*dirtycow*'
    CurrentDirectory:
    - '*dirtycow*'
    ParentImage:
    - '*dirtycow*'
    ParentCommandLine:
    - '*dirtycow*'
    TargetFilename:
    - '*dirtycow*'
    Signature:
    - '*dirtycow*'
    signature:
    - '*dirtycow*'
    ImageLoaded:
    - '*dirtycow*'
    Company:
    - '*dirtycow*'
    Description:
    - '*dirtycow*'
    description:
    - '*dirtycow*'
    CommandLine:
    - '*dirtycow*'
    SourceImage:
    - '*dirtycow*'
    TargetImage:
    - '*dirtycow*'
    CallTrace:
    - '*dirtycow*'
    TargetObject:
    - '*dirtycow*'
    Details:
    - '*dirtycow*'
    PipeName:
    - '*dirtycow*'
    Consumer:
    - '*dirtycow*'
    Destination:
    - '*dirtycow*'
    Name:
    - '*dirtycow*'
    Query:
    - '*dirtycow*'
    NewName:
    - '*dirtycow*'
    StartAddress:
    - '*dirtycow*'
    StartModule:
    - '*dirtycow*'
    StartFunction:
    - '*dirtycow*'
    SourceHostname:
    - '*dirtycow*'
    Device:
    - '*dirtycow*'
    file_name:
    - '*dirtycow*'
    file_path:
    - '*dirtycow*'
    process:
    - '*dirtycow*'
    original_file_name:
    - '*dirtycow*'
    parent_process:
    - '*dirtycow*'
    process_path:
    - '*dirtycow*'
    service_path:
    - '*dirtycow*'
    registry_path:
    - '*dirtycow*'
    registry_value_data:
    - '*dirtycow*'
    registry_value_name:
    - '*dirtycow*'
    ContextInfo:
    - '*dirtycow*'
    Payload:
    - '*dirtycow*'
    ScriptBlockText:
    - '*dirtycow*'
    ServerName:
    - '*dirtycow*'
    TransportName:
    - '*dirtycow*'
    NewProcessName:
    - '*dirtycow*'
    ParentProcessName:
    - '*dirtycow*'
    Application:
    - '*dirtycow*'
    Product Name:
    - '*dirtycow*'
    Threat Name:
    - '*dirtycow*'
    Process Name:
    - '*dirtycow*'
    Path:
    - '*dirtycow*'
    ImagePath:
    - '*dirtycow*'
    ServiceName:
    - '*dirtycow*'
    ProcessPath:
    - '*dirtycow*'
    AppName:
    - '*dirtycow*'
    AppPath:
    - '*dirtycow*'
    ModulePath:
    - '*dirtycow*'
    registry.data.strings:
    - '*dirtycow*'
    registry.path:
    - '*dirtycow*'
    registry.value:
    - '*dirtycow*'
    process.args:
    - '*dirtycow*'
    process.command_line:
    - '*dirtycow*'
    process.env_vars:
    - '*dirtycow*'
    process.io.text:
    - '*dirtycow*'
    process.executable:
    - '*dirtycow*'
    process.name:
    - '*dirtycow*'
    process.title:
    - '*dirtycow*'
    pe.company:
    - '*dirtycow*'
    pe.description:
    - '*dirtycow*'
    pe.original_file_name:
    - '*dirtycow*'
    pe.product:
    - '*dirtycow*'
    os.full:
    - '*dirtycow*'
    host.hostname:
    - '*dirtycow*'
    file.fork_name:
    - '*dirtycow*'
    file.name:
    - '*dirtycow*'
    file.path:
    - '*dirtycow*'
    file.target_path:
    - '*dirtycow*'
    email.attachments.file.name:
    - '*dirtycow*'
    email.subject:
    - '*dirtycow*'
    dll.path:
    - '*dirtycow*'
    device.model.name:
    - '*dirtycow*'
    container.image.name:
    - '*dirtycow*'
    container.name:
    - '*dirtycow*'
    object:
    - '*dirtycow*'
    url:
    - '*dirtycow*'
    dest_url:
    - '*dirtycow*'
    uri:
    - '*dirtycow*'
    uri_query:
    - '*dirtycow*'
    query:
    - '*dirtycow*'
    url_domain:
    - '*dirtycow*'
    uri_path:
    - '*dirtycow*'
    domain:
    - '*dirtycow*'
    QueryName:
    - '*dirtycow*'
    QueryResults:
    - '*dirtycow*'
    DestinationHostname:
    - '*dirtycow*'
    DestinationIp:
    - '*dirtycow*'
    http_referrer:
    - '*dirtycow*'
    http_referrer_domain:
    - '*dirtycow*'
    http_user_agent:
    - '*dirtycow*'
    dest_nt_host:
    - '*dirtycow*'
    sender:
    - '*dirtycow*'
    recipient:
    - '*dirtycow*'
    orig_recipient:
    - '*dirtycow*'
    subject:
    - '*dirtycow*'
    url.domain:
    - '*dirtycow*'
    url.full:
    - '*dirtycow*'
    url.original:
    - '*dirtycow*'
    url.query:
    - '*dirtycow*'
    user_agent.original:
    - '*dirtycow*'
    network.application:
    - '*dirtycow*'
    http.request.body.content:
    - '*dirtycow*'
    http.request.referrer:
    - '*dirtycow*'
    email.from.address:
    - '*dirtycow*'
    dns.question.name:
    - '*dirtycow*'
    destination.domain:
    - '*dirtycow*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
