title: Simple keyword detection rule for xxd
id: 9d5cec00-a3d6-4346-8911-ab13bf20a907
status: experimental
description: Detects interesting keywords based on xxd tool
references:
- https://github.com/RoseSecurity/Red-Teaming-TTPs/blob/main/Linux.md
author: '@mthcht'
date: 2023/07/30
modified: 2024/05/15
tags:
- attack.T1002
- attack.T1016
- attack.T1090
- attack.TA0009
- attack.TA0011
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - CommandLine:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - Details:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - registry.value:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - process.args:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - process.command_line:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - process.env_vars:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - process.io.text:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - process.title:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - pe.company:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - pe.description:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - pe.product:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - os.full:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - host.hostname:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - event.original:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - email.subject:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - device.model.name:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - container.image.name:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  - container.name:
    - '*xxd -p -c 4 /* | while read line* do ping -c 1 -p *'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
