title: Simple keyword detection rule for unshadow
id: 835b2a6b-5c3a-445a-8f66-8772ddcc9753
status: experimental
description: Detects interesting keywords based on unshadow tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2024/07/01
tags:
- attack.T1012
- attack.T1027
- attack.T1035
- attack.T1036
- attack.T1041
- attack.T1053.005
- attack.T1057
- attack.T1059.003
- attack.T1070.001
- attack.T1083
- attack.T1105
- attack.T1112
- attack.T1136
- attack.T1562.001
- attack.T1564.001
- attack.T1564.002
- attack.T1564.003
- attack.T1564.005
- attack.TA0002
- attack.TA0003
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0010
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*unshadow passwd shadow > *'
  - CommandLine:
    - '*unshadow passwd shadow > *'
  - Details:
    - '*unshadow passwd shadow > *'
  - registry.value:
    - '*unshadow passwd shadow > *'
  - process.args:
    - '*unshadow passwd shadow > *'
  - process.command_line:
    - '*unshadow passwd shadow > *'
  - process.env_vars:
    - '*unshadow passwd shadow > *'
  - process.io.text:
    - '*unshadow passwd shadow > *'
  - process.title:
    - '*unshadow passwd shadow > *'
  - pe.company:
    - '*unshadow passwd shadow > *'
  - pe.description:
    - '*unshadow passwd shadow > *'
  - pe.product:
    - '*unshadow passwd shadow > *'
  - os.full:
    - '*unshadow passwd shadow > *'
  - host.hostname:
    - '*unshadow passwd shadow > *'
  - event.original:
    - '*unshadow passwd shadow > *'
  - email.subject:
    - '*unshadow passwd shadow > *'
  - device.model.name:
    - '*unshadow passwd shadow > *'
  - container.image.name:
    - '*unshadow passwd shadow > *'
  - container.name:
    - '*unshadow passwd shadow > *'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
