title: Simple keyword detection rule for Getcap
id: 47aa1bf0-48fb-47fb-a708-366140a9634b
status: experimental
description: Detects interesting keywords based on Getcap tool
references:
- https://github.com/RoseSecurity/Red-Teaming-TTPs/blob/main/Linux.md
author: '@mthcht'
date: 2023/07/30
modified: 2024/07/01
tags:
- attack.T1046
- attack.T1083
- attack.TA0007
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*getcap -r / 2>/dev/null*'
  - CommandLine:
    - '*getcap -r / 2>/dev/null*'
  - Details:
    - '*getcap -r / 2>/dev/null*'
  - registry.value:
    - '*getcap -r / 2>/dev/null*'
  - process.args:
    - '*getcap -r / 2>/dev/null*'
  - process.command_line:
    - '*getcap -r / 2>/dev/null*'
  - process.env_vars:
    - '*getcap -r / 2>/dev/null*'
  - process.io.text:
    - '*getcap -r / 2>/dev/null*'
  - process.title:
    - '*getcap -r / 2>/dev/null*'
  - pe.company:
    - '*getcap -r / 2>/dev/null*'
  - pe.description:
    - '*getcap -r / 2>/dev/null*'
  - pe.product:
    - '*getcap -r / 2>/dev/null*'
  - os.full:
    - '*getcap -r / 2>/dev/null*'
  - host.hostname:
    - '*getcap -r / 2>/dev/null*'
  - event.original:
    - '*getcap -r / 2>/dev/null*'
  - email.subject:
    - '*getcap -r / 2>/dev/null*'
  - device.model.name:
    - '*getcap -r / 2>/dev/null*'
  - container.image.name:
    - '*getcap -r / 2>/dev/null*'
  - container.name:
    - '*getcap -r / 2>/dev/null*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
