title: Simple keyword detection rule for fltMC
id: a56894f9-0191-496f-9f68-92caea8df7d2
status: experimental
description: Detects interesting keywords based on fltMC tool
references:
- https://github.com/mthcht/Purpleteam/blob/main/Simulation/Windows/System/unload_sysmon_driver_with_fltmc.ps1
author: '@mthcht'
date: 2023/07/30
modified: 2024/01/28
tags:
- attack.T1562.001
- attack.T1562.002
- attack.T1562.006
- attack.TA0005
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*fltMC* unload SysmonDrv*'
  - CommandLine:
    - '*fltMC* unload SysmonDrv*'
  - Details:
    - '*fltMC* unload SysmonDrv*'
  - registry.value:
    - '*fltMC* unload SysmonDrv*'
  - process.args:
    - '*fltMC* unload SysmonDrv*'
  - process.command_line:
    - '*fltMC* unload SysmonDrv*'
  - process.env_vars:
    - '*fltMC* unload SysmonDrv*'
  - process.io.text:
    - '*fltMC* unload SysmonDrv*'
  - process.title:
    - '*fltMC* unload SysmonDrv*'
  - pe.company:
    - '*fltMC* unload SysmonDrv*'
  - pe.description:
    - '*fltMC* unload SysmonDrv*'
  - pe.product:
    - '*fltMC* unload SysmonDrv*'
  - os.full:
    - '*fltMC* unload SysmonDrv*'
  - host.hostname:
    - '*fltMC* unload SysmonDrv*'
  - event.original:
    - '*fltMC* unload SysmonDrv*'
  - email.subject:
    - '*fltMC* unload SysmonDrv*'
  - device.model.name:
    - '*fltMC* unload SysmonDrv*'
  - container.image.name:
    - '*fltMC* unload SysmonDrv*'
  - container.name:
    - '*fltMC* unload SysmonDrv*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
