title: Simple keyword detection rule for ngrok
id: 49018e61-ff49-4e17-9fd7-e4d9a4952cda
status: experimental
description:
- '''ngrok - abused by attackers for C2 usage'''
references:
- https://github.com/RoseSecurity/Red-Teaming-TTPs/blob/main/Linux.md
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/30
tags:
- attack.T1008
- attack.T1090
- attack.T1095
- attack.TA0002
- attack.TA0004
- attack.TA0011
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- critical
detection:
  selection:
    Image:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    OriginalFileName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    CurrentDirectory:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ParentImage:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ParentCommandLine:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    TargetFilename:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Signature:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    signature:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ImageLoaded:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Company:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Description:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    description:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    CommandLine:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    SourceImage:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    TargetImage:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    CallTrace:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    TargetObject:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Details:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    PipeName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Consumer:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Destination:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Query:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    NewName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    StartAddress:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    StartModule:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    StartFunction:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    SourceHostname:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Device:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    file_name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    file_path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    process:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    original_file_name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    parent_process:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    process_path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    service_path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    registry_path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    registry_value_data:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    registry_value_name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ContextInfo:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Payload:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ScriptBlockText:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ServerName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    TransportName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    NewProcessName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ParentProcessName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Application:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Product Name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Threat Name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Process Name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    Path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ImagePath:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ServiceName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ProcessPath:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    AppName:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    AppPath:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    ModulePath:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    registry.data.strings:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    registry.path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    registry.value:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    process.args:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    process.command_line:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    process.env_vars:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    process.io.text:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    process.executable:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    process.name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    process.title:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    pe.company:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    pe.description:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    pe.original_file_name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    pe.product:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    os.full:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    host.hostname:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    file.fork_name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    file.name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    file.path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    file.target_path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    email.attachments.file.name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    email.subject:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    dll.path:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    device.model.name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    container.image.name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    container.name:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*ngrok tcp *'
    - '*LHOST=0.tcp.ngrok.io*'
    object:
    - '*tcp://0.tcp.ngrok.io:*'
    - '*LHOST=0.tcp.ngrok.io*'
    event.original:
    - '*ngrok tcp *'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- event.original
