title: Simple keyword detection rule for snmpwalk
id: a6dc1605-acfd-47f1-94e4-8fea23cb2307
status: experimental
description: Detects interesting keywords based on snmpwalk tool
references:
- https://wiki.debian.org/SNMP
author: '@mthcht'
date: 2023/07/30
modified: 2024/08/31
tags:
- attack.T1018
- attack.T1046
- attack.TA0005
- attack.TA0007
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - CommandLine:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - Details:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - registry.value:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - process.args:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - process.command_line:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - process.env_vars:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - process.io.text:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - process.title:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - pe.company:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - pe.description:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - pe.product:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - os.full:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - host.hostname:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - event.original:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - email.subject:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - device.model.name:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - container.image.name:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  - container.name:
    - '*snmpwalk -c public -v1 *'
    - '*snmpwalk  -v1 -cpublic *'
    - '*snmpwalk * public *1.3.6.1.*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
