title: Simple keyword detection rule for DomainPasswordSpray
id: f5ce4bbd-fd97-4de4-b784-2f9b9df48152
status: experimental
description:
- '''DomainPasswordSpray is a tool written in PowerShell to perform a password spray
  attack against users of a domain. By default it will automatically generate the
  userlist from the domain. BE VERY CAREFUL NOT TO LOCKOUT ACCOUNTS!'''
references:
- https://github.com/dafthack/DomainPasswordSpray
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/13
tags:
- attack.t1110
- attack.T1114
- attack.T1555
- attack.TA0003
- attack.TA0006
- attack.TA0040
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    OriginalFileName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    CurrentDirectory:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ParentImage:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ParentCommandLine:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    TargetFilename:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Signature:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    signature:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ImageLoaded:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Company:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Description:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    description:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    CommandLine:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    SourceImage:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    TargetImage:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    CallTrace:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    TargetObject:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Details:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    PipeName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Consumer:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Destination:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Query:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    NewName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    StartAddress:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    StartModule:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    StartFunction:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    SourceHostname:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Device:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    file_name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    file_path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    original_file_name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    parent_process:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process_path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    service_path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    registry_path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    registry_value_data:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    registry_value_name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ContextInfo:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Payload:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ScriptBlockText:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ServerName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    TransportName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    NewProcessName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ParentProcessName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Application:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Product Name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Threat Name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Process Name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    Path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ImagePath:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ServiceName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ProcessPath:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    AppName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    AppPath:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    ModulePath:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    registry.data.strings:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    registry.path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    registry.value:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process.args:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process.command_line:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process.env_vars:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process.io.text:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process.executable:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process.name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    process.title:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    pe.company:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    pe.description:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    pe.original_file_name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    pe.product:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    os.full:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    host.hostname:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    file.fork_name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    file.name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    file.path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    file.target_path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    email.attachments.file.name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    email.subject:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    dll.path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    device.model.name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    container.image.name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    container.name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    object:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    url:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    dest_url:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    uri:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    uri_query:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    query:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    url_domain:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    uri_path:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    domain:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    QueryName:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    QueryResults:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    DestinationHostname:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    DestinationIp:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    http_referrer:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    http_referrer_domain:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    http_user_agent:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    dest_nt_host:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    sender:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    recipient:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    orig_recipient:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    subject:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    url.domain:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    url.full:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    url.original:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    url.query:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    user_agent.original:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    network.application:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    http.request.body.content:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    http.request.referrer:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    email.from.address:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    dns.question.name:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
    destination.domain:
    - '*DomainPasswordSpray*'
    - '*PasswordSpray *'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
