title: Simple keyword detection rule for RadareEye
id: 921b7c13-0fc1-4f0f-858c-7944527d2509
status: experimental
description:
- '''Tool for especially scanning nearby devices and execute a given command on its
  own system while the target device comes in range.'''
references:
- https://github.com/souravbaghz/RadareEye
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/02
tags:
- attack.N/A
- attack.T1550 T1555 T1212 T1558
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    CommandLine:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Details:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    registry.value:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process.args:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process.command_line:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process.env_vars:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process.io.text:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process.title:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    pe.company:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    pe.description:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    pe.product:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    os.full:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    host.hostname:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    event.original:
    - '* radare *:* -ble*'
    email.subject:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    device.model.name:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    container.image.name:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    container.name:
    - '* radare *:* -ble*'
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Image:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    OriginalFileName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    CurrentDirectory:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ParentImage:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    TargetFilename:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Signature:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    signature:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ImageLoaded:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Company:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Description:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    description:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    SourceImage:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    TargetImage:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    CallTrace:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    TargetObject:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    PipeName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Consumer:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Destination:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Query:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    NewName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    StartAddress:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    StartModule:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    StartFunction:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    SourceHostname:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Device:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    file_name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    file_path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    original_file_name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    parent_process:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process_path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    service_path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    registry_path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    registry_value_data:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    registry_value_name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ContextInfo:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Payload:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ScriptBlockText:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ServerName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    TransportName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    NewProcessName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ParentProcessName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Application:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Product Name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Threat Name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Process Name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    Path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ImagePath:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ServiceName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ProcessPath:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    AppName:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    AppPath:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    ModulePath:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    registry.data.strings:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    registry.path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process.executable:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    process.name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    pe.original_file_name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    file.fork_name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    file.name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    file.path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    file.target_path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    email.attachments.file.name:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    dll.path:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    object:
    - '*souravbaghz/RadareEye*'
    - ./radare *
    url:
    - '*souravbaghz/RadareEye*'
    dest_url:
    - '*souravbaghz/RadareEye*'
    uri:
    - '*souravbaghz/RadareEye*'
    uri_query:
    - '*souravbaghz/RadareEye*'
    query:
    - '*souravbaghz/RadareEye*'
    url_domain:
    - '*souravbaghz/RadareEye*'
    uri_path:
    - '*souravbaghz/RadareEye*'
    domain:
    - '*souravbaghz/RadareEye*'
    QueryName:
    - '*souravbaghz/RadareEye*'
    QueryResults:
    - '*souravbaghz/RadareEye*'
    DestinationHostname:
    - '*souravbaghz/RadareEye*'
    DestinationIp:
    - '*souravbaghz/RadareEye*'
    http_referrer:
    - '*souravbaghz/RadareEye*'
    http_referrer_domain:
    - '*souravbaghz/RadareEye*'
    http_user_agent:
    - '*souravbaghz/RadareEye*'
    dest_nt_host:
    - '*souravbaghz/RadareEye*'
    sender:
    - '*souravbaghz/RadareEye*'
    recipient:
    - '*souravbaghz/RadareEye*'
    orig_recipient:
    - '*souravbaghz/RadareEye*'
    subject:
    - '*souravbaghz/RadareEye*'
    url.domain:
    - '*souravbaghz/RadareEye*'
    url.full:
    - '*souravbaghz/RadareEye*'
    url.original:
    - '*souravbaghz/RadareEye*'
    url.query:
    - '*souravbaghz/RadareEye*'
    user_agent.original:
    - '*souravbaghz/RadareEye*'
    network.application:
    - '*souravbaghz/RadareEye*'
    http.request.body.content:
    - '*souravbaghz/RadareEye*'
    http.request.referrer:
    - '*souravbaghz/RadareEye*'
    email.from.address:
    - '*souravbaghz/RadareEye*'
    dns.question.name:
    - '*souravbaghz/RadareEye*'
    destination.domain:
    - '*souravbaghz/RadareEye*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
