title: Simple keyword detection rule for macchanger
id: 79dbe365-a44c-472d-94a7-fe659920725b
status: experimental
description:
- '''changing mac address with macchanger'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/06
tags:
- attack.T1036.004
- attack.T1059.001
- attack.T1497.001
- attack.TA0005
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- medium
detection:
  selection:
    ParentCommandLine:
    - '*macchanger -r *'
    CommandLine:
    - '*macchanger -r *'
    Details:
    - '*macchanger -r *'
    registry.value:
    - '*macchanger -r *'
    process.args:
    - '*macchanger -r *'
    process.command_line:
    - '*macchanger -r *'
    process.env_vars:
    - '*macchanger -r *'
    process.io.text:
    - '*macchanger -r *'
    process.title:
    - '*macchanger -r *'
    pe.company:
    - '*macchanger -r *'
    pe.description:
    - '*macchanger -r *'
    pe.product:
    - '*macchanger -r *'
    os.full:
    - '*macchanger -r *'
    host.hostname:
    - '*macchanger -r *'
    event.original:
    - '*macchanger -r *'
    email.subject:
    - '*macchanger -r *'
    device.model.name:
    - '*macchanger -r *'
    container.image.name:
    - '*macchanger -r *'
    container.name:
    - '*macchanger -r *'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
