title: Simple keyword detection rule for wget
id: 6c2f95b6-3f7f-4eb5-845c-52898f8d3d2c
status: experimental
description: Detects interesting keywords based on wget tool
references:
- https://x.com/CraigHRowland/status/1782938242108837896
author: '@mthcht'
date: 2023/07/30
modified: 2024/05/08
tags:
- attack.T1566
- attack.TA0002
- attack.TA0005
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - CommandLine:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - Details:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - registry.value:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - process.args:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - process.command_line:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - process.env_vars:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - process.io.text:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - process.title:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - pe.company:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - pe.description:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - pe.product:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - os.full:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - host.hostname:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - event.original:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - email.subject:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - device.model.name:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - container.image.name:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  - container.name:
    - '*wget -O - -q https://*.jpg|sh*'
    - '*wget -O - -q http://*.jpg|sh*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
