title: Simple keyword detection rule for track.adform.net
id: 3d3df8a9-caec-4e33-9260-fbb9bf919a7c
status: experimental
description: Detects interesting keywords based on track.adform.net tool
references:
- https://www.joesandbox.com/analysis/514456/0/html
author: '@mthcht'
date: 2023/07/30
modified: 2025/03/02
tags:
- attack.T1036
- attack.T1204.002
- attack.T1566.002
- attack.TA0001
- attack.TA0005
logsource:
  category:
  - network
detection:
  selection:
  - url:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - dest_url:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - uri:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - uri_query:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - query:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - url_domain:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - uri_path:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - domain:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - QueryName:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - QueryResults:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - DestinationHostname:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - DestinationIp:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - http_referrer:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - http_referrer_domain:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - http_user_agent:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - dest_nt_host:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - sender:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - recipient:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - orig_recipient:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - subject:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - url.domain:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - url.full:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - url.original:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - url.query:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - user_agent.original:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - network.application:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - http.request.body.content:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - http.request.referrer:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - email.from.address:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - dns.question.name:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  - destination.domain:
    - '*https://track.adform.net/C/?bn=*;cpdir=http*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
