title: Simple keyword detection rule for ftype
id: 9489108e-247b-4721-ae54-593d0d06de85
status: experimental
description: Detects interesting keywords based on ftype tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2023/11/19
tags:
- attack.T1033
- attack.T1059
- attack.T1083
- attack.TA0002
- attack.TA0007
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - CommandLine:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - Details:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - registry.value:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - process.args:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - process.command_line:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - process.env_vars:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - process.io.text:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - process.title:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - pe.company:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - pe.description:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - pe.product:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - os.full:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - host.hostname:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - event.original:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - email.subject:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - device.model.name:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - container.image.name:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  - container.name:
    - '*ftype *findstr SHCm*'
    - '*ftype *findstr *SHCm*'
    - '*ftype *findstr dfil*'
    - '*ftype *findstr *dfil*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
