title: Simple keyword detection rule for netcat
id: d646f013-c66e-4e51-9974-2f0487b70c4a
status: experimental
description:
- '''ncat reverse shell'''
- '''Netcat is a featured networking utility which reads and writes data across network
  connections'''
- '''Netcat is a featured networking utility which reads and writes data across network
  connections. using the TCP/IP protocol It is designed to be a reliable back-end
  tool that can be used directly or easily driven by other programs and scripts. At
  the same time. it is a feature-rich network debugging and exploration tool. since
  it can create almost any kind of connection you would need and has several interesting
  built-in capabilities'''
- '''netcat shell listener'''
- '''netcat shell'''
references:
- http://netcat.sourceforge.net/
- https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/15
tags:
- attack.T1021.001
- attack.T1021.002
- attack.T1043
- attack.T1052
- attack.T1071
- attack.T1095
- attack.T1105
- attack.T1132
- attack.T1573
- attack.TA0001
- attack.TA0002
- attack.TA0007
- attack.TA0008
- attack.TA0011
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*netCat*'
    OriginalFileName:
    - '*netCat*'
    CurrentDirectory:
    - '*netCat*'
    ParentImage:
    - '*netCat*'
    ParentCommandLine:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    TargetFilename:
    - '*netCat*'
    Signature:
    - '*netCat*'
    signature:
    - '*netCat*'
    ImageLoaded:
    - '*netCat*'
    Company:
    - '*netCat*'
    Description:
    - '*netCat*'
    description:
    - '*netCat*'
    CommandLine:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    SourceImage:
    - '*netCat*'
    TargetImage:
    - '*netCat*'
    CallTrace:
    - '*netCat*'
    TargetObject:
    - '*netCat*'
    Details:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    PipeName:
    - '*netCat*'
    Consumer:
    - '*netCat*'
    Destination:
    - '*netCat*'
    Name:
    - '*netCat*'
    Query:
    - '*netCat*'
    NewName:
    - '*netCat*'
    StartAddress:
    - '*netCat*'
    StartModule:
    - '*netCat*'
    StartFunction:
    - '*netCat*'
    SourceHostname:
    - '*netCat*'
    Device:
    - '*netCat*'
    file_name:
    - '*netCat*'
    file_path:
    - '*netCat*'
    process:
    - '*netCat*'
    original_file_name:
    - '*netCat*'
    parent_process:
    - '*netCat*'
    process_path:
    - '*netCat*'
    service_path:
    - '*netCat*'
    registry_path:
    - '*netCat*'
    registry_value_data:
    - '*netCat*'
    registry_value_name:
    - '*netCat*'
    ContextInfo:
    - '*netCat*'
    Payload:
    - '*netCat*'
    ScriptBlockText:
    - '*netCat*'
    ServerName:
    - '*netCat*'
    TransportName:
    - '*netCat*'
    NewProcessName:
    - '*netCat*'
    ParentProcessName:
    - '*netCat*'
    Application:
    - '*netCat*'
    Product Name:
    - '*netCat*'
    Threat Name:
    - '*netCat*'
    Process Name:
    - '*netCat*'
    Path:
    - '*netCat*'
    ImagePath:
    - '*netCat*'
    ServiceName:
    - '*netCat*'
    ProcessPath:
    - '*netCat*'
    AppName:
    - '*netCat*'
    AppPath:
    - '*netCat*'
    ModulePath:
    - '*netCat*'
    registry.data.strings:
    - '*netCat*'
    registry.path:
    - '*netCat*'
    registry.value:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    process.args:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    process.command_line:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    process.env_vars:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    process.io.text:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    process.executable:
    - '*netCat*'
    process.name:
    - '*netCat*'
    process.title:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    pe.company:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    pe.description:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    pe.original_file_name:
    - '*netCat*'
    pe.product:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    os.full:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    host.hostname:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    file.fork_name:
    - '*netCat*'
    file.name:
    - '*netCat*'
    file.path:
    - '*netCat*'
    file.target_path:
    - '*netCat*'
    email.attachments.file.name:
    - '*netCat*'
    email.subject:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    dll.path:
    - '*netCat*'
    device.model.name:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    container.image.name:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    container.name:
    - '*netCat*'
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
    object:
    - '*netCat*'
    event.original:
    - '*nc -u -lvp *'
    - nc -vz *
    - '*ncat --udp * -e /bin/bash*'
    - '*ncat * -e /bin/bash*'
    - '*nc * -e /bin/bash*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- event.original
