title: Simple keyword detection rule for systemctl
id: 9750bed9-011a-400c-b98f-d2bc8c985402
status: experimental
description: Detects interesting keywords based on systemctl tool
references:
- https://attack.mitre.org/techniques/T1562/001/
author: '@mthcht'
date: 2023/07/30
modified: 2025/03/02
tags:
- attack.T1055
- attack.T1070.004
- attack.T1089
- attack.T1218.011
- attack.T1489
- attack.T1562
- attack.TA0005
- attack.TA0007
- attack.TA0040
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - CommandLine:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - Details:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - registry.value:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - process.args:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - process.command_line:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - process.env_vars:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - process.io.text:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - process.title:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - pe.company:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - pe.description:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - pe.product:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - os.full:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - host.hostname:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - event.original:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - email.subject:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - device.model.name:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - container.image.name:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  - container.name:
    - '*systemctl stop falcon-sensor.service*'
    - '*systemctl disable cbdaemon*'
    - '*systemctl stop usbguard.service*'
    - '*systemctl disable falcon-sensor.service*'
    - '*systemctl stop cbdaemon*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
