title: Simple keyword detection rule for APCLdr
id: e971bb67-fb8c-482f-8fd5-dc26ebe42e66
status: experimental
description:
- '''APCLdr: Payload Loader With Evasion Features'''
references:
- https://github.com/NUL0x4C/APCLdr
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/11
tags:
- attack.T1027
- attack.T1055
- attack.T1055.002
- attack.T1055.003
- attack.T1070
- attack.T1070.004
- attack.T1071
- attack.T1106
- attack.T1574.001
- attack.TA0005
- attack.TA0006
- attack.TA0008
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    OriginalFileName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    CurrentDirectory:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ParentImage:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ParentCommandLine:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    TargetFilename:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Signature:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    signature:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ImageLoaded:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Company:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Description:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    description:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    CommandLine:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    SourceImage:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    TargetImage:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    CallTrace:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    TargetObject:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Details:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    PipeName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Consumer:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Destination:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Query:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    NewName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    StartAddress:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    StartModule:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    StartFunction:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    SourceHostname:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Device:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    file_name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    file_path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    original_file_name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    parent_process:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process_path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    service_path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    registry_path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    registry_value_data:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    registry_value_name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ContextInfo:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Payload:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ScriptBlockText:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ServerName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    TransportName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    NewProcessName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ParentProcessName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Application:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Product Name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Threat Name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Process Name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    Path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ImagePath:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ServiceName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ProcessPath:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    AppName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    AppPath:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    ModulePath:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    registry.data.strings:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    registry.path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    registry.value:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process.args:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process.command_line:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process.env_vars:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process.io.text:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process.executable:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process.name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    process.title:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    pe.company:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    pe.description:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    pe.original_file_name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    pe.product:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    os.full:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    host.hostname:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    file.fork_name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    file.name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    file.path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    file.target_path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    email.attachments.file.name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    email.subject:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    dll.path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    device.model.name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    container.image.name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    container.name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    object:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    url:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    dest_url:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    uri:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    uri_query:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    query:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    url_domain:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    uri_path:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    domain:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    QueryName:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    QueryResults:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    DestinationHostname:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    DestinationIp:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    http_referrer:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    http_referrer_domain:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    http_user_agent:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    dest_nt_host:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    sender:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    recipient:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    orig_recipient:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    subject:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    url.domain:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    url.full:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    url.original:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    url.query:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    user_agent.original:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    network.application:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    http.request.body.content:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    http.request.referrer:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    email.from.address:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    dns.question.name:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
    destination.domain:
    - '*/APCLdr.*'
    - '*NUL0x4C/APCLdr*'
    - '*\APCLdr.*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
