title: Simple keyword detection rule for attifyos
id: ab6ca3a0-59fd-432b-90fe-81560834fe49
status: experimental
description:
- '''AttifyOS is a distro intended to help you perform security assessment and penetration
  testing of Internet of Things (IoT) devices. It saves you a lot of time by providing
  a pre-configured environment with all the necessary tools loaded. The new version
  is based on Ubuntu 18.04 64-Bit - that also means that you''ll receive updates for
  this version till April 2023.'''
references:
- https://github.com/adi0x90/attifyos
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/17
tags:
- attack.T1110
- attack.T1189
- attack.T1210
- attack.T1559
- attack.T1565
- attack.TA0002
- attack.TA0003
- attack.TA0008
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*AttifyOS*'
    OriginalFileName:
    - '*AttifyOS*'
    CurrentDirectory:
    - '*AttifyOS*'
    ParentImage:
    - '*AttifyOS*'
    ParentCommandLine:
    - '*AttifyOS*'
    TargetFilename:
    - '*AttifyOS*'
    Signature:
    - '*AttifyOS*'
    signature:
    - '*AttifyOS*'
    ImageLoaded:
    - '*AttifyOS*'
    Company:
    - '*AttifyOS*'
    Description:
    - '*AttifyOS*'
    description:
    - '*AttifyOS*'
    CommandLine:
    - '*AttifyOS*'
    SourceImage:
    - '*AttifyOS*'
    TargetImage:
    - '*AttifyOS*'
    CallTrace:
    - '*AttifyOS*'
    TargetObject:
    - '*AttifyOS*'
    Details:
    - '*AttifyOS*'
    PipeName:
    - '*AttifyOS*'
    Consumer:
    - '*AttifyOS*'
    Destination:
    - '*AttifyOS*'
    Name:
    - '*AttifyOS*'
    Query:
    - '*AttifyOS*'
    NewName:
    - '*AttifyOS*'
    StartAddress:
    - '*AttifyOS*'
    StartModule:
    - '*AttifyOS*'
    StartFunction:
    - '*AttifyOS*'
    SourceHostname:
    - '*AttifyOS*'
    Device:
    - '*AttifyOS*'
    file_name:
    - '*AttifyOS*'
    file_path:
    - '*AttifyOS*'
    process:
    - '*AttifyOS*'
    original_file_name:
    - '*AttifyOS*'
    parent_process:
    - '*AttifyOS*'
    process_path:
    - '*AttifyOS*'
    service_path:
    - '*AttifyOS*'
    registry_path:
    - '*AttifyOS*'
    registry_value_data:
    - '*AttifyOS*'
    registry_value_name:
    - '*AttifyOS*'
    ContextInfo:
    - '*AttifyOS*'
    Payload:
    - '*AttifyOS*'
    ScriptBlockText:
    - '*AttifyOS*'
    ServerName:
    - '*AttifyOS*'
    TransportName:
    - '*AttifyOS*'
    NewProcessName:
    - '*AttifyOS*'
    ParentProcessName:
    - '*AttifyOS*'
    Application:
    - '*AttifyOS*'
    Product Name:
    - '*AttifyOS*'
    Threat Name:
    - '*AttifyOS*'
    Process Name:
    - '*AttifyOS*'
    Path:
    - '*AttifyOS*'
    ImagePath:
    - '*AttifyOS*'
    ServiceName:
    - '*AttifyOS*'
    ProcessPath:
    - '*AttifyOS*'
    AppName:
    - '*AttifyOS*'
    AppPath:
    - '*AttifyOS*'
    ModulePath:
    - '*AttifyOS*'
    registry.data.strings:
    - '*AttifyOS*'
    registry.path:
    - '*AttifyOS*'
    registry.value:
    - '*AttifyOS*'
    process.args:
    - '*AttifyOS*'
    process.command_line:
    - '*AttifyOS*'
    process.env_vars:
    - '*AttifyOS*'
    process.io.text:
    - '*AttifyOS*'
    process.executable:
    - '*AttifyOS*'
    process.name:
    - '*AttifyOS*'
    process.title:
    - '*AttifyOS*'
    pe.company:
    - '*AttifyOS*'
    pe.description:
    - '*AttifyOS*'
    pe.original_file_name:
    - '*AttifyOS*'
    pe.product:
    - '*AttifyOS*'
    os.full:
    - '*AttifyOS*'
    host.hostname:
    - '*AttifyOS*'
    file.fork_name:
    - '*AttifyOS*'
    file.name:
    - '*AttifyOS*'
    file.path:
    - '*AttifyOS*'
    file.target_path:
    - '*AttifyOS*'
    email.attachments.file.name:
    - '*AttifyOS*'
    email.subject:
    - '*AttifyOS*'
    dll.path:
    - '*AttifyOS*'
    device.model.name:
    - '*AttifyOS*'
    container.image.name:
    - '*AttifyOS*'
    container.name:
    - '*AttifyOS*'
    object:
    - '*AttifyOS*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
