title: Simple keyword detection rule for dev-tunnels
id: 6ecb74f5-a450-4183-90d8-2c12ac30b9c9
status: experimental
description:
- '''Dev tunnels allow developers to securely share local web services across the
  internet. Enabling you to connect your local development environment with cloud
  services and share work in progress with colleagues or aid in building webhooks'''
references:
- https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/overview
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/29
tags:
- attack.T1021.003
- attack.T1090
- attack.T1105
- attack.TA0002
- attack.TA0005
- attack.TA0011
logsource:
  category:
  - network
falsepositives:
- Unknown
level:
- medium
detection:
  selection:
    url:
    - '*https://*.use.devtunnels.ms*'
    dest_url:
    - '*https://*.use.devtunnels.ms*'
    uri:
    - '*https://*.use.devtunnels.ms*'
    uri_query:
    - '*https://*.use.devtunnels.ms*'
    query:
    - '*https://*.use.devtunnels.ms*'
    url_domain:
    - '*https://*.use.devtunnels.ms*'
    uri_path:
    - '*https://*.use.devtunnels.ms*'
    domain:
    - '*https://*.use.devtunnels.ms*'
    QueryName:
    - '*https://*.use.devtunnels.ms*'
    QueryResults:
    - '*https://*.use.devtunnels.ms*'
    DestinationHostname:
    - '*https://*.use.devtunnels.ms*'
    DestinationIp:
    - '*https://*.use.devtunnels.ms*'
    http_referrer:
    - '*https://*.use.devtunnels.ms*'
    http_referrer_domain:
    - '*https://*.use.devtunnels.ms*'
    http_user_agent:
    - '*https://*.use.devtunnels.ms*'
    dest_nt_host:
    - '*https://*.use.devtunnels.ms*'
    sender:
    - '*https://*.use.devtunnels.ms*'
    recipient:
    - '*https://*.use.devtunnels.ms*'
    orig_recipient:
    - '*https://*.use.devtunnels.ms*'
    subject:
    - '*https://*.use.devtunnels.ms*'
    url.domain:
    - '*https://*.use.devtunnels.ms*'
    url.full:
    - '*https://*.use.devtunnels.ms*'
    url.original:
    - '*https://*.use.devtunnels.ms*'
    url.query:
    - '*https://*.use.devtunnels.ms*'
    user_agent.original:
    - '*https://*.use.devtunnels.ms*'
    network.application:
    - '*https://*.use.devtunnels.ms*'
    http.request.body.content:
    - '*https://*.use.devtunnels.ms*'
    http.request.referrer:
    - '*https://*.use.devtunnels.ms*'
    email.from.address:
    - '*https://*.use.devtunnels.ms*'
    dns.question.name:
    - '*https://*.use.devtunnels.ms*'
    destination.domain:
    - '*https://*.use.devtunnels.ms*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
