title: Simple keyword detection rule for touch
id: f2195504-bb65-43c8-83a2-63bf8ff341b1
status: experimental
description:
- '''Timestomping is an anti-forensics technique which is used to modify the timestamps
  of a file* often to mimic files that are in the same folder.'''
references:
- https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_timestomp_touch.toml
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/06
tags:
- attack.T1070.006
- attack.T1562.001
- attack.TA0005
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    CommandLine:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    Details:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    registry.value:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    process.args:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    process.command_line:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    process.env_vars:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    process.io.text:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    process.title:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    pe.company:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    pe.description:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    pe.product:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    os.full:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    host.hostname:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    event.original:
    - '*touch -r *'
    - '*touch -t *'
    email.subject:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    device.model.name:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    container.image.name:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    container.name:
    - '*touch -r *'
    - '*touch -m*'
    - '*touch -t *'
    - '*touch -a*'
    Image:
    - '*touch -m*'
    - '*touch -a*'
    OriginalFileName:
    - '*touch -m*'
    - '*touch -a*'
    CurrentDirectory:
    - '*touch -m*'
    - '*touch -a*'
    ParentImage:
    - '*touch -m*'
    - '*touch -a*'
    TargetFilename:
    - '*touch -m*'
    - '*touch -a*'
    Signature:
    - '*touch -m*'
    - '*touch -a*'
    signature:
    - '*touch -m*'
    - '*touch -a*'
    ImageLoaded:
    - '*touch -m*'
    - '*touch -a*'
    Company:
    - '*touch -m*'
    - '*touch -a*'
    Description:
    - '*touch -m*'
    - '*touch -a*'
    description:
    - '*touch -m*'
    - '*touch -a*'
    SourceImage:
    - '*touch -m*'
    - '*touch -a*'
    TargetImage:
    - '*touch -m*'
    - '*touch -a*'
    CallTrace:
    - '*touch -m*'
    - '*touch -a*'
    TargetObject:
    - '*touch -m*'
    - '*touch -a*'
    PipeName:
    - '*touch -m*'
    - '*touch -a*'
    Consumer:
    - '*touch -m*'
    - '*touch -a*'
    Destination:
    - '*touch -m*'
    - '*touch -a*'
    Name:
    - '*touch -m*'
    - '*touch -a*'
    Query:
    - '*touch -m*'
    - '*touch -a*'
    NewName:
    - '*touch -m*'
    - '*touch -a*'
    StartAddress:
    - '*touch -m*'
    - '*touch -a*'
    StartModule:
    - '*touch -m*'
    - '*touch -a*'
    StartFunction:
    - '*touch -m*'
    - '*touch -a*'
    SourceHostname:
    - '*touch -m*'
    - '*touch -a*'
    Device:
    - '*touch -m*'
    - '*touch -a*'
    file_name:
    - '*touch -m*'
    - '*touch -a*'
    file_path:
    - '*touch -m*'
    - '*touch -a*'
    process:
    - '*touch -m*'
    - '*touch -a*'
    original_file_name:
    - '*touch -m*'
    - '*touch -a*'
    parent_process:
    - '*touch -m*'
    - '*touch -a*'
    process_path:
    - '*touch -m*'
    - '*touch -a*'
    service_path:
    - '*touch -m*'
    - '*touch -a*'
    registry_path:
    - '*touch -m*'
    - '*touch -a*'
    registry_value_data:
    - '*touch -m*'
    - '*touch -a*'
    registry_value_name:
    - '*touch -m*'
    - '*touch -a*'
    ContextInfo:
    - '*touch -m*'
    - '*touch -a*'
    Payload:
    - '*touch -m*'
    - '*touch -a*'
    ScriptBlockText:
    - '*touch -m*'
    - '*touch -a*'
    ServerName:
    - '*touch -m*'
    - '*touch -a*'
    TransportName:
    - '*touch -m*'
    - '*touch -a*'
    NewProcessName:
    - '*touch -m*'
    - '*touch -a*'
    ParentProcessName:
    - '*touch -m*'
    - '*touch -a*'
    Application:
    - '*touch -m*'
    - '*touch -a*'
    Product Name:
    - '*touch -m*'
    - '*touch -a*'
    Threat Name:
    - '*touch -m*'
    - '*touch -a*'
    Process Name:
    - '*touch -m*'
    - '*touch -a*'
    Path:
    - '*touch -m*'
    - '*touch -a*'
    ImagePath:
    - '*touch -m*'
    - '*touch -a*'
    ServiceName:
    - '*touch -m*'
    - '*touch -a*'
    ProcessPath:
    - '*touch -m*'
    - '*touch -a*'
    AppName:
    - '*touch -m*'
    - '*touch -a*'
    AppPath:
    - '*touch -m*'
    - '*touch -a*'
    ModulePath:
    - '*touch -m*'
    - '*touch -a*'
    registry.data.strings:
    - '*touch -m*'
    - '*touch -a*'
    registry.path:
    - '*touch -m*'
    - '*touch -a*'
    process.executable:
    - '*touch -m*'
    - '*touch -a*'
    process.name:
    - '*touch -m*'
    - '*touch -a*'
    pe.original_file_name:
    - '*touch -m*'
    - '*touch -a*'
    file.fork_name:
    - '*touch -m*'
    - '*touch -a*'
    file.name:
    - '*touch -m*'
    - '*touch -a*'
    file.path:
    - '*touch -m*'
    - '*touch -a*'
    file.target_path:
    - '*touch -m*'
    - '*touch -a*'
    email.attachments.file.name:
    - '*touch -m*'
    - '*touch -a*'
    dll.path:
    - '*touch -m*'
    - '*touch -a*'
    object:
    - '*touch -m*'
    - '*touch -a*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
