title: Simple keyword detection rule for skymen.info
id: 66beee57-7254-4d42-bcde-b3007f865c5c
status: experimental
description:
- '''used by attackers to find informations about a company users'''
references:
- https://www.skymem.info
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/15
tags:
- attack.T1213
- attack.T1593
- attack.T1596
- attack.TA0009
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*https://www.skymem.info/srch?q=*'
    OriginalFileName:
    - '*https://www.skymem.info/srch?q=*'
    CurrentDirectory:
    - '*https://www.skymem.info/srch?q=*'
    ParentImage:
    - '*https://www.skymem.info/srch?q=*'
    ParentCommandLine:
    - '*https://www.skymem.info/srch?q=*'
    TargetFilename:
    - '*https://www.skymem.info/srch?q=*'
    Signature:
    - '*https://www.skymem.info/srch?q=*'
    signature:
    - '*https://www.skymem.info/srch?q=*'
    ImageLoaded:
    - '*https://www.skymem.info/srch?q=*'
    Company:
    - '*https://www.skymem.info/srch?q=*'
    Description:
    - '*https://www.skymem.info/srch?q=*'
    description:
    - '*https://www.skymem.info/srch?q=*'
    CommandLine:
    - '*https://www.skymem.info/srch?q=*'
    SourceImage:
    - '*https://www.skymem.info/srch?q=*'
    TargetImage:
    - '*https://www.skymem.info/srch?q=*'
    CallTrace:
    - '*https://www.skymem.info/srch?q=*'
    TargetObject:
    - '*https://www.skymem.info/srch?q=*'
    Details:
    - '*https://www.skymem.info/srch?q=*'
    PipeName:
    - '*https://www.skymem.info/srch?q=*'
    Consumer:
    - '*https://www.skymem.info/srch?q=*'
    Destination:
    - '*https://www.skymem.info/srch?q=*'
    Name:
    - '*https://www.skymem.info/srch?q=*'
    Query:
    - '*https://www.skymem.info/srch?q=*'
    NewName:
    - '*https://www.skymem.info/srch?q=*'
    StartAddress:
    - '*https://www.skymem.info/srch?q=*'
    StartModule:
    - '*https://www.skymem.info/srch?q=*'
    StartFunction:
    - '*https://www.skymem.info/srch?q=*'
    SourceHostname:
    - '*https://www.skymem.info/srch?q=*'
    Device:
    - '*https://www.skymem.info/srch?q=*'
    file_name:
    - '*https://www.skymem.info/srch?q=*'
    file_path:
    - '*https://www.skymem.info/srch?q=*'
    process:
    - '*https://www.skymem.info/srch?q=*'
    original_file_name:
    - '*https://www.skymem.info/srch?q=*'
    parent_process:
    - '*https://www.skymem.info/srch?q=*'
    process_path:
    - '*https://www.skymem.info/srch?q=*'
    service_path:
    - '*https://www.skymem.info/srch?q=*'
    registry_path:
    - '*https://www.skymem.info/srch?q=*'
    registry_value_data:
    - '*https://www.skymem.info/srch?q=*'
    registry_value_name:
    - '*https://www.skymem.info/srch?q=*'
    ContextInfo:
    - '*https://www.skymem.info/srch?q=*'
    Payload:
    - '*https://www.skymem.info/srch?q=*'
    ScriptBlockText:
    - '*https://www.skymem.info/srch?q=*'
    ServerName:
    - '*https://www.skymem.info/srch?q=*'
    TransportName:
    - '*https://www.skymem.info/srch?q=*'
    NewProcessName:
    - '*https://www.skymem.info/srch?q=*'
    ParentProcessName:
    - '*https://www.skymem.info/srch?q=*'
    Application:
    - '*https://www.skymem.info/srch?q=*'
    Product Name:
    - '*https://www.skymem.info/srch?q=*'
    Threat Name:
    - '*https://www.skymem.info/srch?q=*'
    Process Name:
    - '*https://www.skymem.info/srch?q=*'
    Path:
    - '*https://www.skymem.info/srch?q=*'
    ImagePath:
    - '*https://www.skymem.info/srch?q=*'
    ServiceName:
    - '*https://www.skymem.info/srch?q=*'
    ProcessPath:
    - '*https://www.skymem.info/srch?q=*'
    AppName:
    - '*https://www.skymem.info/srch?q=*'
    AppPath:
    - '*https://www.skymem.info/srch?q=*'
    ModulePath:
    - '*https://www.skymem.info/srch?q=*'
    registry.data.strings:
    - '*https://www.skymem.info/srch?q=*'
    registry.path:
    - '*https://www.skymem.info/srch?q=*'
    registry.value:
    - '*https://www.skymem.info/srch?q=*'
    process.args:
    - '*https://www.skymem.info/srch?q=*'
    process.command_line:
    - '*https://www.skymem.info/srch?q=*'
    process.env_vars:
    - '*https://www.skymem.info/srch?q=*'
    process.io.text:
    - '*https://www.skymem.info/srch?q=*'
    process.executable:
    - '*https://www.skymem.info/srch?q=*'
    process.name:
    - '*https://www.skymem.info/srch?q=*'
    process.title:
    - '*https://www.skymem.info/srch?q=*'
    pe.company:
    - '*https://www.skymem.info/srch?q=*'
    pe.description:
    - '*https://www.skymem.info/srch?q=*'
    pe.original_file_name:
    - '*https://www.skymem.info/srch?q=*'
    pe.product:
    - '*https://www.skymem.info/srch?q=*'
    os.full:
    - '*https://www.skymem.info/srch?q=*'
    host.hostname:
    - '*https://www.skymem.info/srch?q=*'
    file.fork_name:
    - '*https://www.skymem.info/srch?q=*'
    file.name:
    - '*https://www.skymem.info/srch?q=*'
    file.path:
    - '*https://www.skymem.info/srch?q=*'
    file.target_path:
    - '*https://www.skymem.info/srch?q=*'
    email.attachments.file.name:
    - '*https://www.skymem.info/srch?q=*'
    email.subject:
    - '*https://www.skymem.info/srch?q=*'
    dll.path:
    - '*https://www.skymem.info/srch?q=*'
    device.model.name:
    - '*https://www.skymem.info/srch?q=*'
    container.image.name:
    - '*https://www.skymem.info/srch?q=*'
    container.name:
    - '*https://www.skymem.info/srch?q=*'
    object:
    - '*https://www.skymem.info/srch?q=*'
    url:
    - '*https://www.skymem.info/srch?q=*'
    dest_url:
    - '*https://www.skymem.info/srch?q=*'
    uri:
    - '*https://www.skymem.info/srch?q=*'
    uri_query:
    - '*https://www.skymem.info/srch?q=*'
    query:
    - '*https://www.skymem.info/srch?q=*'
    url_domain:
    - '*https://www.skymem.info/srch?q=*'
    uri_path:
    - '*https://www.skymem.info/srch?q=*'
    domain:
    - '*https://www.skymem.info/srch?q=*'
    QueryName:
    - '*https://www.skymem.info/srch?q=*'
    QueryResults:
    - '*https://www.skymem.info/srch?q=*'
    DestinationHostname:
    - '*https://www.skymem.info/srch?q=*'
    DestinationIp:
    - '*https://www.skymem.info/srch?q=*'
    http_referrer:
    - '*https://www.skymem.info/srch?q=*'
    http_referrer_domain:
    - '*https://www.skymem.info/srch?q=*'
    http_user_agent:
    - '*https://www.skymem.info/srch?q=*'
    dest_nt_host:
    - '*https://www.skymem.info/srch?q=*'
    sender:
    - '*https://www.skymem.info/srch?q=*'
    recipient:
    - '*https://www.skymem.info/srch?q=*'
    orig_recipient:
    - '*https://www.skymem.info/srch?q=*'
    subject:
    - '*https://www.skymem.info/srch?q=*'
    url.domain:
    - '*https://www.skymem.info/srch?q=*'
    url.full:
    - '*https://www.skymem.info/srch?q=*'
    url.original:
    - '*https://www.skymem.info/srch?q=*'
    url.query:
    - '*https://www.skymem.info/srch?q=*'
    user_agent.original:
    - '*https://www.skymem.info/srch?q=*'
    network.application:
    - '*https://www.skymem.info/srch?q=*'
    http.request.body.content:
    - '*https://www.skymem.info/srch?q=*'
    http.request.referrer:
    - '*https://www.skymem.info/srch?q=*'
    email.from.address:
    - '*https://www.skymem.info/srch?q=*'
    dns.question.name:
    - '*https://www.skymem.info/srch?q=*'
    destination.domain:
    - '*https://www.skymem.info/srch?q=*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
