title: Simple keyword detection rule for afrog
id: 3770c668-3b9b-498a-8c90-2c004e108b40
status: experimental
description:
- '''A tool for finding vulnerabilities'''
references:
- https://github.com/zan8in/afrog
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/13
tags:
- attack.N/A
- attack.T1550 T1555 T1212 T1558
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*/afrog-pocs/*'
    - afrog -*
    OriginalFileName:
    - '*/afrog-pocs/*'
    - afrog -*
    CurrentDirectory:
    - '*/afrog-pocs/*'
    - afrog -*
    ParentImage:
    - '*/afrog-pocs/*'
    - afrog -*
    ParentCommandLine:
    - '*/afrog-pocs/*'
    - afrog -*
    TargetFilename:
    - '*/afrog-pocs/*'
    - afrog -*
    Signature:
    - '*/afrog-pocs/*'
    - afrog -*
    signature:
    - '*/afrog-pocs/*'
    - afrog -*
    ImageLoaded:
    - '*/afrog-pocs/*'
    - afrog -*
    Company:
    - '*/afrog-pocs/*'
    - afrog -*
    Description:
    - '*/afrog-pocs/*'
    - afrog -*
    description:
    - '*/afrog-pocs/*'
    - afrog -*
    CommandLine:
    - '*/afrog-pocs/*'
    - afrog -*
    SourceImage:
    - '*/afrog-pocs/*'
    - afrog -*
    TargetImage:
    - '*/afrog-pocs/*'
    - afrog -*
    CallTrace:
    - '*/afrog-pocs/*'
    - afrog -*
    TargetObject:
    - '*/afrog-pocs/*'
    - afrog -*
    Details:
    - '*/afrog-pocs/*'
    - afrog -*
    PipeName:
    - '*/afrog-pocs/*'
    - afrog -*
    Consumer:
    - '*/afrog-pocs/*'
    - afrog -*
    Destination:
    - '*/afrog-pocs/*'
    - afrog -*
    Name:
    - '*/afrog-pocs/*'
    - afrog -*
    Query:
    - '*/afrog-pocs/*'
    - afrog -*
    NewName:
    - '*/afrog-pocs/*'
    - afrog -*
    StartAddress:
    - '*/afrog-pocs/*'
    - afrog -*
    StartModule:
    - '*/afrog-pocs/*'
    - afrog -*
    StartFunction:
    - '*/afrog-pocs/*'
    - afrog -*
    SourceHostname:
    - '*/afrog-pocs/*'
    - afrog -*
    Device:
    - '*/afrog-pocs/*'
    - afrog -*
    file_name:
    - '*/afrog-pocs/*'
    - afrog -*
    file_path:
    - '*/afrog-pocs/*'
    - afrog -*
    process:
    - '*/afrog-pocs/*'
    - afrog -*
    original_file_name:
    - '*/afrog-pocs/*'
    - afrog -*
    parent_process:
    - '*/afrog-pocs/*'
    - afrog -*
    process_path:
    - '*/afrog-pocs/*'
    - afrog -*
    service_path:
    - '*/afrog-pocs/*'
    - afrog -*
    registry_path:
    - '*/afrog-pocs/*'
    - afrog -*
    registry_value_data:
    - '*/afrog-pocs/*'
    - afrog -*
    registry_value_name:
    - '*/afrog-pocs/*'
    - afrog -*
    ContextInfo:
    - '*/afrog-pocs/*'
    - afrog -*
    Payload:
    - '*/afrog-pocs/*'
    - afrog -*
    ScriptBlockText:
    - '*/afrog-pocs/*'
    - afrog -*
    ServerName:
    - '*/afrog-pocs/*'
    - afrog -*
    TransportName:
    - '*/afrog-pocs/*'
    - afrog -*
    NewProcessName:
    - '*/afrog-pocs/*'
    - afrog -*
    ParentProcessName:
    - '*/afrog-pocs/*'
    - afrog -*
    Application:
    - '*/afrog-pocs/*'
    - afrog -*
    Product Name:
    - '*/afrog-pocs/*'
    - afrog -*
    Threat Name:
    - '*/afrog-pocs/*'
    - afrog -*
    Process Name:
    - '*/afrog-pocs/*'
    - afrog -*
    Path:
    - '*/afrog-pocs/*'
    - afrog -*
    ImagePath:
    - '*/afrog-pocs/*'
    - afrog -*
    ServiceName:
    - '*/afrog-pocs/*'
    - afrog -*
    ProcessPath:
    - '*/afrog-pocs/*'
    - afrog -*
    AppName:
    - '*/afrog-pocs/*'
    - afrog -*
    AppPath:
    - '*/afrog-pocs/*'
    - afrog -*
    ModulePath:
    - '*/afrog-pocs/*'
    - afrog -*
    registry.data.strings:
    - '*/afrog-pocs/*'
    - afrog -*
    registry.path:
    - '*/afrog-pocs/*'
    - afrog -*
    registry.value:
    - '*/afrog-pocs/*'
    - afrog -*
    process.args:
    - '*/afrog-pocs/*'
    - afrog -*
    process.command_line:
    - '*/afrog-pocs/*'
    - afrog -*
    process.env_vars:
    - '*/afrog-pocs/*'
    - afrog -*
    process.io.text:
    - '*/afrog-pocs/*'
    - afrog -*
    process.executable:
    - '*/afrog-pocs/*'
    - afrog -*
    process.name:
    - '*/afrog-pocs/*'
    - afrog -*
    process.title:
    - '*/afrog-pocs/*'
    - afrog -*
    pe.company:
    - '*/afrog-pocs/*'
    - afrog -*
    pe.description:
    - '*/afrog-pocs/*'
    - afrog -*
    pe.original_file_name:
    - '*/afrog-pocs/*'
    - afrog -*
    pe.product:
    - '*/afrog-pocs/*'
    - afrog -*
    os.full:
    - '*/afrog-pocs/*'
    - afrog -*
    host.hostname:
    - '*/afrog-pocs/*'
    - afrog -*
    file.fork_name:
    - '*/afrog-pocs/*'
    - afrog -*
    file.name:
    - '*/afrog-pocs/*'
    - afrog -*
    file.path:
    - '*/afrog-pocs/*'
    - afrog -*
    file.target_path:
    - '*/afrog-pocs/*'
    - afrog -*
    email.attachments.file.name:
    - '*/afrog-pocs/*'
    - afrog -*
    email.subject:
    - '*/afrog-pocs/*'
    - afrog -*
    dll.path:
    - '*/afrog-pocs/*'
    - afrog -*
    device.model.name:
    - '*/afrog-pocs/*'
    - afrog -*
    container.image.name:
    - '*/afrog-pocs/*'
    - afrog -*
    container.name:
    - '*/afrog-pocs/*'
    - afrog -*
    object:
    - '*/afrog-pocs/*'
    - afrog -*
    url:
    - '*/afrog-pocs/*'
    dest_url:
    - '*/afrog-pocs/*'
    uri:
    - '*/afrog-pocs/*'
    uri_query:
    - '*/afrog-pocs/*'
    query:
    - '*/afrog-pocs/*'
    url_domain:
    - '*/afrog-pocs/*'
    uri_path:
    - '*/afrog-pocs/*'
    domain:
    - '*/afrog-pocs/*'
    QueryName:
    - '*/afrog-pocs/*'
    QueryResults:
    - '*/afrog-pocs/*'
    DestinationHostname:
    - '*/afrog-pocs/*'
    DestinationIp:
    - '*/afrog-pocs/*'
    http_referrer:
    - '*/afrog-pocs/*'
    http_referrer_domain:
    - '*/afrog-pocs/*'
    http_user_agent:
    - '*/afrog-pocs/*'
    dest_nt_host:
    - '*/afrog-pocs/*'
    sender:
    - '*/afrog-pocs/*'
    recipient:
    - '*/afrog-pocs/*'
    orig_recipient:
    - '*/afrog-pocs/*'
    subject:
    - '*/afrog-pocs/*'
    url.domain:
    - '*/afrog-pocs/*'
    url.full:
    - '*/afrog-pocs/*'
    url.original:
    - '*/afrog-pocs/*'
    url.query:
    - '*/afrog-pocs/*'
    user_agent.original:
    - '*/afrog-pocs/*'
    network.application:
    - '*/afrog-pocs/*'
    http.request.body.content:
    - '*/afrog-pocs/*'
    http.request.referrer:
    - '*/afrog-pocs/*'
    email.from.address:
    - '*/afrog-pocs/*'
    dns.question.name:
    - '*/afrog-pocs/*'
    destination.domain:
    - '*/afrog-pocs/*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
