title: Simple keyword detection rule for crunch
id: 31c27cfa-8df8-48ea-9669-72456baff263
status: experimental
description:
- '''Generate a dictionary file containing words with a minimum and maximum length'''
references:
- https://sourceforge.net/projects/crunch-wordlist/
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/13
tags:
- attack.T1596
- attack.T1596.001
- attack.TA0043
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    CommandLine:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    Details:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    registry.value:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    process.args:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    process.command_line:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    process.env_vars:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    process.io.text:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    process.title:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    pe.company:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    pe.description:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    pe.product:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    os.full:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    host.hostname:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    event.original:
    - '*crunch * -o *.txt*'
    - '*apt install crunch*'
    email.subject:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    device.model.name:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    container.image.name:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    container.name:
    - '*crunch * -o *.txt*'
    - '*/crunch-wordlist/*'
    - '*apt install crunch*'
    Image:
    - '*/crunch-wordlist/*'
    OriginalFileName:
    - '*/crunch-wordlist/*'
    CurrentDirectory:
    - '*/crunch-wordlist/*'
    ParentImage:
    - '*/crunch-wordlist/*'
    TargetFilename:
    - '*/crunch-wordlist/*'
    Signature:
    - '*/crunch-wordlist/*'
    signature:
    - '*/crunch-wordlist/*'
    ImageLoaded:
    - '*/crunch-wordlist/*'
    Company:
    - '*/crunch-wordlist/*'
    Description:
    - '*/crunch-wordlist/*'
    description:
    - '*/crunch-wordlist/*'
    SourceImage:
    - '*/crunch-wordlist/*'
    TargetImage:
    - '*/crunch-wordlist/*'
    CallTrace:
    - '*/crunch-wordlist/*'
    TargetObject:
    - '*/crunch-wordlist/*'
    PipeName:
    - '*/crunch-wordlist/*'
    Consumer:
    - '*/crunch-wordlist/*'
    Destination:
    - '*/crunch-wordlist/*'
    Name:
    - '*/crunch-wordlist/*'
    Query:
    - '*/crunch-wordlist/*'
    NewName:
    - '*/crunch-wordlist/*'
    StartAddress:
    - '*/crunch-wordlist/*'
    StartModule:
    - '*/crunch-wordlist/*'
    StartFunction:
    - '*/crunch-wordlist/*'
    SourceHostname:
    - '*/crunch-wordlist/*'
    Device:
    - '*/crunch-wordlist/*'
    file_name:
    - '*/crunch-wordlist/*'
    file_path:
    - '*/crunch-wordlist/*'
    process:
    - '*/crunch-wordlist/*'
    original_file_name:
    - '*/crunch-wordlist/*'
    parent_process:
    - '*/crunch-wordlist/*'
    process_path:
    - '*/crunch-wordlist/*'
    service_path:
    - '*/crunch-wordlist/*'
    registry_path:
    - '*/crunch-wordlist/*'
    registry_value_data:
    - '*/crunch-wordlist/*'
    registry_value_name:
    - '*/crunch-wordlist/*'
    ContextInfo:
    - '*/crunch-wordlist/*'
    Payload:
    - '*/crunch-wordlist/*'
    ScriptBlockText:
    - '*/crunch-wordlist/*'
    ServerName:
    - '*/crunch-wordlist/*'
    TransportName:
    - '*/crunch-wordlist/*'
    NewProcessName:
    - '*/crunch-wordlist/*'
    ParentProcessName:
    - '*/crunch-wordlist/*'
    Application:
    - '*/crunch-wordlist/*'
    Product Name:
    - '*/crunch-wordlist/*'
    Threat Name:
    - '*/crunch-wordlist/*'
    Process Name:
    - '*/crunch-wordlist/*'
    Path:
    - '*/crunch-wordlist/*'
    ImagePath:
    - '*/crunch-wordlist/*'
    ServiceName:
    - '*/crunch-wordlist/*'
    ProcessPath:
    - '*/crunch-wordlist/*'
    AppName:
    - '*/crunch-wordlist/*'
    AppPath:
    - '*/crunch-wordlist/*'
    ModulePath:
    - '*/crunch-wordlist/*'
    registry.data.strings:
    - '*/crunch-wordlist/*'
    registry.path:
    - '*/crunch-wordlist/*'
    process.executable:
    - '*/crunch-wordlist/*'
    process.name:
    - '*/crunch-wordlist/*'
    pe.original_file_name:
    - '*/crunch-wordlist/*'
    file.fork_name:
    - '*/crunch-wordlist/*'
    file.name:
    - '*/crunch-wordlist/*'
    file.path:
    - '*/crunch-wordlist/*'
    file.target_path:
    - '*/crunch-wordlist/*'
    email.attachments.file.name:
    - '*/crunch-wordlist/*'
    dll.path:
    - '*/crunch-wordlist/*'
    object:
    - '*/crunch-wordlist/*'
    url:
    - '*/crunch-wordlist/*'
    dest_url:
    - '*/crunch-wordlist/*'
    uri:
    - '*/crunch-wordlist/*'
    uri_query:
    - '*/crunch-wordlist/*'
    query:
    - '*/crunch-wordlist/*'
    url_domain:
    - '*/crunch-wordlist/*'
    uri_path:
    - '*/crunch-wordlist/*'
    domain:
    - '*/crunch-wordlist/*'
    QueryName:
    - '*/crunch-wordlist/*'
    QueryResults:
    - '*/crunch-wordlist/*'
    DestinationHostname:
    - '*/crunch-wordlist/*'
    DestinationIp:
    - '*/crunch-wordlist/*'
    http_referrer:
    - '*/crunch-wordlist/*'
    http_referrer_domain:
    - '*/crunch-wordlist/*'
    http_user_agent:
    - '*/crunch-wordlist/*'
    dest_nt_host:
    - '*/crunch-wordlist/*'
    sender:
    - '*/crunch-wordlist/*'
    recipient:
    - '*/crunch-wordlist/*'
    orig_recipient:
    - '*/crunch-wordlist/*'
    subject:
    - '*/crunch-wordlist/*'
    url.domain:
    - '*/crunch-wordlist/*'
    url.full:
    - '*/crunch-wordlist/*'
    url.original:
    - '*/crunch-wordlist/*'
    url.query:
    - '*/crunch-wordlist/*'
    user_agent.original:
    - '*/crunch-wordlist/*'
    network.application:
    - '*/crunch-wordlist/*'
    http.request.body.content:
    - '*/crunch-wordlist/*'
    http.request.referrer:
    - '*/crunch-wordlist/*'
    email.from.address:
    - '*/crunch-wordlist/*'
    dns.question.name:
    - '*/crunch-wordlist/*'
    destination.domain:
    - '*/crunch-wordlist/*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
