title: Simple keyword detection rule for locate
id: e45d8368-d6d6-4eb3-b145-dc30bb0f0c9d
status: experimental
description:
- '''Find sensitive files'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/02
tags:
- attack.T1005
- attack.T1083
- attack.T1213.002
- attack.TA0007
- attack.TA0010
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*locate password | more*'
    CommandLine:
    - '*locate password | more*'
    Details:
    - '*locate password | more*'
    registry.value:
    - '*locate password | more*'
    process.args:
    - '*locate password | more*'
    process.command_line:
    - '*locate password | more*'
    process.env_vars:
    - '*locate password | more*'
    process.io.text:
    - '*locate password | more*'
    process.title:
    - '*locate password | more*'
    pe.company:
    - '*locate password | more*'
    pe.description:
    - '*locate password | more*'
    pe.product:
    - '*locate password | more*'
    os.full:
    - '*locate password | more*'
    host.hostname:
    - '*locate password | more*'
    event.original:
    - '*locate password | more*'
    email.subject:
    - '*locate password | more*'
    device.model.name:
    - '*locate password | more*'
    container.image.name:
    - '*locate password | more*'
    container.name:
    - '*locate password | more*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
