title: Simple keyword detection rule for sniffglue
id: d104cae1-bcaf-43bc-92aa-6bf3814c9db8
status: experimental
description:
- '''Secure multithreaded packet sniffer'''
references:
- https://github.com/kpcyrd/sniffglue
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/03
tags:
- attack.T1040
- attack.T1041
- attack.T1046
- attack.T1057
- attack.T1071.001
- attack.TA0009
- attack.TA0011
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*sniffglue*'
    OriginalFileName:
    - '*sniffglue*'
    CurrentDirectory:
    - '*sniffglue*'
    ParentImage:
    - '*sniffglue*'
    ParentCommandLine:
    - '*sniffglue*'
    TargetFilename:
    - '*sniffglue*'
    Signature:
    - '*sniffglue*'
    signature:
    - '*sniffglue*'
    ImageLoaded:
    - '*sniffglue*'
    Company:
    - '*sniffglue*'
    Description:
    - '*sniffglue*'
    description:
    - '*sniffglue*'
    CommandLine:
    - '*sniffglue*'
    SourceImage:
    - '*sniffglue*'
    TargetImage:
    - '*sniffglue*'
    CallTrace:
    - '*sniffglue*'
    TargetObject:
    - '*sniffglue*'
    Details:
    - '*sniffglue*'
    PipeName:
    - '*sniffglue*'
    Consumer:
    - '*sniffglue*'
    Destination:
    - '*sniffglue*'
    Name:
    - '*sniffglue*'
    Query:
    - '*sniffglue*'
    NewName:
    - '*sniffglue*'
    StartAddress:
    - '*sniffglue*'
    StartModule:
    - '*sniffglue*'
    StartFunction:
    - '*sniffglue*'
    SourceHostname:
    - '*sniffglue*'
    Device:
    - '*sniffglue*'
    file_name:
    - '*sniffglue*'
    file_path:
    - '*sniffglue*'
    process:
    - '*sniffglue*'
    original_file_name:
    - '*sniffglue*'
    parent_process:
    - '*sniffglue*'
    process_path:
    - '*sniffglue*'
    service_path:
    - '*sniffglue*'
    registry_path:
    - '*sniffglue*'
    registry_value_data:
    - '*sniffglue*'
    registry_value_name:
    - '*sniffglue*'
    ContextInfo:
    - '*sniffglue*'
    Payload:
    - '*sniffglue*'
    ScriptBlockText:
    - '*sniffglue*'
    ServerName:
    - '*sniffglue*'
    TransportName:
    - '*sniffglue*'
    NewProcessName:
    - '*sniffglue*'
    ParentProcessName:
    - '*sniffglue*'
    Application:
    - '*sniffglue*'
    Product Name:
    - '*sniffglue*'
    Threat Name:
    - '*sniffglue*'
    Process Name:
    - '*sniffglue*'
    Path:
    - '*sniffglue*'
    ImagePath:
    - '*sniffglue*'
    ServiceName:
    - '*sniffglue*'
    ProcessPath:
    - '*sniffglue*'
    AppName:
    - '*sniffglue*'
    AppPath:
    - '*sniffglue*'
    ModulePath:
    - '*sniffglue*'
    registry.data.strings:
    - '*sniffglue*'
    registry.path:
    - '*sniffglue*'
    registry.value:
    - '*sniffglue*'
    process.args:
    - '*sniffglue*'
    process.command_line:
    - '*sniffglue*'
    process.env_vars:
    - '*sniffglue*'
    process.io.text:
    - '*sniffglue*'
    process.executable:
    - '*sniffglue*'
    process.name:
    - '*sniffglue*'
    process.title:
    - '*sniffglue*'
    pe.company:
    - '*sniffglue*'
    pe.description:
    - '*sniffglue*'
    pe.original_file_name:
    - '*sniffglue*'
    pe.product:
    - '*sniffglue*'
    os.full:
    - '*sniffglue*'
    host.hostname:
    - '*sniffglue*'
    file.fork_name:
    - '*sniffglue*'
    file.name:
    - '*sniffglue*'
    file.path:
    - '*sniffglue*'
    file.target_path:
    - '*sniffglue*'
    email.attachments.file.name:
    - '*sniffglue*'
    email.subject:
    - '*sniffglue*'
    dll.path:
    - '*sniffglue*'
    device.model.name:
    - '*sniffglue*'
    container.image.name:
    - '*sniffglue*'
    container.name:
    - '*sniffglue*'
    object:
    - '*sniffglue*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
