title: Simple keyword detection rule for http.server
id: fc8b10e1-a093-4c96-943b-433bcf94f204
status: experimental
description:
- '''setup a simple http server'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/09
tags:
- attack.T1021.005
- attack.T1049
- attack.TA0002
- attack.TA0009
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- medium
detection:
  selection:
    ParentCommandLine:
    - '*python -m http.server*'
    CommandLine:
    - '*python -m http.server*'
    Details:
    - '*python -m http.server*'
    registry.value:
    - '*python -m http.server*'
    process.args:
    - '*python -m http.server*'
    process.command_line:
    - '*python -m http.server*'
    process.env_vars:
    - '*python -m http.server*'
    process.io.text:
    - '*python -m http.server*'
    process.title:
    - '*python -m http.server*'
    pe.company:
    - '*python -m http.server*'
    pe.description:
    - '*python -m http.server*'
    pe.product:
    - '*python -m http.server*'
    os.full:
    - '*python -m http.server*'
    host.hostname:
    - '*python -m http.server*'
    event.original:
    - '*python -m http.server*'
    email.subject:
    - '*python -m http.server*'
    device.model.name:
    - '*python -m http.server*'
    container.image.name:
    - '*python -m http.server*'
    container.name:
    - '*python -m http.server*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
