title: Simple keyword detection rule for Hak5 Cloud C2
id: 4d69b3da-8280-4790-a305-248824dcac78
status: experimental
description: Detects interesting keywords based on Hak5 Cloud C2 tool
references:
- https://shop.hak5.org/products/c2
author: '@mthcht'
date: 2023/07/30
modified: 2024/03/24
tags:
- attack.T1071.001
- attack.TA0011
logsource:
  category:
  - endpoint
  - network
detection:
  selection:
  - ParentCommandLine:
    - '*Hak5 Cloud C?*'
  - CommandLine:
    - '*Hak5 Cloud C?*'
  - Details:
    - '*Hak5 Cloud C?*'
  - registry.value:
    - '*Hak5 Cloud C?*'
  - process.args:
    - '*Hak5 Cloud C?*'
  - process.command_line:
    - '*Hak5 Cloud C?*'
  - process.env_vars:
    - '*Hak5 Cloud C?*'
  - process.io.text:
    - '*Hak5 Cloud C?*'
  - process.title:
    - '*Hak5 Cloud C?*'
  - pe.company:
    - '*Hak5 Cloud C?*'
  - pe.description:
    - '*Hak5 Cloud C?*'
  - pe.product:
    - '*Hak5 Cloud C?*'
  - os.full:
    - '*Hak5 Cloud C?*'
  - host.hostname:
    - '*Hak5 Cloud C?*'
  - event.original:
    - '*Hak5 Cloud C?*'
  - email.subject:
    - '*Hak5 Cloud C?*'
  - device.model.name:
    - '*Hak5 Cloud C?*'
  - container.image.name:
    - '*Hak5 Cloud C?*'
  - container.name:
    - '*Hak5 Cloud C?*'
  - url:
    - '*Hak5 Cloud C?*'
  - dest_url:
    - '*Hak5 Cloud C?*'
  - uri:
    - '*Hak5 Cloud C?*'
  - uri_query:
    - '*Hak5 Cloud C?*'
  - query:
    - '*Hak5 Cloud C?*'
  - url_domain:
    - '*Hak5 Cloud C?*'
  - uri_path:
    - '*Hak5 Cloud C?*'
  - domain:
    - '*Hak5 Cloud C?*'
  - QueryName:
    - '*Hak5 Cloud C?*'
  - QueryResults:
    - '*Hak5 Cloud C?*'
  - DestinationHostname:
    - '*Hak5 Cloud C?*'
  - DestinationIp:
    - '*Hak5 Cloud C?*'
  - http_referrer:
    - '*Hak5 Cloud C?*'
  - http_referrer_domain:
    - '*Hak5 Cloud C?*'
  - http_user_agent:
    - '*Hak5 Cloud C?*'
  - dest_nt_host:
    - '*Hak5 Cloud C?*'
  - sender:
    - '*Hak5 Cloud C?*'
  - recipient:
    - '*Hak5 Cloud C?*'
  - orig_recipient:
    - '*Hak5 Cloud C?*'
  - subject:
    - '*Hak5 Cloud C?*'
  - url.domain:
    - '*Hak5 Cloud C?*'
  - url.full:
    - '*Hak5 Cloud C?*'
  - url.original:
    - '*Hak5 Cloud C?*'
  - url.query:
    - '*Hak5 Cloud C?*'
  - user_agent.original:
    - '*Hak5 Cloud C?*'
  - network.application:
    - '*Hak5 Cloud C?*'
  - http.request.body.content:
    - '*Hak5 Cloud C?*'
  - http.request.referrer:
    - '*Hak5 Cloud C?*'
  - email.from.address:
    - '*Hak5 Cloud C?*'
  - dns.question.name:
    - '*Hak5 Cloud C?*'
  - destination.domain:
    - '*Hak5 Cloud C?*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
