title: Simple keyword detection rule for ren
id: 22586563-5e8b-431c-88e8-29d89c5d6207
status: experimental
description:
- '''Spartacus DLL/COM Hijacking Toolkit'''
references:
- https://www.pavel.gr/blog/neutralising-amsi-system-wide-as-an-admin
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/19
tags:
- attack.T1027.002
- attack.T1055.001
- attack.T1574.001
- attack.TA0005
- attack.TA0040
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- high
detection:
  selection:
    ParentCommandLine:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    CommandLine:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    Details:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    registry.value:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    process.args:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    process.command_line:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    process.env_vars:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    process.io.text:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    process.title:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    pe.company:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    pe.description:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    pe.product:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    os.full:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    host.hostname:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    event.original:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    email.subject:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    device.model.name:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    container.image.name:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
    container.name:
    - '*ren C:\Windows\System32\amsi.dll *.dll'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
