title: Simple keyword detection rule for xcopy
id: 63f6ec9a-d30e-47f4-84e9-87935882bbe2
status: experimental
description: Detects interesting keywords based on xcopy tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2024/05/08
tags:
- attack.T1012
- attack.T1027
- attack.T1035
- attack.T1036
- attack.T1041
- attack.T1053.005
- attack.T1057
- attack.T1059.003
- attack.T1070.001
- attack.T1083
- attack.T1105
- attack.T1112
- attack.T1136
- attack.T1562.001
- attack.T1564.001
- attack.T1564.002
- attack.T1564.003
- attack.T1564.005
- attack.TA0002
- attack.TA0003
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0010
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*xcopy c:\* \\*\c$*'
  - CommandLine:
    - '*xcopy c:\* \\*\c$*'
  - Details:
    - '*xcopy c:\* \\*\c$*'
  - registry.value:
    - '*xcopy c:\* \\*\c$*'
  - process.args:
    - '*xcopy c:\* \\*\c$*'
  - process.command_line:
    - '*xcopy c:\* \\*\c$*'
  - process.env_vars:
    - '*xcopy c:\* \\*\c$*'
  - process.io.text:
    - '*xcopy c:\* \\*\c$*'
  - process.title:
    - '*xcopy c:\* \\*\c$*'
  - pe.company:
    - '*xcopy c:\* \\*\c$*'
  - pe.description:
    - '*xcopy c:\* \\*\c$*'
  - pe.product:
    - '*xcopy c:\* \\*\c$*'
  - os.full:
    - '*xcopy c:\* \\*\c$*'
  - host.hostname:
    - '*xcopy c:\* \\*\c$*'
  - event.original:
    - '*xcopy c:\* \\*\c$*'
  - email.subject:
    - '*xcopy c:\* \\*\c$*'
  - device.model.name:
    - '*xcopy c:\* \\*\c$*'
  - container.image.name:
    - '*xcopy c:\* \\*\c$*'
  - container.name:
    - '*xcopy c:\* \\*\c$*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
