title: Simple keyword detection rule for NetworkMiner
id: b0e3249e-1fd8-4a83-8993-cc2943b1651d
status: experimental
description:
- '''A Network Forensic Analysis Tool (NFAT)'''
references:
- http://www.netresec.com/?page=NetworkMiner
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/02
tags:
- attack.T1040
- attack.T1043
- attack.T1052
- attack.T1065
- attack.T1096
- attack.T1102
- attack.T1113
- attack.T1114
- attack.T1123
- attack.T1127
- attack.T1136
- attack.T1143
- attack.T1190
- attack.T1200
- attack.T1201
- attack.T1219
- attack.T1222
- attack.T1496
- attack.T1497
- attack.T1557
- attack.T1560
- attack.T1573
- attack.T1574
- attack.T1608
- attack.TA0001
- attack.TA0002
- attack.TA0003
- attack.TA0007
- attack.TA0011
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*NetworkMiner*'
    OriginalFileName:
    - '*NetworkMiner*'
    CurrentDirectory:
    - '*NetworkMiner*'
    ParentImage:
    - '*NetworkMiner*'
    ParentCommandLine:
    - '*NetworkMiner*'
    TargetFilename:
    - '*NetworkMiner*'
    Signature:
    - '*NetworkMiner*'
    signature:
    - '*NetworkMiner*'
    ImageLoaded:
    - '*NetworkMiner*'
    Company:
    - '*NetworkMiner*'
    Description:
    - '*NetworkMiner*'
    description:
    - '*NetworkMiner*'
    CommandLine:
    - '*NetworkMiner*'
    SourceImage:
    - '*NetworkMiner*'
    TargetImage:
    - '*NetworkMiner*'
    CallTrace:
    - '*NetworkMiner*'
    TargetObject:
    - '*NetworkMiner*'
    Details:
    - '*NetworkMiner*'
    PipeName:
    - '*NetworkMiner*'
    Consumer:
    - '*NetworkMiner*'
    Destination:
    - '*NetworkMiner*'
    Name:
    - '*NetworkMiner*'
    Query:
    - '*NetworkMiner*'
    NewName:
    - '*NetworkMiner*'
    StartAddress:
    - '*NetworkMiner*'
    StartModule:
    - '*NetworkMiner*'
    StartFunction:
    - '*NetworkMiner*'
    SourceHostname:
    - '*NetworkMiner*'
    Device:
    - '*NetworkMiner*'
    file_name:
    - '*NetworkMiner*'
    file_path:
    - '*NetworkMiner*'
    process:
    - '*NetworkMiner*'
    original_file_name:
    - '*NetworkMiner*'
    parent_process:
    - '*NetworkMiner*'
    process_path:
    - '*NetworkMiner*'
    service_path:
    - '*NetworkMiner*'
    registry_path:
    - '*NetworkMiner*'
    registry_value_data:
    - '*NetworkMiner*'
    registry_value_name:
    - '*NetworkMiner*'
    ContextInfo:
    - '*NetworkMiner*'
    Payload:
    - '*NetworkMiner*'
    ScriptBlockText:
    - '*NetworkMiner*'
    ServerName:
    - '*NetworkMiner*'
    TransportName:
    - '*NetworkMiner*'
    NewProcessName:
    - '*NetworkMiner*'
    ParentProcessName:
    - '*NetworkMiner*'
    Application:
    - '*NetworkMiner*'
    Product Name:
    - '*NetworkMiner*'
    Threat Name:
    - '*NetworkMiner*'
    Process Name:
    - '*NetworkMiner*'
    Path:
    - '*NetworkMiner*'
    ImagePath:
    - '*NetworkMiner*'
    ServiceName:
    - '*NetworkMiner*'
    ProcessPath:
    - '*NetworkMiner*'
    AppName:
    - '*NetworkMiner*'
    AppPath:
    - '*NetworkMiner*'
    ModulePath:
    - '*NetworkMiner*'
    registry.data.strings:
    - '*NetworkMiner*'
    registry.path:
    - '*NetworkMiner*'
    registry.value:
    - '*NetworkMiner*'
    process.args:
    - '*NetworkMiner*'
    process.command_line:
    - '*NetworkMiner*'
    process.env_vars:
    - '*NetworkMiner*'
    process.io.text:
    - '*NetworkMiner*'
    process.executable:
    - '*NetworkMiner*'
    process.name:
    - '*NetworkMiner*'
    process.title:
    - '*NetworkMiner*'
    pe.company:
    - '*NetworkMiner*'
    pe.description:
    - '*NetworkMiner*'
    pe.original_file_name:
    - '*NetworkMiner*'
    pe.product:
    - '*NetworkMiner*'
    os.full:
    - '*NetworkMiner*'
    host.hostname:
    - '*NetworkMiner*'
    file.fork_name:
    - '*NetworkMiner*'
    file.name:
    - '*NetworkMiner*'
    file.path:
    - '*NetworkMiner*'
    file.target_path:
    - '*NetworkMiner*'
    email.attachments.file.name:
    - '*NetworkMiner*'
    email.subject:
    - '*NetworkMiner*'
    dll.path:
    - '*NetworkMiner*'
    device.model.name:
    - '*NetworkMiner*'
    container.image.name:
    - '*NetworkMiner*'
    container.name:
    - '*NetworkMiner*'
    object:
    - '*NetworkMiner*'
    url:
    - '*NetworkMiner*'
    dest_url:
    - '*NetworkMiner*'
    uri:
    - '*NetworkMiner*'
    uri_query:
    - '*NetworkMiner*'
    query:
    - '*NetworkMiner*'
    url_domain:
    - '*NetworkMiner*'
    uri_path:
    - '*NetworkMiner*'
    domain:
    - '*NetworkMiner*'
    QueryName:
    - '*NetworkMiner*'
    QueryResults:
    - '*NetworkMiner*'
    DestinationHostname:
    - '*NetworkMiner*'
    DestinationIp:
    - '*NetworkMiner*'
    http_referrer:
    - '*NetworkMiner*'
    http_referrer_domain:
    - '*NetworkMiner*'
    http_user_agent:
    - '*NetworkMiner*'
    dest_nt_host:
    - '*NetworkMiner*'
    sender:
    - '*NetworkMiner*'
    recipient:
    - '*NetworkMiner*'
    orig_recipient:
    - '*NetworkMiner*'
    subject:
    - '*NetworkMiner*'
    url.domain:
    - '*NetworkMiner*'
    url.full:
    - '*NetworkMiner*'
    url.original:
    - '*NetworkMiner*'
    url.query:
    - '*NetworkMiner*'
    user_agent.original:
    - '*NetworkMiner*'
    network.application:
    - '*NetworkMiner*'
    http.request.body.content:
    - '*NetworkMiner*'
    http.request.referrer:
    - '*NetworkMiner*'
    email.from.address:
    - '*NetworkMiner*'
    dns.question.name:
    - '*NetworkMiner*'
    destination.domain:
    - '*NetworkMiner*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
