title: Simple keyword detection rule for ldifde
id: bde9a27d-456c-4c62-9675-0bc8725cc678
status: experimental
description:
- '''using ldifde.exe to export data from Active Directory to a .txt file in the Temp
  directory'''
references:
- https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/10
tags:
- attack.T1005
- attack.T1018
- attack.T1077.001
- attack.TA0002
- attack.TA0005
- attack.TA0007
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    CommandLine:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    Details:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    registry.value:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    process.args:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    process.command_line:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    process.env_vars:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    process.io.text:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    process.title:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    pe.company:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    pe.description:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    pe.product:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    os.full:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    host.hostname:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    event.original:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    email.subject:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    device.model.name:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    container.image.name:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
    container.name:
    - '*ldifde.exe -f *\temp\*.txt -p subtree*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
