title: Simple keyword detection rule for Pcredz
id: 2646d56f-2e2c-4f27-9883-b3e98db678a2
status: experimental
description:
- '''This tool extracts Credit card numbers. NTLM(DCE-RPC. HTTP. SQL. LDAP. etc).
  Kerberos (AS-REQ Pre-Auth etype 23). HTTP Basic. SNMP. POP. SMTP. FTP. IMAP. etc
  from a pcap file or from a live interface.'''
references:
- https://github.com/lgandx/Pcredz
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/15
tags:
- attack.T1001
- attack.T1002
- attack.T1003
- attack.T1005
- attack.T1116
- attack.T1552
- attack.TA0002
- attack.TA0003
- attack.TA0011
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    CommandLine:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    Details:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    registry.value:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    process.args:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    process.command_line:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    process.env_vars:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    process.io.text:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    process.title:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    pe.company:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    pe.description:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    pe.product:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    os.full:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    host.hostname:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    event.original:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*Pcredz -d *'
    email.subject:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    device.model.name:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    container.image.name:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    container.name:
    - '*Pcredz -i *'
    - '*Pcredz -f *'
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    - '*Pcredz -d *'
    Image:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    OriginalFileName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    CurrentDirectory:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ParentImage:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    TargetFilename:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Signature:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    signature:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ImageLoaded:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Company:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Description:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    description:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    SourceImage:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    TargetImage:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    CallTrace:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    TargetObject:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    PipeName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Consumer:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Destination:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Query:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    NewName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    StartAddress:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    StartModule:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    StartFunction:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    SourceHostname:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Device:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    file_name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    file_path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    process:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    original_file_name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    parent_process:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    process_path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    service_path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    registry_path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    registry_value_data:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    registry_value_name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ContextInfo:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Payload:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ScriptBlockText:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ServerName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    TransportName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    NewProcessName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ParentProcessName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Application:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Product Name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Threat Name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Process Name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    Path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ImagePath:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ServiceName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ProcessPath:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    AppName:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    AppPath:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    ModulePath:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    registry.data.strings:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    registry.path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    process.executable:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    process.name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    pe.original_file_name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    file.fork_name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    file.name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    file.path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    file.target_path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    email.attachments.file.name:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    dll.path:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    object:
    - '*lgandx/Pcredz*'
    - '*./Pcredz *'
    url:
    - '*lgandx/Pcredz*'
    dest_url:
    - '*lgandx/Pcredz*'
    uri:
    - '*lgandx/Pcredz*'
    uri_query:
    - '*lgandx/Pcredz*'
    query:
    - '*lgandx/Pcredz*'
    url_domain:
    - '*lgandx/Pcredz*'
    uri_path:
    - '*lgandx/Pcredz*'
    domain:
    - '*lgandx/Pcredz*'
    QueryName:
    - '*lgandx/Pcredz*'
    QueryResults:
    - '*lgandx/Pcredz*'
    DestinationHostname:
    - '*lgandx/Pcredz*'
    DestinationIp:
    - '*lgandx/Pcredz*'
    http_referrer:
    - '*lgandx/Pcredz*'
    http_referrer_domain:
    - '*lgandx/Pcredz*'
    http_user_agent:
    - '*lgandx/Pcredz*'
    dest_nt_host:
    - '*lgandx/Pcredz*'
    sender:
    - '*lgandx/Pcredz*'
    recipient:
    - '*lgandx/Pcredz*'
    orig_recipient:
    - '*lgandx/Pcredz*'
    subject:
    - '*lgandx/Pcredz*'
    url.domain:
    - '*lgandx/Pcredz*'
    url.full:
    - '*lgandx/Pcredz*'
    url.original:
    - '*lgandx/Pcredz*'
    url.query:
    - '*lgandx/Pcredz*'
    user_agent.original:
    - '*lgandx/Pcredz*'
    network.application:
    - '*lgandx/Pcredz*'
    http.request.body.content:
    - '*lgandx/Pcredz*'
    http.request.referrer:
    - '*lgandx/Pcredz*'
    email.from.address:
    - '*lgandx/Pcredz*'
    dns.question.name:
    - '*lgandx/Pcredz*'
    destination.domain:
    - '*lgandx/Pcredz*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
