title: Simple keyword detection rule for bitbucket.org
id: bd90e475-3b2c-4d19-b01f-530aa63d1064
status: experimental
description: Detects interesting keywords based on bitbucket.org tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2025/01/29
tags:
- attack.T1102
- attack.T1213
- attack.TA0009
logsource:
  category:
  - network
detection:
  selection:
  - url:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - dest_url:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - uri:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - uri_query:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - query:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - url_domain:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - uri_path:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - domain:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - QueryName:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - QueryResults:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - DestinationHostname:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - DestinationIp:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - http_referrer:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - http_referrer_domain:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - http_user_agent:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - dest_nt_host:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - sender:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - recipient:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - orig_recipient:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - subject:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - url.domain:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - url.full:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - url.original:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - url.query:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - user_agent.original:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - network.application:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - http.request.body.content:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - http.request.referrer:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - email.from.address:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - dns.question.name:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  - destination.domain:
    - '*https://bitbucket.org/*/downloads/*.exe*'
    - '*https://bitbucket.org/*/downloads/*.bat*'
    - '*https://bitbucket.org/*/downloads/*.ps1*'
    - '*https://bitbucket.org/*/downloads/*.dll*'
    - '*https://bitbucket.org/*/downloads/*.rar*'
    - '*https://bitbucket.org/*/downloads/*.zip*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
