title: Simple keyword detection rule for ip
id: 05a93b1f-ea3c-4146-aa2f-74d6387ae3c9
status: experimental
description: Detects interesting keywords based on ip tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/20
tags:
- attack.T1036.004
- attack.T1059.001
- attack.T1497.001
- attack.TA0005
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*ip l set dev * address *:*:*'
  - CommandLine:
    - '*ip l set dev * address *:*:*'
  - Details:
    - '*ip l set dev * address *:*:*'
  - registry.value:
    - '*ip l set dev * address *:*:*'
  - process.args:
    - '*ip l set dev * address *:*:*'
  - process.command_line:
    - '*ip l set dev * address *:*:*'
  - process.env_vars:
    - '*ip l set dev * address *:*:*'
  - process.io.text:
    - '*ip l set dev * address *:*:*'
  - process.title:
    - '*ip l set dev * address *:*:*'
  - pe.company:
    - '*ip l set dev * address *:*:*'
  - pe.description:
    - '*ip l set dev * address *:*:*'
  - pe.product:
    - '*ip l set dev * address *:*:*'
  - os.full:
    - '*ip l set dev * address *:*:*'
  - host.hostname:
    - '*ip l set dev * address *:*:*'
  - event.original:
    - '*ip l set dev * address *:*:*'
  - email.subject:
    - '*ip l set dev * address *:*:*'
  - device.model.name:
    - '*ip l set dev * address *:*:*'
  - container.image.name:
    - '*ip l set dev * address *:*:*'
  - container.name:
    - '*ip l set dev * address *:*:*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
