title: Simple keyword detection rule for nbtscan
id: 4527927e-b7d2-4934-9e86-ba549550bdca
status: experimental
description:
- '''smb enumeration'''
references:
- https://github.com/charlesroelli/nbtscan
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/06
tags:
- attack.T1046
- attack.T1135
- attack.TA0007
- attack.TA0009
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- medium
detection:
  selection:
    ParentCommandLine:
    - '*nbtscan -r */24*'
    CommandLine:
    - '*nbtscan -r */24*'
    Details:
    - '*nbtscan -r */24*'
    registry.value:
    - '*nbtscan -r */24*'
    process.args:
    - '*nbtscan -r */24*'
    process.command_line:
    - '*nbtscan -r */24*'
    process.env_vars:
    - '*nbtscan -r */24*'
    process.io.text:
    - '*nbtscan -r */24*'
    process.title:
    - '*nbtscan -r */24*'
    pe.company:
    - '*nbtscan -r */24*'
    pe.description:
    - '*nbtscan -r */24*'
    pe.product:
    - '*nbtscan -r */24*'
    os.full:
    - '*nbtscan -r */24*'
    host.hostname:
    - '*nbtscan -r */24*'
    event.original:
    - '*nbtscan -r */24*'
    email.subject:
    - '*nbtscan -r */24*'
    device.model.name:
    - '*nbtscan -r */24*'
    container.image.name:
    - '*nbtscan -r */24*'
    container.name:
    - '*nbtscan -r */24*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
