title: Simple keyword detection rule for diskshadow
id: 628c2ab6-fd20-4ca6-85ef-a636b0c29949
status: experimental
description: Detects interesting keywords based on diskshadow tool
references: []
author: '@mthcht'
date: 2023/07/30
modified: 2024/01/21
tags:
- attack.T1005
- attack.T1059.001
- attack.T1059.003
- attack.TA0002
- attack.TA0005
- attack.TA0010
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*diskshadow list shadows all*'
  - CommandLine:
    - '*diskshadow list shadows all*'
  - Details:
    - '*diskshadow list shadows all*'
  - registry.value:
    - '*diskshadow list shadows all*'
  - process.args:
    - '*diskshadow list shadows all*'
  - process.command_line:
    - '*diskshadow list shadows all*'
  - process.env_vars:
    - '*diskshadow list shadows all*'
  - process.io.text:
    - '*diskshadow list shadows all*'
  - process.title:
    - '*diskshadow list shadows all*'
  - pe.company:
    - '*diskshadow list shadows all*'
  - pe.description:
    - '*diskshadow list shadows all*'
  - pe.product:
    - '*diskshadow list shadows all*'
  - os.full:
    - '*diskshadow list shadows all*'
  - host.hostname:
    - '*diskshadow list shadows all*'
  - event.original:
    - '*diskshadow list shadows all*'
  - email.subject:
    - '*diskshadow list shadows all*'
  - device.model.name:
    - '*diskshadow list shadows all*'
  - container.image.name:
    - '*diskshadow list shadows all*'
  - container.name:
    - '*diskshadow list shadows all*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
