title: Simple keyword detection rule for vncviewer
id: effab719-af9d-4bb4-9bab-a8d9df53aa02
status: experimental
description:
- '''linux commands abused by attackers - find guid and suid sensitives perm'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/01
tags:
- attack.T1012
- attack.T1027
- attack.T1035
- attack.T1036
- attack.T1041
- attack.T1053.005
- attack.T1057
- attack.T1059.003
- attack.T1070.001
- attack.T1083
- attack.T1105
- attack.T1112
- attack.T1136
- attack.T1562.001
- attack.T1564.001
- attack.T1564.002
- attack.T1564.003
- attack.T1564.005
- attack.TA0002
- attack.TA0003
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0010
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*vncviewer *.*:5901*'
    OriginalFileName:
    - '*vncviewer *.*:5901*'
    CurrentDirectory:
    - '*vncviewer *.*:5901*'
    ParentImage:
    - '*vncviewer *.*:5901*'
    ParentCommandLine:
    - '*vncviewer *.*:5901*'
    TargetFilename:
    - '*vncviewer *.*:5901*'
    Signature:
    - '*vncviewer *.*:5901*'
    signature:
    - '*vncviewer *.*:5901*'
    ImageLoaded:
    - '*vncviewer *.*:5901*'
    Company:
    - '*vncviewer *.*:5901*'
    Description:
    - '*vncviewer *.*:5901*'
    description:
    - '*vncviewer *.*:5901*'
    CommandLine:
    - '*vncviewer *.*:5901*'
    SourceImage:
    - '*vncviewer *.*:5901*'
    TargetImage:
    - '*vncviewer *.*:5901*'
    CallTrace:
    - '*vncviewer *.*:5901*'
    TargetObject:
    - '*vncviewer *.*:5901*'
    Details:
    - '*vncviewer *.*:5901*'
    PipeName:
    - '*vncviewer *.*:5901*'
    Consumer:
    - '*vncviewer *.*:5901*'
    Destination:
    - '*vncviewer *.*:5901*'
    Name:
    - '*vncviewer *.*:5901*'
    Query:
    - '*vncviewer *.*:5901*'
    NewName:
    - '*vncviewer *.*:5901*'
    StartAddress:
    - '*vncviewer *.*:5901*'
    StartModule:
    - '*vncviewer *.*:5901*'
    StartFunction:
    - '*vncviewer *.*:5901*'
    SourceHostname:
    - '*vncviewer *.*:5901*'
    Device:
    - '*vncviewer *.*:5901*'
    file_name:
    - '*vncviewer *.*:5901*'
    file_path:
    - '*vncviewer *.*:5901*'
    process:
    - '*vncviewer *.*:5901*'
    original_file_name:
    - '*vncviewer *.*:5901*'
    parent_process:
    - '*vncviewer *.*:5901*'
    process_path:
    - '*vncviewer *.*:5901*'
    service_path:
    - '*vncviewer *.*:5901*'
    registry_path:
    - '*vncviewer *.*:5901*'
    registry_value_data:
    - '*vncviewer *.*:5901*'
    registry_value_name:
    - '*vncviewer *.*:5901*'
    ContextInfo:
    - '*vncviewer *.*:5901*'
    Payload:
    - '*vncviewer *.*:5901*'
    ScriptBlockText:
    - '*vncviewer *.*:5901*'
    ServerName:
    - '*vncviewer *.*:5901*'
    TransportName:
    - '*vncviewer *.*:5901*'
    NewProcessName:
    - '*vncviewer *.*:5901*'
    ParentProcessName:
    - '*vncviewer *.*:5901*'
    Application:
    - '*vncviewer *.*:5901*'
    Product Name:
    - '*vncviewer *.*:5901*'
    Threat Name:
    - '*vncviewer *.*:5901*'
    Process Name:
    - '*vncviewer *.*:5901*'
    Path:
    - '*vncviewer *.*:5901*'
    ImagePath:
    - '*vncviewer *.*:5901*'
    ServiceName:
    - '*vncviewer *.*:5901*'
    ProcessPath:
    - '*vncviewer *.*:5901*'
    AppName:
    - '*vncviewer *.*:5901*'
    AppPath:
    - '*vncviewer *.*:5901*'
    ModulePath:
    - '*vncviewer *.*:5901*'
    registry.data.strings:
    - '*vncviewer *.*:5901*'
    registry.path:
    - '*vncviewer *.*:5901*'
    registry.value:
    - '*vncviewer *.*:5901*'
    process.args:
    - '*vncviewer *.*:5901*'
    process.command_line:
    - '*vncviewer *.*:5901*'
    process.env_vars:
    - '*vncviewer *.*:5901*'
    process.io.text:
    - '*vncviewer *.*:5901*'
    process.executable:
    - '*vncviewer *.*:5901*'
    process.name:
    - '*vncviewer *.*:5901*'
    process.title:
    - '*vncviewer *.*:5901*'
    pe.company:
    - '*vncviewer *.*:5901*'
    pe.description:
    - '*vncviewer *.*:5901*'
    pe.original_file_name:
    - '*vncviewer *.*:5901*'
    pe.product:
    - '*vncviewer *.*:5901*'
    os.full:
    - '*vncviewer *.*:5901*'
    host.hostname:
    - '*vncviewer *.*:5901*'
    file.fork_name:
    - '*vncviewer *.*:5901*'
    file.name:
    - '*vncviewer *.*:5901*'
    file.path:
    - '*vncviewer *.*:5901*'
    file.target_path:
    - '*vncviewer *.*:5901*'
    email.attachments.file.name:
    - '*vncviewer *.*:5901*'
    email.subject:
    - '*vncviewer *.*:5901*'
    dll.path:
    - '*vncviewer *.*:5901*'
    device.model.name:
    - '*vncviewer *.*:5901*'
    container.image.name:
    - '*vncviewer *.*:5901*'
    container.name:
    - '*vncviewer *.*:5901*'
    object:
    - '*vncviewer *.*:5901*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
