title: Simple keyword detection rule for backdoor keyword
id: 29bc22ed-e60c-49cf-b4e5-d2b0ef6f9b22
status: experimental
description:
- '''keyword observed in multiple backdoor tools'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/02
tags:
- attack.T1001.002
- attack.T1003.001
- attack.T1037.001
- attack.T1037.002
- attack.T1055.001
- attack.TA0005
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0009
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*Backdoor.*'
    OriginalFileName:
    - '*Backdoor.*'
    CurrentDirectory:
    - '*Backdoor.*'
    ParentImage:
    - '*Backdoor.*'
    ParentCommandLine:
    - '*Backdoor.*'
    TargetFilename:
    - '*Backdoor.*'
    Signature:
    - '*Backdoor.*'
    signature:
    - '*Backdoor.*'
    ImageLoaded:
    - '*Backdoor.*'
    Company:
    - '*Backdoor.*'
    Description:
    - '*Backdoor.*'
    description:
    - '*Backdoor.*'
    CommandLine:
    - '*Backdoor.*'
    SourceImage:
    - '*Backdoor.*'
    TargetImage:
    - '*Backdoor.*'
    CallTrace:
    - '*Backdoor.*'
    TargetObject:
    - '*Backdoor.*'
    Details:
    - '*Backdoor.*'
    PipeName:
    - '*Backdoor.*'
    Consumer:
    - '*Backdoor.*'
    Destination:
    - '*Backdoor.*'
    Name:
    - '*Backdoor.*'
    Query:
    - '*Backdoor.*'
    NewName:
    - '*Backdoor.*'
    StartAddress:
    - '*Backdoor.*'
    StartModule:
    - '*Backdoor.*'
    StartFunction:
    - '*Backdoor.*'
    SourceHostname:
    - '*Backdoor.*'
    Device:
    - '*Backdoor.*'
    file_name:
    - '*Backdoor.*'
    file_path:
    - '*Backdoor.*'
    process:
    - '*Backdoor.*'
    original_file_name:
    - '*Backdoor.*'
    parent_process:
    - '*Backdoor.*'
    process_path:
    - '*Backdoor.*'
    service_path:
    - '*Backdoor.*'
    registry_path:
    - '*Backdoor.*'
    registry_value_data:
    - '*Backdoor.*'
    registry_value_name:
    - '*Backdoor.*'
    ContextInfo:
    - '*Backdoor.*'
    Payload:
    - '*Backdoor.*'
    ScriptBlockText:
    - '*Backdoor.*'
    ServerName:
    - '*Backdoor.*'
    TransportName:
    - '*Backdoor.*'
    NewProcessName:
    - '*Backdoor.*'
    ParentProcessName:
    - '*Backdoor.*'
    Application:
    - '*Backdoor.*'
    Product Name:
    - '*Backdoor.*'
    Threat Name:
    - '*Backdoor.*'
    Process Name:
    - '*Backdoor.*'
    Path:
    - '*Backdoor.*'
    ImagePath:
    - '*Backdoor.*'
    ServiceName:
    - '*Backdoor.*'
    ProcessPath:
    - '*Backdoor.*'
    AppName:
    - '*Backdoor.*'
    AppPath:
    - '*Backdoor.*'
    ModulePath:
    - '*Backdoor.*'
    registry.data.strings:
    - '*Backdoor.*'
    registry.path:
    - '*Backdoor.*'
    registry.value:
    - '*Backdoor.*'
    process.args:
    - '*Backdoor.*'
    process.command_line:
    - '*Backdoor.*'
    process.env_vars:
    - '*Backdoor.*'
    process.io.text:
    - '*Backdoor.*'
    process.executable:
    - '*Backdoor.*'
    process.name:
    - '*Backdoor.*'
    process.title:
    - '*Backdoor.*'
    pe.company:
    - '*Backdoor.*'
    pe.description:
    - '*Backdoor.*'
    pe.original_file_name:
    - '*Backdoor.*'
    pe.product:
    - '*Backdoor.*'
    os.full:
    - '*Backdoor.*'
    host.hostname:
    - '*Backdoor.*'
    file.fork_name:
    - '*Backdoor.*'
    file.name:
    - '*Backdoor.*'
    file.path:
    - '*Backdoor.*'
    file.target_path:
    - '*Backdoor.*'
    email.attachments.file.name:
    - '*Backdoor.*'
    email.subject:
    - '*Backdoor.*'
    dll.path:
    - '*Backdoor.*'
    device.model.name:
    - '*Backdoor.*'
    container.image.name:
    - '*Backdoor.*'
    container.name:
    - '*Backdoor.*'
    object:
    - '*Backdoor.*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
