title: Simple keyword detection rule for systeminfo
id: 2407086b-c8cb-4d16-bcbf-3e7d7f07bc68
status: experimental
description: Detects interesting keywords based on systeminfo tool
references:
- https://thedfirreport.com/2024/08/26/blacksuit-ransomware/
author: '@mthcht'
date: 2023/07/30
modified: 2024/11/02
tags:
- attack.T1012
- attack.T1033
- attack.T1082
- attack.TA0002
- attack.TA0007
logsource:
  category:
  - endpoint
detection:
  selection:
  - ParentCommandLine:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - CommandLine:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - Details:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - registry.value:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - process.args:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - process.command_line:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - process.env_vars:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - process.io.text:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - process.title:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - pe.company:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - pe.description:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - pe.product:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - os.full:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - host.hostname:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - event.original:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - email.subject:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - device.model.name:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - container.image.name:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  - container.name:
    - '*cmd /c systeminfo*'
    - '*cmd.exe /c systeminfo*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
falsepositives:
- unknown
level: medium
