title: Simple keyword detection rule for wifigrabber
id: 84772081-7194-4ba2-b594-004b6362c0df
status: experimental
description:
- '''grab wifi password and exfiltrate to a given site'''
references:
- https://github.com/hak5/omg-payloads/tree/master/payloads/library/credentials/wifigrabber
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/25
tags:
- attack.T1056.005
- attack.T1071.001
- attack.T1119
- attack.T1552.001
- attack.TA0004
- attack.TA0006
- attack.TA0010
- attack.TA0040
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- high
detection:
  selection:
    ParentCommandLine:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    CommandLine:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    Details:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    registry.value:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    process.args:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    process.command_line:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    process.env_vars:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    process.io.text:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    process.title:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    pe.company:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    pe.description:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    pe.product:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    os.full:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    host.hostname:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    event.original:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    email.subject:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    device.model.name:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    container.image.name:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    container.name:
    - '*String netsh wlan export profile key=clear*'
    - '* -InFile Wi-Fi-PASS*'
    - '* > Wi-Fi-PASS*'
    - '*/credentials/wifigrabber*'
    Image:
    - '*/credentials/wifigrabber*'
    OriginalFileName:
    - '*/credentials/wifigrabber*'
    CurrentDirectory:
    - '*/credentials/wifigrabber*'
    ParentImage:
    - '*/credentials/wifigrabber*'
    TargetFilename:
    - '*/credentials/wifigrabber*'
    Signature:
    - '*/credentials/wifigrabber*'
    signature:
    - '*/credentials/wifigrabber*'
    ImageLoaded:
    - '*/credentials/wifigrabber*'
    Company:
    - '*/credentials/wifigrabber*'
    Description:
    - '*/credentials/wifigrabber*'
    description:
    - '*/credentials/wifigrabber*'
    SourceImage:
    - '*/credentials/wifigrabber*'
    TargetImage:
    - '*/credentials/wifigrabber*'
    CallTrace:
    - '*/credentials/wifigrabber*'
    TargetObject:
    - '*/credentials/wifigrabber*'
    PipeName:
    - '*/credentials/wifigrabber*'
    Consumer:
    - '*/credentials/wifigrabber*'
    Destination:
    - '*/credentials/wifigrabber*'
    Name:
    - '*/credentials/wifigrabber*'
    Query:
    - '*/credentials/wifigrabber*'
    NewName:
    - '*/credentials/wifigrabber*'
    StartAddress:
    - '*/credentials/wifigrabber*'
    StartModule:
    - '*/credentials/wifigrabber*'
    StartFunction:
    - '*/credentials/wifigrabber*'
    SourceHostname:
    - '*/credentials/wifigrabber*'
    Device:
    - '*/credentials/wifigrabber*'
    file_name:
    - '*/credentials/wifigrabber*'
    file_path:
    - '*/credentials/wifigrabber*'
    process:
    - '*/credentials/wifigrabber*'
    original_file_name:
    - '*/credentials/wifigrabber*'
    parent_process:
    - '*/credentials/wifigrabber*'
    process_path:
    - '*/credentials/wifigrabber*'
    service_path:
    - '*/credentials/wifigrabber*'
    registry_path:
    - '*/credentials/wifigrabber*'
    registry_value_data:
    - '*/credentials/wifigrabber*'
    registry_value_name:
    - '*/credentials/wifigrabber*'
    ContextInfo:
    - '*/credentials/wifigrabber*'
    Payload:
    - '*/credentials/wifigrabber*'
    ScriptBlockText:
    - '*/credentials/wifigrabber*'
    ServerName:
    - '*/credentials/wifigrabber*'
    TransportName:
    - '*/credentials/wifigrabber*'
    NewProcessName:
    - '*/credentials/wifigrabber*'
    ParentProcessName:
    - '*/credentials/wifigrabber*'
    Application:
    - '*/credentials/wifigrabber*'
    Product Name:
    - '*/credentials/wifigrabber*'
    Threat Name:
    - '*/credentials/wifigrabber*'
    Process Name:
    - '*/credentials/wifigrabber*'
    Path:
    - '*/credentials/wifigrabber*'
    ImagePath:
    - '*/credentials/wifigrabber*'
    ServiceName:
    - '*/credentials/wifigrabber*'
    ProcessPath:
    - '*/credentials/wifigrabber*'
    AppName:
    - '*/credentials/wifigrabber*'
    AppPath:
    - '*/credentials/wifigrabber*'
    ModulePath:
    - '*/credentials/wifigrabber*'
    registry.data.strings:
    - '*/credentials/wifigrabber*'
    registry.path:
    - '*/credentials/wifigrabber*'
    process.executable:
    - '*/credentials/wifigrabber*'
    process.name:
    - '*/credentials/wifigrabber*'
    pe.original_file_name:
    - '*/credentials/wifigrabber*'
    file.fork_name:
    - '*/credentials/wifigrabber*'
    file.name:
    - '*/credentials/wifigrabber*'
    file.path:
    - '*/credentials/wifigrabber*'
    file.target_path:
    - '*/credentials/wifigrabber*'
    email.attachments.file.name:
    - '*/credentials/wifigrabber*'
    dll.path:
    - '*/credentials/wifigrabber*'
    object:
    - '*/credentials/wifigrabber*'
    url:
    - '*/credentials/wifigrabber*'
    dest_url:
    - '*/credentials/wifigrabber*'
    uri:
    - '*/credentials/wifigrabber*'
    uri_query:
    - '*/credentials/wifigrabber*'
    query:
    - '*/credentials/wifigrabber*'
    url_domain:
    - '*/credentials/wifigrabber*'
    uri_path:
    - '*/credentials/wifigrabber*'
    domain:
    - '*/credentials/wifigrabber*'
    QueryName:
    - '*/credentials/wifigrabber*'
    QueryResults:
    - '*/credentials/wifigrabber*'
    DestinationHostname:
    - '*/credentials/wifigrabber*'
    DestinationIp:
    - '*/credentials/wifigrabber*'
    http_referrer:
    - '*/credentials/wifigrabber*'
    http_referrer_domain:
    - '*/credentials/wifigrabber*'
    http_user_agent:
    - '*/credentials/wifigrabber*'
    dest_nt_host:
    - '*/credentials/wifigrabber*'
    sender:
    - '*/credentials/wifigrabber*'
    recipient:
    - '*/credentials/wifigrabber*'
    orig_recipient:
    - '*/credentials/wifigrabber*'
    subject:
    - '*/credentials/wifigrabber*'
    url.domain:
    - '*/credentials/wifigrabber*'
    url.full:
    - '*/credentials/wifigrabber*'
    url.original:
    - '*/credentials/wifigrabber*'
    url.query:
    - '*/credentials/wifigrabber*'
    user_agent.original:
    - '*/credentials/wifigrabber*'
    network.application:
    - '*/credentials/wifigrabber*'
    http.request.body.content:
    - '*/credentials/wifigrabber*'
    http.request.referrer:
    - '*/credentials/wifigrabber*'
    email.from.address:
    - '*/credentials/wifigrabber*'
    dns.question.name:
    - '*/credentials/wifigrabber*'
    destination.domain:
    - '*/credentials/wifigrabber*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
