title: Simple keyword detection rule for JohnTheRipper
id: eefd748a-6c29-467b-b896-2ad0ca091017
status: experimental
description:
- '''John the Ripper is a fast password cracker.'''
references:
- https://github.com/magnumripper/JohnTheRipper
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/28
tags:
- attack.T1003.001
- attack.T1110
- attack.TA0006
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    OriginalFileName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    CurrentDirectory:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ParentImage:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ParentCommandLine:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    TargetFilename:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Signature:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    signature:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ImageLoaded:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Company:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Description:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    description:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    CommandLine:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    SourceImage:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    TargetImage:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    CallTrace:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    TargetObject:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Details:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    PipeName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Consumer:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Destination:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Query:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    NewName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    StartAddress:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    StartModule:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    StartFunction:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    SourceHostname:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Device:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    file_name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    file_path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    process:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    original_file_name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    parent_process:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    process_path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    service_path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    registry_path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    registry_value_data:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    registry_value_name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ContextInfo:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Payload:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ScriptBlockText:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ServerName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    TransportName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    NewProcessName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ParentProcessName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Application:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Product Name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Threat Name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Process Name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    Path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ImagePath:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ServiceName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ProcessPath:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    AppName:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    AppPath:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    ModulePath:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    registry.data.strings:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    registry.path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    registry.value:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    process.args:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    process.command_line:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    process.env_vars:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    process.io.text:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    process.executable:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    process.name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    process.title:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    pe.company:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    pe.description:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    pe.original_file_name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    pe.product:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    os.full:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    host.hostname:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    file.fork_name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    file.name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    file.path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    file.target_path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    email.attachments.file.name:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    email.subject:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    dll.path:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    device.model.name:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    container.image.name:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    container.name:
    - '*John*the*Ripper*'
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
    - '*john NTDS.dit*'
    object:
    - '*John*the*Ripper*'
    - '*john NTDS.dit*'
    event.original:
    - '* --format=NT -w=*_password.txt*'
    - '*john * --wordlist=*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- event.original
