title: Simple keyword detection rule for unset
id: a8e6c72d-f475-4c9c-99a6-aa9c3ce93b5d
status: experimental
description:
- '''disable history logging'''
- '''linux commands abused by attackers'''
references:
- https://github.com/hak5/omg-payloads/tree/master/payloads/library/credentials/OMGLogger
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/28
tags:
- attack.T1012
- attack.T1027
- attack.T1035
- attack.T1036
- attack.T1041
- attack.T1053.005
- attack.T1056.001
- attack.T1057
- attack.T1059.003
- attack.T1070.001
- attack.T1083
- attack.T1105
- attack.T1112
- attack.T1136
- attack.T1562.001
- attack.T1564.001
- attack.T1564.002
- attack.T1564.003
- attack.T1564.005
- attack.TA0002
- attack.TA0003
- attack.TA0004
- attack.TA0006
- attack.TA0007
- attack.TA0008
- attack.TA0010
- attack.TA0040
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- high
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    CommandLine:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    Details:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    registry.value:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    process.args:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    process.command_line:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    process.env_vars:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    process.io.text:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    process.title:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    pe.company:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    pe.description:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    pe.product:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    os.full:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    host.hostname:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    event.original:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    email.subject:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    device.model.name:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    container.image.name:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    container.name:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    - '*unset HISTFILE*'
    url:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    dest_url:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    uri:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    uri_query:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    query:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    url_domain:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    uri_path:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    domain:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    QueryName:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    QueryResults:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    DestinationHostname:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    DestinationIp:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    http_referrer:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    http_referrer_domain:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    http_user_agent:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    dest_nt_host:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    sender:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    recipient:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    orig_recipient:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    subject:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    url.domain:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    url.full:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    url.original:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    url.query:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    user_agent.original:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    network.application:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    http.request.body.content:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    http.request.referrer:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    email.from.address:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    dns.question.name:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    destination.domain:
    - '*unset HISTFILE && HISTSIZE=0 && rm -f $HISTFILE && unset HISTFILE*'
    Image:
    - '*unset HISTFILE*'
    OriginalFileName:
    - '*unset HISTFILE*'
    CurrentDirectory:
    - '*unset HISTFILE*'
    ParentImage:
    - '*unset HISTFILE*'
    TargetFilename:
    - '*unset HISTFILE*'
    Signature:
    - '*unset HISTFILE*'
    signature:
    - '*unset HISTFILE*'
    ImageLoaded:
    - '*unset HISTFILE*'
    Company:
    - '*unset HISTFILE*'
    Description:
    - '*unset HISTFILE*'
    description:
    - '*unset HISTFILE*'
    SourceImage:
    - '*unset HISTFILE*'
    TargetImage:
    - '*unset HISTFILE*'
    CallTrace:
    - '*unset HISTFILE*'
    TargetObject:
    - '*unset HISTFILE*'
    PipeName:
    - '*unset HISTFILE*'
    Consumer:
    - '*unset HISTFILE*'
    Destination:
    - '*unset HISTFILE*'
    Name:
    - '*unset HISTFILE*'
    Query:
    - '*unset HISTFILE*'
    NewName:
    - '*unset HISTFILE*'
    StartAddress:
    - '*unset HISTFILE*'
    StartModule:
    - '*unset HISTFILE*'
    StartFunction:
    - '*unset HISTFILE*'
    SourceHostname:
    - '*unset HISTFILE*'
    Device:
    - '*unset HISTFILE*'
    file_name:
    - '*unset HISTFILE*'
    file_path:
    - '*unset HISTFILE*'
    process:
    - '*unset HISTFILE*'
    original_file_name:
    - '*unset HISTFILE*'
    parent_process:
    - '*unset HISTFILE*'
    process_path:
    - '*unset HISTFILE*'
    service_path:
    - '*unset HISTFILE*'
    registry_path:
    - '*unset HISTFILE*'
    registry_value_data:
    - '*unset HISTFILE*'
    registry_value_name:
    - '*unset HISTFILE*'
    ContextInfo:
    - '*unset HISTFILE*'
    Payload:
    - '*unset HISTFILE*'
    ScriptBlockText:
    - '*unset HISTFILE*'
    ServerName:
    - '*unset HISTFILE*'
    TransportName:
    - '*unset HISTFILE*'
    NewProcessName:
    - '*unset HISTFILE*'
    ParentProcessName:
    - '*unset HISTFILE*'
    Application:
    - '*unset HISTFILE*'
    Product Name:
    - '*unset HISTFILE*'
    Threat Name:
    - '*unset HISTFILE*'
    Process Name:
    - '*unset HISTFILE*'
    Path:
    - '*unset HISTFILE*'
    ImagePath:
    - '*unset HISTFILE*'
    ServiceName:
    - '*unset HISTFILE*'
    ProcessPath:
    - '*unset HISTFILE*'
    AppName:
    - '*unset HISTFILE*'
    AppPath:
    - '*unset HISTFILE*'
    ModulePath:
    - '*unset HISTFILE*'
    registry.data.strings:
    - '*unset HISTFILE*'
    registry.path:
    - '*unset HISTFILE*'
    process.executable:
    - '*unset HISTFILE*'
    process.name:
    - '*unset HISTFILE*'
    pe.original_file_name:
    - '*unset HISTFILE*'
    file.fork_name:
    - '*unset HISTFILE*'
    file.name:
    - '*unset HISTFILE*'
    file.path:
    - '*unset HISTFILE*'
    file.target_path:
    - '*unset HISTFILE*'
    email.attachments.file.name:
    - '*unset HISTFILE*'
    dll.path:
    - '*unset HISTFILE*'
    object:
    - '*unset HISTFILE*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
