title: Simple keyword detection rule for nltest
id: 79b5c70e-b582-48c1-8e87-08399dd397d0
status: experimental
description:
- '''enumerate domain trusts with nltest'''
- '''query domain trusts with adfind'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/29
tags:
- attack.T1018
- attack.T1482
- attack.TA0007
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    CommandLine:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    Details:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    registry.value:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    process.args:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    process.command_line:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    process.env_vars:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    process.io.text:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    process.title:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    pe.company:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    pe.description:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    pe.product:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    os.full:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    host.hostname:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    event.original:
    - '*adfind -f objectclass=trusteddomain*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    email.subject:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    device.model.name:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    container.image.name:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    container.name:
    - '*adfind -f objectclass=trusteddomain*'
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    - '*adfind.exe -sc trustdmp*'
    - '*adfind.exe -f objectclass=trusteddomain*'
    - '*adfind -sc trustdmp*'
    Image:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    OriginalFileName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    CurrentDirectory:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ParentImage:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    TargetFilename:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Signature:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    signature:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ImageLoaded:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Company:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Description:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    description:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    SourceImage:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    TargetImage:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    CallTrace:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    TargetObject:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    PipeName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Consumer:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Destination:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Query:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    NewName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    StartAddress:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    StartModule:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    StartFunction:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    SourceHostname:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Device:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    file_name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    file_path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    process:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    original_file_name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    parent_process:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    process_path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    service_path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    registry_path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    registry_value_data:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    registry_value_name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ContextInfo:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Payload:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ScriptBlockText:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ServerName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    TransportName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    NewProcessName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ParentProcessName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Application:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Product Name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Threat Name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Process Name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    Path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ImagePath:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ServiceName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ProcessPath:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    AppName:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    AppPath:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    ModulePath:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    registry.data.strings:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    registry.path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    process.executable:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    process.name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    pe.original_file_name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    file.fork_name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    file.name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    file.path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    file.target_path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    email.attachments.file.name:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    dll.path:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
    object:
    - '*nltest /all_trusts*'
    - '*nltest /domain_trusts*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
