title: Simple keyword detection rule for mitm6
id: bae1af0e-2163-4dec-bedf-4ccf6a945480
status: experimental
description:
- '''performs MiTM for IPv6'''
references:
- https://github.com/fox-it/mitm6
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/11
tags:
- attack.T1547
- attack.T1557
- attack.T1562
- attack.T1569
- attack.T1573
- attack.TA0002
- attack.TA0003
- attack.TA0008
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*mitm6.py*'
    OriginalFileName:
    - '*mitm6.py*'
    CurrentDirectory:
    - '*mitm6.py*'
    ParentImage:
    - '*mitm6.py*'
    ParentCommandLine:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    TargetFilename:
    - '*mitm6.py*'
    Signature:
    - '*mitm6.py*'
    signature:
    - '*mitm6.py*'
    ImageLoaded:
    - '*mitm6.py*'
    Company:
    - '*mitm6.py*'
    Description:
    - '*mitm6.py*'
    description:
    - '*mitm6.py*'
    CommandLine:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    SourceImage:
    - '*mitm6.py*'
    TargetImage:
    - '*mitm6.py*'
    CallTrace:
    - '*mitm6.py*'
    TargetObject:
    - '*mitm6.py*'
    Details:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    PipeName:
    - '*mitm6.py*'
    Consumer:
    - '*mitm6.py*'
    Destination:
    - '*mitm6.py*'
    Name:
    - '*mitm6.py*'
    Query:
    - '*mitm6.py*'
    NewName:
    - '*mitm6.py*'
    StartAddress:
    - '*mitm6.py*'
    StartModule:
    - '*mitm6.py*'
    StartFunction:
    - '*mitm6.py*'
    SourceHostname:
    - '*mitm6.py*'
    Device:
    - '*mitm6.py*'
    file_name:
    - '*mitm6.py*'
    file_path:
    - '*mitm6.py*'
    process:
    - '*mitm6.py*'
    original_file_name:
    - '*mitm6.py*'
    parent_process:
    - '*mitm6.py*'
    process_path:
    - '*mitm6.py*'
    service_path:
    - '*mitm6.py*'
    registry_path:
    - '*mitm6.py*'
    registry_value_data:
    - '*mitm6.py*'
    registry_value_name:
    - '*mitm6.py*'
    ContextInfo:
    - '*mitm6.py*'
    Payload:
    - '*mitm6.py*'
    ScriptBlockText:
    - '*mitm6.py*'
    ServerName:
    - '*mitm6.py*'
    TransportName:
    - '*mitm6.py*'
    NewProcessName:
    - '*mitm6.py*'
    ParentProcessName:
    - '*mitm6.py*'
    Application:
    - '*mitm6.py*'
    Product Name:
    - '*mitm6.py*'
    Threat Name:
    - '*mitm6.py*'
    Process Name:
    - '*mitm6.py*'
    Path:
    - '*mitm6.py*'
    ImagePath:
    - '*mitm6.py*'
    ServiceName:
    - '*mitm6.py*'
    ProcessPath:
    - '*mitm6.py*'
    AppName:
    - '*mitm6.py*'
    AppPath:
    - '*mitm6.py*'
    ModulePath:
    - '*mitm6.py*'
    registry.data.strings:
    - '*mitm6.py*'
    registry.path:
    - '*mitm6.py*'
    registry.value:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    process.args:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    process.command_line:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    process.env_vars:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    process.io.text:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    process.executable:
    - '*mitm6.py*'
    process.name:
    - '*mitm6.py*'
    process.title:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    pe.company:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    pe.description:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    pe.original_file_name:
    - '*mitm6.py*'
    pe.product:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    os.full:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    host.hostname:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    file.fork_name:
    - '*mitm6.py*'
    file.name:
    - '*mitm6.py*'
    file.path:
    - '*mitm6.py*'
    file.target_path:
    - '*mitm6.py*'
    email.attachments.file.name:
    - '*mitm6.py*'
    email.subject:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    dll.path:
    - '*mitm6.py*'
    device.model.name:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    container.image.name:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    container.name:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    object:
    - '*mitm6.py*'
    url:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    dest_url:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    uri:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    uri_query:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    query:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    url_domain:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    uri_path:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    domain:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    QueryName:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    QueryResults:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    DestinationHostname:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    DestinationIp:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    http_referrer:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    http_referrer_domain:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    http_user_agent:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    dest_nt_host:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    sender:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    recipient:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    orig_recipient:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    subject:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    url.domain:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    url.full:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    url.original:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    url.query:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    user_agent.original:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    network.application:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    http.request.body.content:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    http.request.referrer:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    email.from.address:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    dns.question.name:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    destination.domain:
    - '*mitm6.py*'
    - '*mitm6 -d *'
    event.original:
    - '*mitm6 -d *'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
- event.original
