title: Simple keyword detection rule for ntdsutil
id: 78a4694c-92cb-4bd7-bfde-2c98ac34c89b
status: experimental
description:
- '''creating a full backup of the Active Directory database and saving it to the
  \temp directory'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/19
tags:
- attack.T1003.001
- attack.T1059
- attack.T1070.004
- attack.TA0002
- attack.TA0003
- attack.TA0005
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*\system32.zip*'
    OriginalFileName:
    - '*\system32.zip*'
    CurrentDirectory:
    - '*\system32.zip*'
    ParentImage:
    - '*\system32.zip*'
    ParentCommandLine:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    TargetFilename:
    - '*\system32.zip*'
    Signature:
    - '*\system32.zip*'
    signature:
    - '*\system32.zip*'
    ImageLoaded:
    - '*\system32.zip*'
    Company:
    - '*\system32.zip*'
    Description:
    - '*\system32.zip*'
    description:
    - '*\system32.zip*'
    CommandLine:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    SourceImage:
    - '*\system32.zip*'
    TargetImage:
    - '*\system32.zip*'
    CallTrace:
    - '*\system32.zip*'
    TargetObject:
    - '*\system32.zip*'
    Details:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    PipeName:
    - '*\system32.zip*'
    Consumer:
    - '*\system32.zip*'
    Destination:
    - '*\system32.zip*'
    Name:
    - '*\system32.zip*'
    Query:
    - '*\system32.zip*'
    NewName:
    - '*\system32.zip*'
    StartAddress:
    - '*\system32.zip*'
    StartModule:
    - '*\system32.zip*'
    StartFunction:
    - '*\system32.zip*'
    SourceHostname:
    - '*\system32.zip*'
    Device:
    - '*\system32.zip*'
    file_name:
    - '*\system32.zip*'
    file_path:
    - '*\system32.zip*'
    process:
    - '*\system32.zip*'
    original_file_name:
    - '*\system32.zip*'
    parent_process:
    - '*\system32.zip*'
    process_path:
    - '*\system32.zip*'
    service_path:
    - '*\system32.zip*'
    registry_path:
    - '*\system32.zip*'
    registry_value_data:
    - '*\system32.zip*'
    registry_value_name:
    - '*\system32.zip*'
    ContextInfo:
    - '*\system32.zip*'
    Payload:
    - '*\system32.zip*'
    ScriptBlockText:
    - '*\system32.zip*'
    ServerName:
    - '*\system32.zip*'
    TransportName:
    - '*\system32.zip*'
    NewProcessName:
    - '*\system32.zip*'
    ParentProcessName:
    - '*\system32.zip*'
    Application:
    - '*\system32.zip*'
    Product Name:
    - '*\system32.zip*'
    Threat Name:
    - '*\system32.zip*'
    Process Name:
    - '*\system32.zip*'
    Path:
    - '*\system32.zip*'
    ImagePath:
    - '*\system32.zip*'
    ServiceName:
    - '*\system32.zip*'
    ProcessPath:
    - '*\system32.zip*'
    AppName:
    - '*\system32.zip*'
    AppPath:
    - '*\system32.zip*'
    ModulePath:
    - '*\system32.zip*'
    registry.data.strings:
    - '*\system32.zip*'
    registry.path:
    - '*\system32.zip*'
    registry.value:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    process.args:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    process.command_line:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    process.env_vars:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    process.io.text:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    process.executable:
    - '*\system32.zip*'
    process.name:
    - '*\system32.zip*'
    process.title:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    pe.company:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    pe.description:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    pe.original_file_name:
    - '*\system32.zip*'
    pe.product:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    os.full:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    host.hostname:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    file.fork_name:
    - '*\system32.zip*'
    file.name:
    - '*\system32.zip*'
    file.path:
    - '*\system32.zip*'
    file.target_path:
    - '*\system32.zip*'
    email.attachments.file.name:
    - '*\system32.zip*'
    email.subject:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    dll.path:
    - '*\system32.zip*'
    device.model.name:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    container.image.name:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    container.name:
    - '*\system32.zip*'
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
    object:
    - '*\system32.zip*'
    event.original:
    - '*ntdsutil.exe *ac i ntds*ifm*create full *temp*'
    - '*ntdsutil *ac i ntds* *create full*\temp*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- event.original
