title: Simple keyword detection rule for copy
id: bd205e89-c64c-4562-a6f4-d315f82aebc8
status: experimental
description:
- '''copy the NTDS.dit file from a Volume Shadow Copy which contains sensitive Active
  Directory data including password hashes for all domain users'''
- '''the actor creating a Shadow Copy and then extracting a copy of the ntds.dit file
  from it.'''
references:
- https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/08/13
tags:
- attack.T1003.001
- attack.T1003.003
- attack.T1070.004
- attack.T1567.001
- attack.TA0003
- attack.TA0005
- attack.TA0007
- attack.TA0009
logsource:
  category:
  - endpoint
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    ParentCommandLine:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    CommandLine:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    Details:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    registry.value:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    process.args:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    process.command_line:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    process.env_vars:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    process.io.text:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    process.title:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    pe.company:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    pe.description:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    pe.product:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    os.full:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    host.hostname:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    event.original:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    email.subject:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    device.model.name:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    container.image.name:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    container.name:
    - '*copy *\NTDS\ntds.dit *\Temp\*.tmp*'
    - '*copy *NTDS\NTDS.dit*Temp*'
    Image:
    - '*copy *NTDS\NTDS.dit*Temp*'
    OriginalFileName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    CurrentDirectory:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ParentImage:
    - '*copy *NTDS\NTDS.dit*Temp*'
    TargetFilename:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Signature:
    - '*copy *NTDS\NTDS.dit*Temp*'
    signature:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ImageLoaded:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Company:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Description:
    - '*copy *NTDS\NTDS.dit*Temp*'
    description:
    - '*copy *NTDS\NTDS.dit*Temp*'
    SourceImage:
    - '*copy *NTDS\NTDS.dit*Temp*'
    TargetImage:
    - '*copy *NTDS\NTDS.dit*Temp*'
    CallTrace:
    - '*copy *NTDS\NTDS.dit*Temp*'
    TargetObject:
    - '*copy *NTDS\NTDS.dit*Temp*'
    PipeName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Consumer:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Destination:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Query:
    - '*copy *NTDS\NTDS.dit*Temp*'
    NewName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    StartAddress:
    - '*copy *NTDS\NTDS.dit*Temp*'
    StartModule:
    - '*copy *NTDS\NTDS.dit*Temp*'
    StartFunction:
    - '*copy *NTDS\NTDS.dit*Temp*'
    SourceHostname:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Device:
    - '*copy *NTDS\NTDS.dit*Temp*'
    file_name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    file_path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    process:
    - '*copy *NTDS\NTDS.dit*Temp*'
    original_file_name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    parent_process:
    - '*copy *NTDS\NTDS.dit*Temp*'
    process_path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    service_path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    registry_path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    registry_value_data:
    - '*copy *NTDS\NTDS.dit*Temp*'
    registry_value_name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ContextInfo:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Payload:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ScriptBlockText:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ServerName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    TransportName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    NewProcessName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ParentProcessName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Application:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Product Name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Threat Name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Process Name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    Path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ImagePath:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ServiceName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ProcessPath:
    - '*copy *NTDS\NTDS.dit*Temp*'
    AppName:
    - '*copy *NTDS\NTDS.dit*Temp*'
    AppPath:
    - '*copy *NTDS\NTDS.dit*Temp*'
    ModulePath:
    - '*copy *NTDS\NTDS.dit*Temp*'
    registry.data.strings:
    - '*copy *NTDS\NTDS.dit*Temp*'
    registry.path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    process.executable:
    - '*copy *NTDS\NTDS.dit*Temp*'
    process.name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    pe.original_file_name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    file.fork_name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    file.name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    file.path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    file.target_path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    email.attachments.file.name:
    - '*copy *NTDS\NTDS.dit*Temp*'
    dll.path:
    - '*copy *NTDS\NTDS.dit*Temp*'
    object:
    - '*copy *NTDS\NTDS.dit*Temp*'
  condition: selection
fields:
- ParentCommandLine
- CommandLine
- Details
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.title
- pe.company
- pe.description
- pe.product
- os.full
- host.hostname
- event.original
- email.subject
- device.model.name
- container.image.name
- container.name
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- process.executable
- process.name
- pe.original_file_name
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- dll.path
- object
