title: Simple keyword detection rule for telegram
id: 04c19670-5463-4137-8fc0-d044e5908a9d
status: experimental
description: Detects interesting keywords based on telegram tool
references:
- api.telegram.org
author: '@mthcht'
date: 2023/07/30
modified: 2024/10/24
tags:
- attack.T1047
- attack.T1071.004
- attack.T1102
- attack.TA0002
- attack.TA0005
- attack.TA0011
logsource:
  category:
  - network
detection:
  selection:
  - url:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - dest_url:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - uri:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - uri_query:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - query:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - url_domain:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - uri_path:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - domain:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - QueryName:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - QueryResults:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - DestinationHostname:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - DestinationIp:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - http_referrer:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - http_referrer_domain:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - http_user_agent:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - dest_nt_host:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - sender:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - recipient:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - orig_recipient:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - subject:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - url.domain:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - url.full:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - url.original:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - url.query:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - user_agent.original:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - network.application:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - http.request.body.content:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - http.request.referrer:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - email.from.address:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - dns.question.name:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  - destination.domain:
    - '*\AppData\Roaming\Telegram Desktop\tdata*'
    - '*api.telegram.org*'
  condition: selection
fields:
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
falsepositives:
- unknown
level: medium
