title: Simple keyword detection rule for phoenix miner
id: 648d79e7-d859-416e-a78a-8eebd24dd6e9
status: experimental
description:
- '''Phoenix Miner is a popular. efficient. fast. and cost-effective Ethereum miner
  with support for both AMD and Nvidia GPUs. It''s intended to be used for legitimate
  cryptocurrency mining purposes.Attackers can secretly install Phoenix Miner on unsuspecting
  users'' computers to mine cryptocurrency for themselves. This is often done by bundling
  the miner with other software or hiding it within malicious attachments or downloads.
  The computer then slow down due to the high CPU and GPU usage'''
references:
- N/A
author: '@mthcht'
date: 2023/07/30
modified: 2023/09/11
tags:
- attack.T1027
- attack.T1053.005
- attack.T1057
- attack.T1059.001
- attack.T1064
- attack.T1089
- attack.T1105
- attack.TA0002
- attack.TA0003
- attack.TA0005
- attack.TA0011
- attack.TA0040
logsource:
  category:
  - endpoint
  - network
falsepositives:
- Unknown
level:
- Unknown
detection:
  selection:
    Image:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    OriginalFileName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    CurrentDirectory:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ParentImage:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ParentCommandLine:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    TargetFilename:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Signature:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    signature:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ImageLoaded:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Company:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Description:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    description:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    CommandLine:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    SourceImage:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    TargetImage:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    CallTrace:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    TargetObject:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Details:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    PipeName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Consumer:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Destination:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Query:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    NewName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    StartAddress:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    StartModule:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    StartFunction:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    SourceHostname:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Device:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    file_name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    file_path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    original_file_name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    parent_process:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process_path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    service_path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    registry_path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    registry_value_data:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    registry_value_name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ContextInfo:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Payload:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ScriptBlockText:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ServerName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    TransportName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    NewProcessName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ParentProcessName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Application:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Product Name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Threat Name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Process Name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    Path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ImagePath:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ServiceName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ProcessPath:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    AppName:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    AppPath:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    ModulePath:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    registry.data.strings:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    registry.path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    registry.value:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process.args:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process.command_line:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process.env_vars:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process.io.text:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process.executable:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process.name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    process.title:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    pe.company:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    pe.description:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    pe.original_file_name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    pe.product:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    os.full:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    host.hostname:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    file.fork_name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    file.name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    file.path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    file.target_path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    email.attachments.file.name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    email.subject:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    dll.path:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    device.model.name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    container.image.name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    container.name:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    object:
    - '*PhoenixMiner.exe*'
    - '*PhoenixMiner_*_Windows\*'
    url:
    - '*PhoenixMiner.exe*'
    dest_url:
    - '*PhoenixMiner.exe*'
    uri:
    - '*PhoenixMiner.exe*'
    uri_query:
    - '*PhoenixMiner.exe*'
    query:
    - '*PhoenixMiner.exe*'
    url_domain:
    - '*PhoenixMiner.exe*'
    uri_path:
    - '*PhoenixMiner.exe*'
    domain:
    - '*PhoenixMiner.exe*'
    QueryName:
    - '*PhoenixMiner.exe*'
    QueryResults:
    - '*PhoenixMiner.exe*'
    DestinationHostname:
    - '*PhoenixMiner.exe*'
    DestinationIp:
    - '*PhoenixMiner.exe*'
    http_referrer:
    - '*PhoenixMiner.exe*'
    http_referrer_domain:
    - '*PhoenixMiner.exe*'
    http_user_agent:
    - '*PhoenixMiner.exe*'
    dest_nt_host:
    - '*PhoenixMiner.exe*'
    sender:
    - '*PhoenixMiner.exe*'
    recipient:
    - '*PhoenixMiner.exe*'
    orig_recipient:
    - '*PhoenixMiner.exe*'
    subject:
    - '*PhoenixMiner.exe*'
    url.domain:
    - '*PhoenixMiner.exe*'
    url.full:
    - '*PhoenixMiner.exe*'
    url.original:
    - '*PhoenixMiner.exe*'
    url.query:
    - '*PhoenixMiner.exe*'
    user_agent.original:
    - '*PhoenixMiner.exe*'
    network.application:
    - '*PhoenixMiner.exe*'
    http.request.body.content:
    - '*PhoenixMiner.exe*'
    http.request.referrer:
    - '*PhoenixMiner.exe*'
    email.from.address:
    - '*PhoenixMiner.exe*'
    dns.question.name:
    - '*PhoenixMiner.exe*'
    destination.domain:
    - '*PhoenixMiner.exe*'
  condition: selection
fields:
- Image
- OriginalFileName
- CurrentDirectory
- ParentImage
- ParentCommandLine
- TargetFilename
- Signature
- signature
- ImageLoaded
- Company
- Description
- description
- CommandLine
- SourceImage
- TargetImage
- CallTrace
- TargetObject
- Details
- PipeName
- Consumer
- Destination
- Name
- Query
- NewName
- StartAddress
- StartModule
- StartFunction
- SourceHostname
- Device
- file_name
- file_path
- process
- original_file_name
- parent_process
- process_path
- service_path
- registry_path
- registry_value_data
- registry_value_name
- ContextInfo
- Payload
- ScriptBlockText
- ServerName
- TransportName
- NewProcessName
- ParentProcessName
- Application
- Product Name
- Threat Name
- Process Name
- Path
- ImagePath
- ServiceName
- ProcessPath
- AppName
- AppPath
- ModulePath
- registry.data.strings
- registry.path
- registry.value
- process.args
- process.command_line
- process.env_vars
- process.io.text
- process.executable
- process.name
- process.title
- pe.company
- pe.description
- pe.original_file_name
- pe.product
- os.full
- host.hostname
- file.fork_name
- file.name
- file.path
- file.target_path
- email.attachments.file.name
- email.subject
- dll.path
- device.model.name
- container.image.name
- container.name
- object
- url
- dest_url
- uri
- uri_query
- query
- url_domain
- uri_path
- domain
- QueryName
- QueryResults
- DestinationHostname
- DestinationIp
- http_referrer
- http_referrer_domain
- http_user_agent
- dest_nt_host
- sender
- recipient
- orig_recipient
- subject
- url.domain
- url.full
- url.original
- url.query
- user_agent.original
- network.application
- http.request.body.content
- http.request.referrer
- email.from.address
- dns.question.name
- destination.domain
